{
	"streetNames": {
		"street": [{
				"name": "Abbey View",
				"date": "1955",
				"desc": "Battle Abbey is approximately 5 miles due north of this road. (Adopted by Borough of Bexhill, 28th June 1961).",
				"adopted": "1961-06-28"
			}, {
				"name": "Albany Road",
				"date": "1889",
				"desc": "Prince Leopold, Duke of Albany (1853 to 1884) was the eighth child and fourth son of Queen Victoria and Prince Albert. There is also a Leopold Road in Bexhill. (Adopted by Borough of Bexhill, 21st November 1898).",
				"adopted": "1898-11-21"
			}, {
				"name": "Albert Road",
				"date": "1887",
				"desc": "The present-day Albert Road is also named after Prince Albert of Saxe-Coburg and Gotha. The name was transferred in 1887 from the road which is now known as Havelock Road. (Adopted by Borough of Bexhill, 1st June 1894).",
				"adopted": "1894-06-01"
			}, {
				"name": "Alder Gardens",
				"date": "2006",
				"desc": "Alder is the common name of a genus of flowering plants (Alnus) belonging to the birch family. (Elm Close, Hazel Grove, Hornbeam Avenue and Poplar Close are nearby). (Adopted by East Sussex County Council, 19th July 2011).",
				"adopted": "2011-07-19"
			}, {
				"name": "Alexander Drive",
				"date": "1957",
				"desc": "Viscount Alexander of Hillsborough (1885 to 1965) was a British Labour Co-operative politician who was the First Lord of the Admiralty on three occasions. (Eden Drive and Winston Drive are nearby). (Adopted by Borough of Bexhill, 27th June 1962).",
				"adopted": "1962-06-27"
			}, {
				"status": "bygone",
				"name": "Alexander Road",
				"date": "1902 to 1917",
				"desc": "Previous name for the road between the present-day Woodsgate Park and Woodgate Avenue; now part of London Road."
			}, {
				"status": "bygone",
				"name": "Alexandra Road",
				"date": "1897 to 1930",
				"desc": "Previous name for the road between Cambridge Road and Sedgewick Road; now part of London Road. Initially this road ran at right angles to both Albert Road {1} and Victoria Road {1}. The name is probably derived from Queen Victoria's first given name, Alexandrina."
			}, {
				"name": "Alford Way",
				"date": "1967",
				"desc": "Village on the West Sussex and Surrey border, 9 miles west of Horsham. (Adopted by Borough of Bexhill, 22nd September 1969).",
				"adopted": "1969-11-22"
			}, {
				"name": "Alfray Road",
				"date": "1957",
				"desc": "Thomas Alfray was a local ironmaster at Buckholt forge during the late 16th century. (Adopted by Borough of Bexhill, 29th April 1959).",
				"adopted": "1959-04-29"
			}, {
				"name": "Alfriston Close",
				"date": "1970",
				"desc": "Village in East Sussex, 4 miles north-east of Seaford. (Date of adoption by Borough of Bexhill uncertain but there is an agreement to adopt the road dated 15th November 1966).",
				"adopted": "1966-11-15"
			}, {
				"name": "All Saints Lane",
				"date": "road ~1841; name 1962",
				"desc": "Adjacent to All Saints Church, Sidley. Previously part of Turkey Road before that road's route was diverted across land belonging to Sidley House to the present-day roundabout on Ninfield Road. (Taken over - as part of Turkey Road - as a Public Highway by the Local Board of Bexhill in 1884).",
				"adopted": "1884"
			}, {
				"name": "Allen Way",
				"date": "1964",
				"desc": "Family forename of one of the developers surnames, Davey-Casselden Limited. (Amanda Close, Angela Close, Christine Close, Diana Close, Gwyneth Grove, Ian Close and Lesley Close are nearby). (Adopted by Borough of Bexhill, 1st part 1st May 1967 and last part 7th February 1972).",
				"adopted": "1967-05-01;1972-02-07"
			}, {
				"name": "Amanda Close",
				"date": "after 1974 but before 1987",
				"desc": "Family forename of one of the developers surnames, Davey-Casselden Limited. (Allen Way, Angela Close, Christine Close, Diana Close, Gwyneth Grove, Ian Close and Lesley Close are nearby). (Adopted by East Sussex County Council, 1st August 1987).",
				"adopted": "1987-08-01"
			}, {
				"name": "Amherst Road",
				"date": "1887",
				"desc": "William Pitt, 1st Earl Amherst (1773 to 1857), was Governor-General of India from 1823 to 1828. In 1839 he married, secondly, the Dowager Countess of Plymouth, Mary Sackville, daughter of John Sackville, 3rd Duke of Dorset. (Adopted by Borough of Bexhill 16th September 1901).",
				"adopted": "1901-09-16"
			}, {
				"name": "Angela Close",
				"date": "1967",
				"desc": "Family forename of one of the developers surnames, Davey-Casselden Limited. (Allen Way, Amanda Close, Christine Close, Diana Close, Gwyneth Grove, Ian Close and Lesley Close are nearby). (Adopted by Borough of Bexhill 7th February 1972).",
				"adopted": "1972-02-07"
			}, {
				"name": "Antrona Close",
				"date": "1972",
				"desc": "Built on land formerly occupied by a house called Antrona (built c1950) and its surrounding garden. (Adopted by East Sussex County Council, 20th February 1976).",
				"adopted": "1976-02-20"
			}, {
				"name": "Arthur Road",
				"date": "1911",
				"desc": "Prince Arthur, Duke of Connaught and Strathearn (1850 to 1942) was the seventh child and third son of Queen Victoria and Prince Albert. (Adopted by Borough of Bexhill, 1st part 23rd December 1929 and last part 29th March 1944).",
				"adopted": "1929-12-23;1944-03-29"
			}, {
				"name": "Ashby Close",
				"date": "1955",
				"desc": "Alderman Alfred Ashby, was a local politician from about 1938 to 1955. (Davis Close is nearby). (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1966).",
				"adopted": "1966"
			}, {
				"name": "Ashcombe Drive",
				"date": "c1995",
				"desc": "The origin of the name remains unknown. Ashcombe can mean a valley where ash-trees grow, which seems an unlikely choice for this particular road. It is the name of a village in both Devon and north Somerset. Also, Ashcombe House, 2 miles south-west of Lewis is a Grade II* listed building and the official residence of the Vice Chancellor of the University of Sussex. (Adopted by East Sussex County Council, 10th September 1979).",
				"adopted": "1979-09-10"
			}, {
				"name": "Ashdown Road",
				"date": "1888",
				"desc": "Ashdown Forest is an ancient area of tranquil open heathland at the heart of the High Weald in East Sussex. It covers over 20 square miles in a roughly triangular shape between East Grinstead, Tunbridge Wells and Uckfield. An early 13th century document calls the forest Essendon which means the hill where ash trees grow. For many years the Sackville and De La Warr families have been major landowners within Ashdown Forest. (Adopted by East Sussex County Council, 26th December 1992).",
				"adopted": "1992-12-26"
			}, {
				"name": "Aspen Way",
				"date": "after 1974 but before 1998",
				"desc": "Aspen is a common name for certain tree species some, but not all, being included within the poplar tree (Populus) genus. (Mulberry Close and Spindlewood Drive are nearby). (Adopted by East Sussex County Council, 1st October 2002).",
				"adopted": "2002-10-01"
			}, {
				"name": "Auckland Close",
				"date": "2013",
				"desc": "John Lambert Walker moved to Bexhill in 1875 and lived on the Woodsgate estate. He was by then a retired merchant who had travelled widely and had interests, amongst others, in Australia and New Zealand. He was the owner of a large house called Auckland House at the junction of Wrestwood Road and Ninfield Road opposite the former Pelham Hotel. The original Auckland House was built around 1912 and demolished in the 1970s to be replaced by a second development of the same name. This second development was demolished in 2012 to be replaced by third development which includes both Wellington House and Darwin House. Wellington is the capital of New Zealand and Auckland is an important city in its north island. Darwin is in the Northern Territory of Australia. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Augers Crescent",
				"date": "2018",
				"desc": "Late Augers is the land name that appears on the Tithe map of 1839 as a meadow near to this location."
			}, {
				"name": "Badgers Mount",
				"date": "after 1974 but before 1983",
				"desc": "Badgers are short-legged, burrowing and nocturnal animals belonging to the weasel (Mustelidae) family. (Deerswood Lane, Foxhill and Squirrel Close are nearby). (Adopted by East Sussex County Council, 14th February 1983).",
				"adopted": "1983-02-14"
			}, {
				"name": "Bale Close",
				"date": "1963",
				"desc": "The origin of the name remains uncertain but maybe it is the rural connection of bales of hay or straw as land in this area was previously meadows and orchards belonging to Hurchington Farm. (Fowlers Close and Riders Bolt are nearby). (Adopted by Borough of Bexhill 1st February 1970).",
				"adopted": "1970-02-01"
			}, {
				"name": "Bank Road",
				"date": "1936",
				"desc": "Descriptive name for this road which leads up a slope away from Ninfield Road. (Adopted by Borough of Bexhill 2nd January 1957).",
				"adopted": "1957-01-02"
			}, {
				"name": "Bargate Close",
				"date": "1969",
				"desc": "The top of Buxton Drive was a former farm track for Burnt House farm leading off Ninfield Road, opposite the New Inn, through large green gates. Bargate Close is situated behind the former farmhouse. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Barn Field Terrace",
				"date": "2017",
				"desc": "Barn Field is the name that appears on the Tithe map of 1839 for this land, Belle Hill Farm was located just north of here at the junction of Belle Hill."
			}, {
				"name": "Barnfield Close",
				"date": "2022",
				"desc": "Barn Field is the name that appears on the Tithe map of 1839 for a field north of this land, Preston Farm once occupied this residential area."
			}, {
				"name": "Barnhorn Close",
				"date": "road 1960; name 1972",
				"desc": "The former manor of Barnhorne, first described in the 12th century, is on the western side of Bexhill. The name may be derived from Byrnahorna meaning Byrna's corner of land. Modern maps still show variations of spelling including Barnhorne Farm, Barnhorn Oast Farm and Barnhorne Hill Farm. This close was previously known as Northeye Close until 1971. (Adopted by Borough of Bexhill 3rd January 1962).",
				"adopted": "1962-01-03"
			}, {
				"status": "bygone",
				"name": "Barnhorn Lane",
				"date": "before 1841 to 1889",
				"desc": "This is an old parish lane now known as Barnhorn Road. Some early maps record this road as Barnhorn Hill. The outline of the lane can be seen on an Ordnance Survey map 1795 to 1825."
			}, {
				"name": "Barnhorn Road",
				"date": "road ~1841; name 1890",
				"desc": "The former manor of Barnhorne, first described in the 12th century, is on the western side of Bexhill. The name may be derived from Byrnahorna meaning Byrna's corner of land. Modern maps still show variations of spelling including Barnhorne Farm, Barnhorn Oast Farm and Barnhorne Hill Farm. This close was previously known as Northeye Close until 1971. Previously known as Barnhorn Lane. (Adopted at an unknown date as a publicly maintainable highway [Trunk Road] under the 1835 Highways Act).",
				"adopted": "unknown"
			}, {
				"name": "Barrack Road",
				"date": "~1861",
				"desc": "Old parish road near the site of the barracks erected for the King's German Legion stationed here between 1804 and 1814 during the Napoleonic Wars. In some early records the road is recorded as Barracks Road, Barrack Hill as well as Cemetery Road. (Taken over as a Public Highway by the Local Board of Bexhill in 1884).",
				"adopted": "1884"
			}, {
				"name": "Bayencourt North",
				"date": "1924",
				"desc": "A small village in northern France where the 5th Battalion of the Royal Sussex Regiment was quartered in 1916. After the war, Bexhill raised money to provide the devastated village with a water tower and piped water. Councillor E W C Bowrey, as Mayor, championed this project and led the first civic delegation to Bayencourt in 1924. (Bowrey Place is nearby). (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1956).",
				"adopted": "1956"
			}, {
				"name": "Bayencourt South",
				"date": "1924",
				"desc": "A small village in northern France where the 5th Battalion of the Royal Sussex Regiment was quartered in 1916. After the war, Bexhill raised money to provide the devastated village with a water tower and piped water. Councillor E W C Bowrey, as Mayor, championed this project and led the first civic delegation to Bayencourt in 1924. (Bowrey Place is nearby). (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1956).",
				"adopted": "1956"
			}, {
				"name": "Beacon Hill",
				"date": "after 1987 but before 1995",
				"desc": "A large house and gardens called Beacon Hill, built about 1925, stood near the summit of this raised land which forms part of The Highlands. The house name commemorates this site where at least two coronation beacons were lit in 1902 and then 1911. It is not known when the house was demolished. (Adopted by East Sussex County Council, 18th March 1998).",
				"adopted": "1998-03-18"
			}, {
				"name": "Beaconsfield Road",
				"date": "~1886",
				"desc": "Benjamin Disraeli, 1st Earl of Beaconsfield (1804 to 1881) was a British Prime Minister and Conservative statesman. (Adopted by Borough of Bexhill 3rd March 1902).",
				"adopted": "1902-03-03"
			}, {
				"name": "Beatrice Walk",
				"date": "road 1905; name c1988",
				"desc": "This development, around an existing large building dating from about 1905, took place near to the time of the birth (8th August 1988) of Princess Beatrice, the elder daughter of Prince Andrew, Duke of York, and Sarah, Duchess of York. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Beaulieu Road",
				"date": "1917",
				"desc": "Two properties call Beaulieu Cottages are recorded at Cooden Beach in 1915. This road's location overlooking the coast may be described, in French, as a fine or beautiful (beau) place (lieu). Probably the continentalstatus name was designed to attract both visitors and house buyers to the area. (Adopted by Borough of Bexhill 27th May 1935).",
				"adopted": "1935-05-27"
			}, {
				"name": "Becketts Close",
				"date": "2021",
				"desc": "Becketts Corner is part of a sequence of corners at Silverstone racing circuit, Northamptonshire. It takes its name from the medieval chapel of St Thomas à Beckett, which was built in memory of the murdered Archbishop of Canterbury and once stood near to the corners. (Brooklands Road, Cascades Way, Clervaux Close, Druids Close, Gracelands Drive, Luffield Drive, Paddock Way and Woodcote Way are nearby)."
			}, {
				"name": "Bedford Avenue",
				"date": "1898",
				"desc": "Elizabeth Sackville-West (1818 to 1897) daughter of 5th Earl De La Warr married Francis Russell, the future 9th Duke of Bedford. (Adopted by Borough of Bexhill 16th March 1914).",
				"adopted": "1914-03-16"
			}, {
				"name": "Beech Close",
				"date": "1965",
				"desc": "Beech are deciduous trees with smooth grey bark belonging to the genus Fagus. (Highwoods Avenue and Holly Close are nearby). (Adopted by Borough of Bexhill 14th December 1970).",
				"adopted": "1970-12-14"
			}, {
				"name": "Beeching Close",
				"date": "1970s",
				"desc": "Built on the site of the former goods yard of Bexhill West station. This station, as well as the branch line via Sidley to Crowhurst, closed in 1964 following the report by Lord Beeching, Chairman of the British Railways Board. (This road had not been adopted by East Sussex County Council by March 2013)."
			}, {
				"name": "Beeching Road",
				"date": "road 1969; name 1972",
				"desc": "Built on the site of the former goods yard of Bexhill West station. This station, as well as the branch line via Sidley to Crowhurst, closed in 1964 following the report by Lord Beeching, Chairman of the British Railways Board. Previously known as Beeching Road North from about 1969 to 1971 when the road was being developed from London Road but before it connected to Terminus Road. (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by 1973).",
				"adopted": "1973"
			}, {
				"name": "Belle Hill",
				"date": "~1841",
				"desc": "Previously known as Belly Hill, a corrupted version of Bury Hill, or even just as The Hill. There was once a Belle Hill Farm in this area. The outline of the road can be seen on an Ordnance Survey map 1795 to 1825. In addition to the road leading from the High Street, Old Town, to Amherst Road, the section of King Offa Way from the London Road crossroads to approximately adjacent to Edinburgh Road is also called Belle Hill on many present-day maps. (Adopted at an unknown date as a publicly maintainable highway [Trunk Road] under the 1835 Highways Act until the opening of King Offa Way in 1980).",
				"adopted": "unknown"
			}, {
				"name": "Bending Crescent",
				"date": "1926",
				"desc": "Councillor Frank Bausor Bending was Bexhill Borough Mayor, 1925 to 1926. (Sewell Avenue is nearby). (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Berwick Close",
				"date": "1970",
				"desc": "Village in East Sussex, 3 miles west of Polegate. (Date of adoption by Borough of Bexhill uncertain but there are two agreements to adopt the road dated 29th April 1965 and 15th November 1966).",
				"adopted": "1965-04-29"
			}, {
				"name": "Bethune Road",
				"date": "c1910",
				"desc": "The 8th Earl De La Warr was a Captain in Major Bethune's mounted infantry during the Second Boer War or South African War (1899 to 1902). At that time the Earl was also acting as a war correspondent and was wounded in May 1900 during a battle at Blood River. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Bexhill Road",
				"date": "road ~1841; name c1883",
				"desc": "Major road (A259) along the coast between Bexhill and Hastings. There have been many spellings of the name Bexhill over the years including Bixlea as it is first recorded and Bexelei as it is documented in Domesday Book. The original meaning of Bexhill is probably now lost but “windy hill” and “box-tree clearing” are two possibilities. The outline of the road can be seen on an Ordnance Survey map 1795 to 1825. Before 1894 the section of this road where it crosses over Combe Haven and continues towards Hastings was considered to be part of Bulverhythe Road. (Adopted at an unknown date as a publicly maintainable highway [Trunk Road] under the 1835 Highways Act).",
				"adopted": "unknown"
			}, {
				"name": "Bicton Gardens",
				"date": "1961",
				"desc": "Near here the former independent preparatory school, Bicton Place, was opened by Mr Harry and Mr Carr in 1927 and closed about 1929. (Adopted by Borough of Bexhill 25th October 1961).",
				"adopted": "1961-10-25"
			}, {
				"status": "bygone",
				"name": "Biggs Hill",
				"date": "before 1841 to 1881",
				"desc": "Later known as Haddocks Hill but now part of present-day Wrestwood Road. Thomas Bigg was a local 18th century farmer at the former Cowlands Farm on Wrestwood Road. It ran from the present-day junction of Ninfield Road to about the junction of Chantry Avenue and Wrestwood Road. The outline of the road can be seen on an Ordnance Survey map 1795-1825."
			}, {
				"status": "bygone",
				"name": "Birchington Avenue",
				"date": "1925 to 1955",
				"desc": "Built across land which previously formed part of Birchington and Little Birchington Farms. The name may be derived from a 12th century person’s name of Bychinton or Bychyngton. This avenue ran from the present-day Cooden Sea Road then north of the site of the former Metropolitan Convalescent Home across Kewhurst Avenue and along part of the present-day Gillam Wood Road."
			}, {
				"name": "Birchington Close",
				"date": "1940",
				"desc": "Built in the grounds of the home, called Birchington House, of Mr Ebenezer Howard, the first Bexhill Borough Mayor during 1902 to 1903. (This road had not been adopted by East Sussex County Council by March 2013)."
			}, {
				"name": "Birchview",
				"date": "1930",
				"desc": "Sir Ernest Birch, KCMG was Bexhill Borough Mayor, 1926 to 1927. (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1956).",
				"adopted": "1956"
			}, {
				"name": "Birkdale",
				"date": "1962",
				"desc": "R A Larkin and Bros Ltd were major developers and house builders in Bexhill between 1924 to 1988. This road was named by Reg Larkin after the Royal Birkdale golf course near Southport, Lancashire. Before moving to Bexhill, Reg Larkin worked in Warrington, a town between Liverpool and Manchester, which is also about 25 miles south-east of Southport. The road was completed soon after the 1961 Open Championship which was held at Royal Birkdale and won by Arnold Palmer. The road name is often recorded as Birk Dale in earlier documents and maps. (Adopted by Borough of Bexhill 5th July 1965).",
				"adopted": "1965-07-05"
			}, {
				"name": "Bishops Walk",
				"date": "1934",
				"desc": "Land in this area was once owned by the Bishops of Chichester. A bishop is a senior clergyman consecrated for the spiritual direction of a diocese. (Cardinals Close is nearby). (Adopted by Borough of Bexhill 29th April 1968).",
				"adopted": "1968-04-29"
			}, {
				"name": "Blackfields Avenue",
				"date": "1964",
				"desc": "According to a tithe map / schedule of 1839 / 1843 there was a field called Black Field to the east of Broadoak Farm which is close to where this avenue has been developed. (Adopted by Borough of Bexhill 3rd July 1967).",
				"adopted": "1967-07-03"
			}, {
				"name": "Blackmill Close",
				"date": "1952",
				"desc": "Sidley Black Mill was one of the names on a list of Sidley windmills published in a Sussex magazine in the 1930s which were later used to name various roads. These are the nearby Mount Idol View, Pankhurst Close and Rise and Putlands Crescent. (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1956).",
				"adopted": "1956"
			}, {
				"name": "Bluebell Close",
				"date": "2022",
				"desc": "Bluebell is the common name of a species of flowering plants belonging to the Asteraceae family. (Buttercup Close, Clover Way, Daisy Way, Daffodil Way, Foxglove Avenue, Snowdrop Way, Tulip Way and Orchid Way are nearby)."
			}, {
				"name": "Bluebell View",
				"date": "2019",
				"desc": "Bluebell is the common name of a species of flowering plants belonging to the Asteraceae family."
			}, {
				"name": "Bodiam Avenue",
				"date": "1965",
				"desc": "Small village in East Sussex, 6 miles north-east of Battle. (Adopted by Borough of Bexhill 23rd September 1968).",
				"adopted": "1968-09-23"
			}, {
				"name": "Bodle Crescent",
				"date": "1929",
				"desc": "Alderman Thomas Bodle was a local politician between about 1915 and 1928. He was a Sidley smith who in 1910 sold his smithy, which was almost opposite the Sussex Hotel (now Sussex House). (Buxton Drive is nearby). (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1956).",
				"adopted": "1956"
			}, {
				"name": "Bolebrooke Road",
				"date": "1891",
				"desc": "Lord George Sackville (1716 to 1785), the third son of the 1st Duke of Dorset, was created Baron Bolebrooke and Viscount Sackville in 1782. (Adopted by Borough of Bexhill 26th September 1904).",
				"adopted": "1904-09-26"
			}, {
				"name": "Borodales",
				"date": "c1995",
				"desc": "Around 1928 a property called Borodale was one of the first to be built on White Hill Drive. By 1934 this had become the Collington Green Private Hotel and by 1950 the street directories show a Whitehill Hotel, which included an annex named Borodale then later, by at least 1956, changing its name to the Borodale Private Hotel. It is unclear whether these hotels were on the same site as the original 1928 property or closer to the new residential properties in Borodales. The Borodale Private Hotel remained open until at least 1974 but its closure date is not yet known. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Boswell Mews",
				"date": "1700s",
				"desc": "This mews linked Boswell House (and Stafford House) to a stables. In 1801 the house operated as a butchers ran by the Pocock family, one of Bexhill's main smuggling gangs of the era."
			}, {
				"name": "Bowrey Place",
				"date": "1926",
				"desc": "Alderman Ernest William Cantley Bowrey was Bexhill Borough Mayor, 1923 to 1924 and 1944 to 1946. He received the Freedom of the Borough in 1952. In 1924 he championed a project to restore the water supply to the small village of Bayencourt in northern France where Sussex troops had been stationed during the First World War. (Bayencourt North and South are nearby). (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1956).",
				"adopted": "1956"
			}, {
				"name": "Boxgrove Close",
				"date": "c1975",
				"desc": "Village in West Sussex, 3 miles north-east of Chichester. A Benedictine Priory was established there in 1056. It has an impressive Chantry Chapel built by Thomas West, 9th Lord De La Warr, who was also Lord of the Manor of Halnaker and patron of the priory, following his marriage to Elizabeth Bonville. (Adopted by East Sussex County Council, 20th February 1976).",
				"adopted": "1976-02-20"
			}, {
				"name": "Brackerne Close",
				"date": "1986",
				"desc": "Perhaps a misspelling of 'Bracken', a common name of a genus of coarse ferns (Pteridium) belonging to the Dennstaedtiaceae family. Also note the alternative name 'Brackern Close' which differs to the road signs."
			}, {
				"status": "bygone",
				"name": "Braggs Lane",
				"date": "before 1841 to 1912",
				"desc": "This lane ran from about the present-day junction of Eastwood Road and Little Common Road past the junction of Holmesdale Road and Collington Avenue and across the railway as a level crossing at Collington Halt. The present-day footbridge over the railway was built in 1912 to replace the level crossing. The lane no longer exists but its outline can be seen on an Ordnance Survey map 1795 to 1825. Braggs Wood covered much of the area later used for Bexhill West Station and goods yard. In addition there was a Braggs Farm, which was also known as Fatlands, in this area."
			}, {
				"name": "Brampton Avenue",
				"date": "1972",
				"desc": "Ivor Arthur Brampton (1924 to 2001) was a local politician and businessman; he was Town Mayor of Bexhill (1977 to 1978). (Date of adoption by Borough of Bexhill uncertain but there is an agreement to adopt the road dated 23rd April 1970).",
				"adopted": "1970-04-23"
			}, {
				"name": "Brassey Road",
				"date": "1895",
				"desc": "Thomas, Baron Brassey, 1st Earl Brassey (1836 to 1918), was the eldest son of Thomas Brassey, the great railway contractor. The second Thomas Brassey was Bexhill Borough Mayor, 1907 to 1908. He also received the Freedom of the Borough in 1907. His son, Thomas Allnutt Brassey, Viscount Hythe and later 2nd Earl Brassey (1863 to 1919) was Mayor of Bexhill, 1908 to 1909. Muriel Brassey (1872 to 1930) sister of Thomas Allnutt Brassey married Viscount Cantelupe, later 8th Earl De La Warr, in 1891. (Adopted by Borough of Bexhill 26th September 1904).",
				"adopted": "1904-09-26"
			}, {
				"name": "Brett Drive",
				"date": "1967",
				"desc": "This drive was developed by Brett Concrete Ltd. (Adopted by Borough of Bexhill, 1st part 28th April 1969 and spur road 21st September 1970).",
				"adopted": "1969-04-28;1970-09-21"
			}, {
				"name": "Brick Kiln Close",
				"date": "2016",
				"desc": "A brick works was located north-west of here in All Saints Lane, disappearing after the Second World War."
			}, {
				"name": "Bridge Road",
				"date": "road 1927; name c2000",
				"desc": "This railway bridge was an extension of Manor Road linking Bolebrooke Road to Magdalen Road. It was built in 1927 replacing the level crossing on Dorset Road South. It is unclear when the name of Bridge Road was adopted but it was probably after 2000. (Adopted by Borough of Bexhill in 1927).",
				"adopted": "1927"
			}, {
				"name": "Brinklehurst Drive",
				"date": "2017",
				"desc": "The Tithe map of 1839 names this land as 'Little Brickhurst', once arable farmland used by Upper Worsham Farm. It is unknown if this is a deliberate corruption or coincidence."
			}, {
				"name": "Broad View",
				"date": "1958",
				"desc": "Descriptive name for this street whose houses have a panoramic view over Collington and the English Channel. (Adopted by Borough of Bexhill, 1st part 29th October 1958 and last part 30th November 1960).",
				"adopted": "1958-10-29;1960-11-30"
			}, {
				"name": "Broadoak Lane",
				"date": "~1841",
				"desc": "Old parish lane built in the area of Great and Little Broadoak Farms. The outline of the lane can be seen on an Ordnance Survey map 1795 to 1825. Part of the old road is now a pedestrian walkway since Deerswood Lane was built. (Taken over as a Public Highway by the Local Board of Bexhill in 1884).",
				"adopted": "1884"
			}, {
				"name": "Brockley Road",
				"date": "1904",
				"desc": "John Webb (1840 to 1922) was a surveyor and builder from Brockley, a district of south London located in the Borough of Lewisham. Mr Webb was responsible for developing much of the land south of the railway between Sea Road and the Polegrove including the land over which this road now runs. (Adopted by Borough of Bexhill 30th November 1925).",
				"adopted": "1925-11-30"
			}, {
				"name": "Brookfield Road",
				"date": "1937",
				"desc": "Arthur Montagu Brookfield (1853 to 1940) was a British army officer before he became the Conservative Member of Parliament for the Rye division, which at that time included Bexhill, from 1885 to 1903. He was also an honorary colonel of the 1st (Cinque Ports) Rifle Volunteers. (Adopted by Borough of Bexhill 24th May 1937).",
				"adopted": "1937-05-24"
			}, {
				"name": "Brooklands Road",
				"date": "2018",
				"desc": "Brooklands is turn six at Silverstone racing circuit, Northamptonshire. It takes its name from the motor racing circuit and aerodrome built near Weybridge, Surrey. (Becketts Close, Cascades Way, Clervaux Close, Druids Close, Gracelands Drive, Luffield Drive, Paddock Way and Woodcote Way are nearby)."
			}, {
				"name": "Buckholt Avenue",
				"date": "1940",
				"desc": "The former manor of Buckholt, first described in 1276, was on the northern side of Bexhill. A beech wood or thicket may have been the original meaning of the name. (Adopted by Borough of Bexhill 16th August 1971).",
				"adopted": "1971-08-16"
			}, {
				"name": "Buckholt Lane",
				"date": "~1841",
				"desc": "The former manor of Buckholt, first described in 1276, was on the northern side of Bexhill. A beech wood or thicket may have been the original meaning of the name. This rough track leads north from Sidley past Buckholt Cottages to Buckholt Farm. The outline of the lane can be seen on an Ordnance Survey map 1795 to 1825. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Buckhurst Place",
				"date": "road ~1881; name 1905",
				"desc": "Buckhurst Estate, near Withyham, Hartfield, East Sussex, has been owned by the Sackville family for some 900 years. The origins of the current house, Buckhurst Park date from 1603. Buckhurst Place in Bexhill is often, unofficially, called Town Hall Square or Buckhurst Square although in shape this area is more of a triangle than a square. Before 1905 this area was previously considered part of Station Road then Lower Station Road. (Part adopted at an unknown date as a publicly maintainable highway under the 1835 Highways Act).",
				"adopted": "unknown"
			}, {
				"name": "Buckhurst Road",
				"date": "1887",
				"desc": "Buckhurst Estate, near Withyham, Hartfield, East Sussex, has been owned by the Sackville family for some 900 years. The origins of the current house, Buckhurst Park date from 1603. Buckhurst Place in Bexhill is often, unofficially, called Town Hall Square or Buckhurst Square although in shape this area is more of a triangle than a square. Before 1905 this area was previously considered part of Station Road then Lower Station Road. (Adopted by Borough of Bexhill 17th September 1900).",
				"adopted": "1900-09-17"
			}, {
				"name": "Burnside Mews",
				"date": "road c1890; name c2000",
				"desc": "From at least 1890 the former 86, Station Road was a property called Burnside. The entrance road to the mews was adjacent to this property and is now between the present-day 76 and 80 London Road. Originally a mews was a street or yard of stables often converted into dwelling-houses or garages. However, evidence of an earlier livery stables yard and associated trades can still be seen at the back of the site. It is unclear when the name of Burnside Mews was adopted but it was probably after 2000. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Bushy Croft",
				"date": "1964",
				"desc": "According to a tithe map / schedule of 1839 / 1843 there was a field called Bushy Croft close to where the present-day main railway station of Bexhill is situated. A croft is the name of a small enclosed field. Although this road is some distance from the town centre it was developed at the same time as Byfields Croft and the two road names were probably chosen together. (Byfields Croft is nearby). (Adopted by Borough of Bexhill 3rd July 1967).",
				"adopted": "1967-07-03"
			}, {
				"name": "Buttercup Close",
				"date": "2023",
				"desc": "Buttercup is the common name of a species of flowering plants belonging to the Ranunculaceae family. (Bluebell Close, Clover Way, Daisy Way, Daffodil Way, Foxglove Avenue, Snowdrop Way, Tulip Way and Orchid Way are nearby)."
			}, {
				"name": "Buxton Drive",
				"date": "1928",
				"desc": "Alderman Frank C Buxton was a local politician between about 1926 and 1937. He was proprietor of Sidley's Sussex Hotel (now Sussex House). (Bodle Crescent is nearby). (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1956).",
				"adopted": "1956"
			}, {
				"name": "Byfields Croft",
				"date": "1964",
				"desc": "According to a tithe map / schedule of 1839 / 1843 there was a Bye Field near to where this road has been developed. A croft is the name of a small enclosed field. Some maps from the 1960s have shown this road as Byefields Croft. (Bushy Croft is nearby). (Adopted by Borough of Bexhill 3rd July 1967).",
				"adopted": "1967-07-03"
			}, {
				"name": "Byworth Close",
				"date": "after 1974 but before 1988",
				"desc": "Small village in West Sussex, 1 mile south-east of Petworth. (Adopted by East Sussex County Council, 23rd February 1988).",
				"adopted": "1988-02-23"
			}, {
				"name": "Calgary Road",
				"date": "1950",
				"desc": "City in the Province of Alberta, Canada. The 2nd Battalion of the Calgary Highlanders were stationed from 1941 in Bexhill during World War Two. (Canada Way, Edmonton Road and St Lawrence Road are nearby). (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1956).",
				"adopted": "1956"
			}, {
				"name": "Callums Walk",
				"date": "c1998",
				"desc": "The origin of the name remains uncertain, maybe related to a family name of the developers. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Camber Close",
				"date": "1968",
				"desc": "Village in East Sussex, 3 miles south-east of Rye. (Adopted by Borough of Bexhill 14th December 1970).",
				"adopted": "1970-12-14"
			}, {
				"name": "Cambridge Road",
				"date": "road ~1886; name 1899",
				"desc": "King George III's seventh son, Adolphus Frederick, as Duke of Cambridge was Colonel-in-Chief to the King's German Legion who were stationed in Bexhill 1804 to 1814. This road was previously known as Victoria Road. The Record Reign Cottages commemorating Queen Victoria's Diamond Jubilee in 1897 can still be seen in this road. (Adopted by Borough of Bexhill 3rd March 1902).",
				"adopted": "1902-03-03"
			}, {
				"name": "Camperdown Street",
				"date": "1899",
				"desc": "Probably recalls the Battle of Camperdown, a major naval action fought between the British and Dutch naval fleets in October 1797. The battle resulted in complete victory for the British which, at the time, was hugely popular throughout the country. This street first appears in local directories just after the centenary of the battle. The part of the street from Ninfield Road to the right-hand corner was previously known as Clarence Street. (Adopted by Borough of Bexhill, 1st part 29th November 1937 and 2nd part 17th March 1969).",
				"adopted": "1937-11-29;1969-03-17"
			}, {
				"name": "Canada Way",
				"date": "1950",
				"desc": "Canadian troops were stationed in Bexhill during both World Wars. (Calgary Road, Edmonton Road and St Lawrence Road are nearby). (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1956).",
				"adopted": "1956"
			}, {
				"name": "Cantelupe Road",
				"date": "1891",
				"desc": "Sir Thomas West (1251 to 1344) married Alianore (probably Eleanor) de Cantlelupe of Hempstead or Hempston in Devon. Now Viscount Cantelupe is a courtesy title of the eldest son of Earl De La Warr. (Adopted by Borough of Bexhill 26th September 1904).",
				"adopted": "1904-09-26"
			}, {
				"name": "Cardinals Close",
				"date": "1964",
				"desc": "A cardinal is one of the leading dignitaries of the church constituting the Sacred College of Rome. (Bishops Walk is nearby). (Adopted by Borough of Bexhill 14th March 1966 and the (grassed) island on 7th November 1966).",
				"adopted": "1966-03-14;1966-11-07"
			}, {
				"name": "Carfax Close",
				"date": "road 1969; name 1970",
				"desc": "The origin of the name remains uncertain. The word carfax is derived from the French carrefour or crossroads, or quatre-face or four-face. The place-name is often found in old city centres eg Oxford. However, the configuration of roads around Carfax Close is not like a crossroad so this explanation seems unlikely. This close was previously known as Redgrove. (Adopted by Borough of Bexhill 16th August 1972).",
				"adopted": "1972-09-16"
			}, {
				"name": "Carmel Close",
				"date": "1972",
				"desc": "R A Larkin and Bros Ltd were major developers and house builders in Bexhill between 1924 to 1988. Carmel-by-the-Sea is a town south of Monterey on the Pacific coast of central California. The Monterey Bay area was one of the Larkin family's holiday destinations. (Monterey Close and Gardens are nearby). (Adopted by East Sussex County Council, 7th November 1975).",
				"adopted": "1975-11-07"
			}, {
				"name": "Cascades Way",
				"date": "2020",
				"desc": "Cascades Corner is turn three at Oulton Park racing circuit, Cheshire. (Becketts Close, Brooklands Road, Clervaux Close, Druids Close, Gracelands Drive, Luffield Drive, Paddock Way and Woodcote Way are nearby)."
			}, {
				"name": "Castle Way",
				"date": "2017",
				"desc": "Probably a reference to the adjacent Windsor Road. A public house on the corner of London Road was also once called The Castle."
			}, {
				"name": "Central Parade",
				"date": "1910",
				"desc": "This part of the promenade stretches from the present-day Channel View East along the seafront past the Colonnade (1911) until it meets West Parade. Opened by Town Mayor John Alexander Paton on 30th July."
			}, {
				"name": "Ceylon Walk",
				"date": "1986",
				"desc": "Built on a smallholding known as Ceylon Cottage. The house, which was built in 1892, can be found in Collington Lane West. (Adopted by East Sussex County Council, 1st February 1987).",
				"adopted": "1987-02-01"
			}, {
				"name": "Chandler Road",
				"date": "road ~1886; name 1908",
				"desc": "The origin of this name remains uncertain but it has been suggested that a builders yard in the area was run by a Mr Chandler and the name for the road came into common usage. Although street directories published around 1908 show houses in this road occupied by people with the surname Chandler, the directories do not give their occupations. This road was known as Hamilton Road until 1907. (Adopted by Borough of Bexhill 3rd March 1902).",
				"adopted": "1902-03-03"
			}, {
				"name": "Channel View",
				"date": "1901",
				"desc": "Descriptive name from this wide pedestrian walkway's position on the seafront looking out over the English Channel. On some early maps it is described as part of Central Parade. Street directories up to about 1915 occasionally used the name Channel Side for this street."
			}, {
				"name": "Channel View East",
				"date": "road 1906; name c1950",
				"desc": "Descriptive name from this wide pedestrian walkway's position on the seafront looking out over the English Channel. This road was previously known as Pier View East then Pier Road East. (Adopted by Borough of Bexhill 29th January 1912).",
				"adopted": "1912-01-29"
			}, {
				"name": "Channel View West",
				"date": "road 1906; name c1950",
				"desc": "Descriptive name from this wide pedestrian walkway's position on the seafront looking out over the English Channel. This road was previously known as Pier View West then Pier Road West. (Adopted by Borough of Bexhill 29th January 1912).",
				"adopted": "1912-01-29"
			}, {
				"name": "Chantry Avenue",
				"date": "1930",
				"desc": "Adjacent to church land (St Peter's) and Chantry Farm (also known as Church Farm). A chantry is a chapel within a church where priests can say Mass. (Adopted by Borough of Bexhill 29th March 1940).",
				"adopted": "1940-03-29"
			}, {
				"name": "Chantry Lane",
				"date": "road ~1841; name 1892",
				"desc": "Adjacent to church land (St Peter's) and Chantry Farm (also known as Church Farm). A chantry is a chapel within a church where priests can say Mass. Chantry Lane would once have been part of the medieval “King's Highway” from Bulverhythe to Sidley. (Adopted at an unknown date as a publicly maintainable highway under the 1835 Highways Act).",
				"adopted": "unknown"
			}, {
				"name": "Chapel Path",
				"date": "road ~1841; name c1940",
				"desc": "Previously known as Chapel Lane and Slopers Alley, in reference to the Victorian homeless who 'sloped' down an alley out of sight when the landlord came to collect the rent. This is now a made-up footpath from the former Wesleyan Chapel close to King Offa Way running parallel to Salisbury Road down to London Road then behind the Bexhill Leisure Centre to finish at Bexhill Down."
			}, {
				"name": "Chapel Walk",
				"date": "2009",
				"desc": "In the grounds of the former Nazareth House which included a chapel consecrated at the Feast of the Immaculate Conception. Opened in 1894, this was a home for the elderly, the poor and orphaned girls run by the Sisters of Nazareth. An east wing was added in 1937 which housed a primary school run by the Sisters. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Charter Grove",
				"date": "1952",
				"desc": "This road name was proposed during the development of the Southlands estate in Sidley. Blackmill Close, Jubilee Road, Mount Idol View, Pankhurst Rise and Putlands Crescent were all built in 1952 which was at the time of the Golden Jubilee of the Charter of Incorporation of the Borough of Bexhill (1902 to 1952). It is thought that the name Jubilee Road was finally used instead of Charter Grove."
			}, {
				"name": "Chartres",
				"date": "1968",
				"desc": "Origin of this name remains uncertain. However, it is considered by a number of local people to be a corruption of Charters. In nearby Hastings Road was Charters Towers School for Girls which opened in 1934 following its move to Bexhill from East Grinstead. Charters Towers School amalgamated with Ancaster House (school) in 1985. Chartres is also a town 50 miles south-west of Paris which is noted for its medieval cathedral. (Adopted by Borough of Bexhill, 1st part 27th September 1971 and 2nd part 7th August 1972).",
				"adopted": "1971-09-27;1972-08-07"
			}, {
				"name": "Chartres Close",
				"date": "1972",
				"desc": "Origin of this name remains uncertain. However, it is considered by a number of local people to be a corruption of Charters. In nearby Hastings Road was Charters Towers School for Girls which opened in 1934 following its move to Bexhill from East Grinstead. Charters Towers School amalgamated with Ancaster House (school) in 1985. Chartres is also a town 50 miles south-west of Paris which is noted for its medieval cathedral. (Date of adoption by Borough of Bexhill uncertain but there is an agreement to adopt the road dated 9th November 1965).",
				"adopted": "1965-11-09"
			}, {
				"name": "Chelsea Close",
				"date": "road 1905; name 1965",
				"desc": "The origin of this name remains unknown. Previously known as Manor Lane before the modern housing development. (Adopted by Borough of Bexhill 12th August 1968).",
				"adopted": "1968-08-12"
			}, {
				"name": "Chepbourne Road",
				"date": "1898",
				"desc": "Belle Hill Farm was previously called Chepbourne Farm or Russells Farm and was located at the foot of Belle Hill where Chepbourne Road now runs. A Manor Rental of 1576 records the name Chepbournes. (Adopted by Borough of Bexhill 16th September 1901).",
				"adopted": "1901-09-16"
			}, {
				"name": "Cherry Tree Gardens",
				"date": "1958",
				"desc": "Cherry is the fruit of many plants of the genus Prunus usually consisting of a small fleshy fruit and a large hard stone. (Maytree, Laburnham and Rowan Gardens are nearby). (Adopted by Borough of Bexhill 27th September 1965).",
				"adopted": "1965-09-27"
			}, {
				"name": "Chestnut Walk",
				"date": "1930",
				"desc": "Chestnut is a deciduous tree or shrub of the genus Castanea which belongs within the beech family. (Oakleigh Road, Sycamore Close and Willow Drive are nearby). (Adopted by Borough of Bexhill 16th August 1965).",
				"adopted": "1965-08-16"
			}, {
				"name": "Chichester Close",
				"date": "1962",
				"desc": "Cathedral town in West Sussex. The Bishops of Chichester probably built the first manor house in Bexhill after they acquired the land back from the Count of Eu in 1150. (Adopted by Borough of Bexhill 15th March 1965).",
				"adopted": "1965-03-15"
			}, {
				"name": "Christine Close",
				"date": "1968",
				"desc": "Family forename of one of the developers surnames, Davey-Casselden Limited. (Allen Way, Amanda Close, Angela Close, Diana Close, Gwyneth Grove, Ian Close and Lesley Close are nearby). (Adopted by East Sussex County Council, 11th November 1975).",
				"adopted": "1975-11-11"
			}, {
				"status": "bygone",
				"name": "Church Hill",
				"date": "before 1841 to 1912",
				"desc": "Sometimes referred to as Church Hill Road, this is now part of the present-day Little Common Road. It ran from the Little Common roundabout, past St Marks Church until about the junction with the present-day White Hill Avenue. The outline of the road can be seen on an Ordnance Survey map 1795 to 1825."
			}, {
				"name": "Church Hill Avenue",
				"date": "road c1895; name 1928",
				"desc": "Leads up the hill from Cooden Sea Road towards St Mark's Church. The street directories between about 1915 and 1927 usually name this road Churchill Avenue. (Adopted by Borough of Bexhill 27th April 1955).",
				"adopted": "1955-04-27"
			}, {
				"status": "bygone",
				"name": "Church Road",
				"date": "1902 to 1917",
				"desc": "Usually referred to as St Stephen's Road, but called Church Road on some maps, this road was part of the Woodsgate Park Estate near St Stephen's Church close to the present-day Park Lane."
			}, {
				"name": "Church Street",
				"date": "~1841",
				"desc": "Old parish street leading from High Street towards St Peter's Church. The section from the church's west front down the slope to Chantry Lane is often known as Short Lane. The outline of the street can be seen on an Ordnance Survey map 1795 to 1825. (Taken over as a Public Highway by the Local Board of Bexhill in 1884).",
				"adopted": "1884"
			}, {
				"name": "Church Vale Road",
				"date": "1948",
				"desc": "Descriptive name for this road in the valley below St Peter's Church. (Lychgates Close, Rectory Way and St Peter's Crescent are nearby). (Adopted by Borough of Bexhill, 1st part 24th March 1948 and 2nd part 30th January 1967).",
				"adopted": "1948-03-24;1967-01-30"
			}, {
				"name": "Claremont Road",
				"date": "1899",
				"desc": "Thomas, Baron Brassey, 1st Earl Brassey (1836 to 1918), was the eldest son of Thomas Brassey, the great railway contractor. The second Thomas Brassey was Bexhill Borough Mayor, 1907 to 1908. He also received the Freedom of the Borough in 1907. Claremont, a Venetian Gothic house, in Hastings was the name of his residence before moving to Normanhurst Court at Catsfield. Claremont became the Brassey Institute and now houses Hastings public library. His daughter, Muriel, married Viscount Cantelupe, later 8th Earl De La Warr, in 1891. (Adopted by Borough of Bexhill 25th April 1956).",
				"adopted": "1956-04-25"
			}, {
				"status": "bygone",
				"name": "Clarence Street",
				"date": "1899 to c1932",
				"desc": "King William IV (1765 to 1837), who was Queen Victoria's predecessor, was created Duke of Clarence and St Andrews in 1789 before his accession in 1830. This street ran from Ninfield Road to the corner with Camperdown Street until about 1932. It is now part of the present-day Camperdown Street."
			}, {
				"name": "Clavering Walk",
				"date": "1913",
				"desc": "The origin of the name remains uncertain. Maybe because the 8th Earl De La Warr was married, for the second time, in 1903 to Hilda Mary Clavering Tredcroft, daughter of Colonel C Lennox Tredcroft, the senior trustee of the De La Warr estate. Or because General Sir John Clavering (1722 to 1777) Commander-in-Chief of the East India Company's Bengal Army, married Lady Diana West, daughter of the 1st Earl De La Warr. (Adopted by Borough of Bexhill, 1st part 24th March 1930 and last part 8th July 1965).",
				"adopted": "1930-03-24;1965-07-08"
			}, {
				"name": "Claxton Road",
				"date": "1958",
				"desc": "Alderman Miss Ada Florence Claxton was a local politician who lived at Glyne Manor Farm in the early 1950s. The Claxton family owned and farmed land in this area from the 1930s. (Adopted by Borough of Bexhill, 1st part 29th April 1959 and last part 7th November 1966).",
				"adopted": "1959-04-29;1966-11-07"
			}, {
				"name": "Clervaux Close",
				"date": "2020",
				"desc": "Clervaux is the name of the first corner in the Croft Circuit, North Yorkshire. (Becketts Close, Brooklands Road, Cascades Way, Druids Close, Gracelands Drive, Luffield Drive, Paddock Way and Woodcote Way are nearby)."
			}, {
				"name": "Clevedon Road",
				"date": "1939",
				"desc": "Built through the grounds of a house called Clevedon which was part of the early Glenleigh Park estate. (Adopted by Borough of Bexhill 27th May 1940).",
				"adopted": "1940-05-27"
			}, {
				"name": "Clifford Road",
				"date": "1887",
				"desc": "Richard Sackville, 3rd Earl of Dorset (1589 to 1624) married Lady Anne Clifford, daughter of George, 3rd Earl of Cumberland, in 1609. (Adopted by Borough of Bexhill 17th September 1900).",
				"adopted": "1900-09-17"
			}, {
				"name": "Clifton Rise",
				"date": "1962",
				"desc": "The origin of the name remains unknown. This road is built along a gentle slope away from De La Warr Road through the grounds of the former De La Warr Road Nurseries. The nursery open in about 1928 and closed in the early 1960s. Although none of the surnames of the listed owners was Clifton it is possible the name has some as yet unidentified connection with this earlier business. There was also a St Peter's Nursery in this area which was recorded on an 1899 map. (Adopted by Borough of Bexhill 26th June 1963).",
				"adopted": "1963-06-26"
			}, {
				"name": "Clinch Green Avenue",
				"date": "1960",
				"desc": "Built on land of the former Clinch Green Farm. The remains of Clinch Green Wood are now at the northern boundary of Bexhill Cemetery. A 15th century spelling of Clench Greene has been recorded. (Taken over as a Public Highway by the Local Board of Bexhill in 1884 and adopted by Borough of Bexhill 5th July 1965).",
				"adopted": "1965-07-05"
			}, {
				"name": "Clover Way",
				"date": "2022",
				"desc": "Clover is the common name of a species of flowering plants belonging to the Fabaceae family. (Bluebell Close, Buttercup Close, Daisy Way, Daffodil Way, Foxglove Avenue, Snowdrop Way, Tulip Way and Orchid Way are nearby)."
			}, {
				"name": "Coast Road",
				"date": "~1873",
				"desc": "Descriptive name for the road which runs along the shoreline between Pevensey Bay and Normans Bay. The outline of the road can be seen on an Ordnance Survey map of 1873. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Coastguard Close",
				"date": "~1873",
				"desc": "A sizeable coastguard station existed at Normans Bay until the buildings were sold in 1926. The outline of the close can be seen on an Ordnance Survey map of 1873. (This road had not been adopted by East Sussex County Council by March 2013)."
			}, {
				"name": "Colebrooke Road",
				"date": "1905",
				"desc": "Cole Wood is north of Sidley between Watermill Lane and Buckholt Lane. Cole Brook is a stream which runs from an area on the south side of Sidley sports ground as well as from the Woodsgate Park area down to Egerton Park and then finally into the sea. This stream can be clearly seen on a town map of 1896. Although its course is now mainly piped underground it still flows close to the position of the present-day road. (Adopted by Borough of Bexhill 26th July 1926).",
				"adopted": "1926-07-26"
			}, {
				"name": "College Road",
				"date": "1971",
				"desc": "It had been proposed to build an agricultural college on the southern corner of De La Warr Road and Dorset Road although no further details are known. (Adopted by Borough of Bexhill, 1st part 15th March 1971 and 2nd part 30th April 1973).",
				"adopted": "1971-03-15;1973-04-30"
			}, {
				"name": "Collington Avenue",
				"date": "1905",
				"desc": "The name Collington is probably derived from Cola's farmstead. This avenue is situated in the area previously occupied by Great Collington Farm. (Adopted by Borough of Bexhill, 1st part 20th December 1909 and last part 29th January 1912. Also part adopted at an unknown date as a publicly maintainable highway under the 1835 Highways Act).",
				"adopted": "1909-12-20;1912-01-29"
			}, {
				"name": "Collington Grove",
				"date": "1927",
				"desc": "The name Collington is probably derived from Cola's farmstead. This avenue is situated in the area previously occupied by Great Collington Farm. (Adopted by Borough of Bexhill, 1st part 28th March 1962 and last part 8th November 1965).",
				"adopted": "1962-03-28;1965-11-08"
			}, {
				"status": "bygone",
				"name": "Collington Lane",
				"date": "before 1841 to 1958",
				"desc": "Old parish lane which was divided into East and West following extensive housing development in the surrounding area during the 1950s. The outline of the lane can be seen on an Ordnance Survey map 1795 to 1825."
			}, {
				"name": "Collington Lane East",
				"date": "road ~1841; name 1959",
				"desc": "The name Collington is probably derived from Cola's farmstead. This avenue is situated in the area previously occupied by Great Collington Farm. (Taken over as a Public Highway by the Local Board of Bexhill in 1884).",
				"adopted": "1884"
			}, {
				"name": "Collington Lane West",
				"date": "road ~1841; name 1959",
				"desc": "The name Collington is probably derived from Cola's farmstead. This avenue is situated in the area previously occupied by Great Collington Farm. (Taken over as a Public Highway by the Local Board of Bexhill in 1884).",
				"adopted": "1884"
			}, {
				"name": "Collington Park Crescent",
				"date": "after 1974 but before 1980",
				"desc": "The name Collington is probably derived from Cola's farmstead. This avenue is situated in the area previously occupied by Great Collington Farm. (Adopted by East Sussex County Council, 1st April 1980).",
				"adopted": "1980-04-01"
			}, {
				"name": "Collington Rise",
				"date": "road c1863; name 1908",
				"desc": "The name Collington is probably derived from Cola's farmstead. This avenue is situated in the area previously occupied by Great Collington Farm. Built along a moderate hill between White Hill and junction with Collington Avenue, Birkdale and Pages Lane. This road was called Collington Park Avenue on a 1910 map. (Adopted by Borough of Bexhill 3rd November 1969).",
				"adopted": "1969-11-03"
			}, {
				"name": "Colwall Gardens",
				"date": "2008",
				"desc": "The original Colwall Court was designed by Miss Patience Peacey for her School of Domestic Economy which educated girls aged 16 years or more. It was named after Evendine Court in Colwall near Malvern, Worcestershire, where Miss Peacey was a former principal. The School for Domestic Economy opened in about 1948 but by 1959 Colwall Court had become a holiday home under the auspices of the Stars Organisation for Spastics. Before its more recent conversion into a housing development the building was a drugs and alcohol rehabilitation centre called Phoenix House. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Combe Valley Greenway",
				"date": "2016",
				"desc": "Combe means a short valley or hollow on a hillside or coastline. The Combe Haven river runs past here, previously known as the River Asten which has been suggested is to do with the etymology of the word Hastings. It is a shared-use path for horses, cyclists and walkers following the Combe Valley Way."
			}, {
				"name": "Combe Valley Way",
				"date": "2015",
				"desc": "Combe means a short valley or hollow on a hillside or coastline. The Combe Haven river runs past here, previously known as the River Asten which has been suggested is to do with the etymology of the word Hastings. Although a public vote chose to name the road Robert Wood Way, after a local soldier, this name was chosen by Rother District Council.",
				"adopted": "2015"
			}, {
				"name": "Compton Close",
				"date": "1972",
				"desc": "Charles Sackville, 6th Earl of Dorset (1638 to 1706) married, for the second time, Lady Mary Compton, daughter of James Compton, 3rd Earl of Northampton. (Adopted by Borough of Bexhill 30th April 1973).",
				"adopted": "1973-04-30"
			}, {
				"name": "Concorde Close",
				"date": "after 1974 but before 1984",
				"desc": "R A Larkin and Bros Ltd were major developers and house builders in Bexhill between 1924 to 1988. They developed this road and usually the names given to their developments have a family connection including holiday destinations. Maybe a family member was impressed by a flight in Concorde which was a turbojet-powered supersonic passenger airliner developed and produced under an Anglo-French treaty. Test flights began in 1969 and the airliner started passenger services in 1976. (Adopted by East Sussex County Council, 1st July 1984).",
				"adopted": "1984-07-01"
			}, {
				"name": "Coneyburrow Lane",
				"date": "road ~1841; name c1915",
				"desc": "Coney is an old English word for rabbit, hence rabbit burrow lane. Previously known as Picknill Green Lane, the outline of the lane can be seen on an Ordnance Survey map 1795 to 1825. (Taken over as a Public Highway by the Local Board of Bexhill in 1884).",
				"adopted": "1884"
			}, {
				"name": "Constable Way",
				"date": "after 1974 but before 1997",
				"desc": "John Constable (1776 to 1837) was an English Romantic painter. (Gainsborough Road, Reynolds Drive and Turner Close are nearby). (Adopted by East Sussex County Council, 12th December 1997).",
				"adopted": "1997-12-12"
			}, {
				"name": "Cooden Close",
				"date": "1962",
				"desc": "The former manor of Cooden is on costal land at the western side of Bexhill. John de Coding was the first tenant in the 11th century. (Adopted by Borough of Bexhill, 1st part 6th November 1967 and last part 30th June 1969).",
				"adopted": "1967-11-06;1969-06-30"
			}, {
				"status": "bygone",
				"name": "Cooden Down",
				"date": "before 1861 to 1917",
				"desc": "The road and area between Little Common and the sea at Cooden Beach, which is now part of present-day Cooden Sea Road, was previously known as Cooden Down."
			}, {
				"name": "Cooden Drive",
				"date": "tramway 1906; road 1914",
				"desc": "The former manor of Cooden is on costal land at the western side of Bexhill. John de Coding was the first tenant in the 11th century. The Hastings Tramways line was extended from Marina to Cooden Beach, via Egerton Road and Brockley Road and opened on 28th July 1906. At that time the greater part of this section of line ran through open cornfields. In 1914 work began to make up the road and this was completed in 1918. Between about 1915 and 1916 the section of road closer to Cooden was called Cooden Beach in the street directories. The tramway service ended during 1929 and the tracks were eventually removed. (Adopted by Borough of Bexhill, Richmond Road to Brockley Road 30th November 1925. Also adopted at an unknown date as a publicly maintainable highway under the 1835 Highways Act).",
				"adopted": "1925-11-30"
			}, {
				"name": "Cooden Sea Road",
				"date": "road ~1841; name 1930",
				"desc": "The former manor of Cooden is on costal land at the western side of Bexhill. John de Coding was the first tenant in the 11th century. This road was simply known as Sea Road until 1929. Occasionally Cooden Sea Lane has been noted in the records. The outline of the road can be seen on an Ordnance Survey map 1795 to 1825. When the railway came to Bexhill in 1846 it was necessary to establish cattle arches at Cooden Beach, Westcourt Drive, Sackville Road and Glyne Gap, to enable farmers north of the railway line to move their stock to summer grazing on the low-lying marshland to the south of the railway. Because of the increasing volume and size of road traffic the cattle arch was later demolished and replaced by a number of bridges. (Adopted at an unknown date as a publicly maintainable highway under the 1835 Highways Act).",
				"adopted": "unknown"
			}, {
				"name": "Cooper Drive",
				"date": "after 1974 but before 1988",
				"desc": "Alderman Frank Ernest Cooper was Bexhill Borough Mayor, 1961 to 1962. (Morgan Close is nearby). (Adopted by East Sussex County Council, 14th September 1988).",
				"adopted": "1988-09-14"
			}, {
				"name": "Copse Road",
				"date": "1955",
				"desc": "Copse means a dense thicket of trees and bushes; there used to be a small wood near here. (Adopted by Borough of Bexhill 25th June 1958).",
				"adopted": "1958-06-25"
			}, {
				"name": "Cornwall Road",
				"date": "1886",
				"desc": "County in south-west England. (Devonshire Road is nearby). (Adopted by Borough of Bexhill 21st November 1898). (Road passage to east of Park Road linking Egerton Road and Wickham Avenue, serving Cornwall Road and Park Road residences, adopted by Borough of Bexhill 26th March 1906. Foot passage to east of Cornwall Road leading from Egerton Road towards Wickham Avenue (but not a thoroughfare), serving Cornwall Road and Sackville Road residences, adopted by Borough of Bexhill 24th May 1937).",
				"adopted": "1937-05-24"
			}, {
				"name": "Courthope Drive",
				"date": "1964",
				"desc": "Mr, later Sir, George Loyd Courthope (1877 to 1955) Conservative Member of Parliament for Rye, which at that time included Bexhill in its constituency, from 1906 to 1945. He was later created 1st Baron Courthope of Whiligh. (Adopted by Borough of Bexhill, 1st part 3rd July 1967, 2nd part 1st February 1971 and last part 20th December 1971).",
				"adopted": "1967-07-03;1971-02-01;1971-11-20"
			}, {
				"name": "Coverdale Avenue",
				"date": "after 1974 but before 1989",
				"desc": "Miles Coverdale (c1488 to 1569) produced the first complete printed translation of the Bible into English. The land here was previously owned by The British and Foreign Bible Society. (Tyndale Avenue is nearby). (Adopted by East Sussex County Council, 1st December 1989).",
				"adopted": "1989-12-01"
			}, {
				"name": "Cowdray Close",
				"date": "1972",
				"desc": "Cowdray Park near Midhurst, West Sussex is the home of Viscount Cowdray. (Date of adoption by Borough of Bexhill uncertain but there is an agreement to adopt the road dated 10th January 1972).",
				"adopted": "1972-01-10"
			}, {
				"name": "Cowdray Park Road",
				"date": "1970",
				"desc": "Cowdray Park near Midhurst, West Sussex is the home of Viscount Cowdray. (Adopted by Borough of Bexhill, 1st part at an unknown date; by East Sussex County Council, 2nd part 15th April 1993 and last part 22nd February 1995).",
				"adopted": "unknown;1993-04-15;1995-02-22"
			}, {
				"name": "Cranfield Road",
				"date": "1886",
				"desc": "Richard Sackville, 5th Earl of Dorset (1622 to 1677), married Lady Frances Cranfield, daughter of Lionel Cranfield, 1st Earl of Middlesex, in 1636. (Adopted by Borough of Bexhill 1st June 1894).",
				"adopted": "1894-06-01"
			}, {
				"name": "Cranleigh Close",
				"date": "1964",
				"desc": "John Ernest Stanley Griffiths,  a family solicitor in Bexhill, owned 23A Sutherland Road, a small detached 2-bedroomed house, which he had converted after the war from some stables/garage. This property backed onto a disused apple orchard into which Cranleigh Close eventually provided access from Collington Avenue. The origin of this name is uncertain. Cranleigh can mean a woodland clearing frequented by cranes and herons. It is also the name of a town in Surrey. This cul-de-sac is adjacent to the site of the former St John's School for Girls, opened in 1910, which became the Royal Merchant Navy School from 1947. The school buildings were demolished and replaced in 1972 by Thrift House, the headquarters for Hastings and Thanet Building Society and now Conquest House, home to Hastings Direct insurance services. However no link between these schools or businesses and Cranleigh has been established yet. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Cranston Avenue",
				"date": "1917",
				"desc": "Built on a former estate owned by the Cranston family since the 18th century. (Adopted by Borough of Bexhill, 1st part 24th March 1930, 2nd part 24th November 1930 and last part 29th November 1937).",
				"adopted": "1930-03-24;1930-11-24;1937-11-29"
			}, {
				"name": "Cranston Close",
				"date": "1937",
				"desc": "Built on a former estate owned by the Cranston family since the 18th century. (Adopted by Borough of Bexhill 23rd December 1963).",
				"adopted": "1963-12-23"
			}, {
				"name": "Cranston Rise",
				"date": "1930",
				"desc": "Built on a former estate owned by the Cranston family since the 18th century. Built along a gentle slope between Cranston Avenue and Walton Park. (Adopted by Borough of Bexhill 30th January 1939).",
				"adopted": "1939-01-30"
			}, {
				"status": "bygone",
				"name": "Crescent Drive",
				"date": "1925 to 1926",
				"desc": "Descriptive name for this curving street. Now known as Popps Lane."
			}, {
				"name": "Crofton Park Avenue",
				"date": "1962",
				"desc": "John Webb (1840 to 1922) was a surveyor and builder from Brockley, a district of south London located in the Borough of Lewisham. Mr Webb was responsible for developing much of the land south of the railway between Sea Road and the Polegrove. Crofton Park is a district of south London also in the Borough of Lewisham and close to Brockley. (Adopted by Borough of Bexhill 4th July 1966).",
				"adopted": "1966-07-04"
			}, {
				"name": "Crowhurst Lane",
				"date": "1940",
				"desc": "Village in East Sussex, 5 miles north-west of Hastings. The Bexhill West to Crowhurst railway branch line ran close to this lane. (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1956).",
				"adopted": "1956"
			}, {
				"name": "Crowmere Avenue",
				"date": "~1886",
				"desc": "Crowmere was a small estate to the east of Holliers Hill which was absorbed by the Manor of Bexhill in the 18th century. According to a tithe map / schedule of 1839 / 1843 this area was called Crowmare and was owned by the Earl of Amherst. Between 1924 to 1928 the local street directories included Woodsgate Park Estate within Crowmere Avenue. (Adopted by Borough of Bexhill 22nd July 1935).",
				"adopted": "1935-07-22"
			}, {
				"status": "bygone",
				"name": "Crowmere Crescent",
				"date": "1932 to 1934",
				"desc": "Now known as St Patrick's Crescent."
			}, {
				"name": "Crowmere Terrace",
				"date": "1935",
				"desc": "Crowmere was a small estate to the east of Holliers Hill which was absorbed by the Manor of Bexhill in the 18th century. According to a tithe map / schedule of 1839 / 1843 this area was called Crowmare and was owned by the Earl of Amherst. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Cuckfield Close",
				"date": "1974",
				"desc": "Large village in West Sussex, 13 miles north of Brighton. (Adopted by East Sussex County Council, 18th October 1974).",
				"adopted": "1974-10-18"
			}, {
				"name": "Cumberland Road",
				"date": "1899",
				"desc": "One of Sidley's former windmills called Cumberland Mill once stood near here. (Adopted by Borough of Bexhill 29th June 1955).",
				"adopted": "1955-06-29"
			}, {
				"name": "Cuthbert Close",
				"date": "1955",
				"desc": "Alderman William Nicholson Cuthbert, JP was Bexhill Borough Mayor, 1936 to 1942. He received the Freedom of the Borough in 1943. (Paton Road is nearby). (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1956).",
				"adopted": "1956"
			}, {
				"name": "Daffodil Way",
				"date": "2022",
				"desc": "Daffodil is the common name of a species of flowering plants belonging to the Amaryllidaceae family. (Bluebell Close, Buttercup Close, Clover Way, Daisy Way, Foxglove Avenue, Snowdrop Way, Tulip Way and Orchid Way are nearby)."
			}, {
				"name": "Daisy Way",
				"date": "2020",
				"desc": "Daisy is the common name of a species of flowering plants belonging to the Asteraceae family. (Bluebell Close, Buttercup Close, Clover Way, Daffodil Way, Foxglove Avenue, Snowdrop Way, Tulip Way and Orchid Way are nearby)."
			}, {
				"name": "Dallington Close",
				"date": "1974",
				"desc": "Village in East Sussex, 8 miles west of Battle. (Adopted by East Sussex County Council on an unknown date).",
				"adopted": "unknown"
			}, {
				"name": "Dalmeny Road",
				"date": "1916",
				"desc": "Origin of this name remains unknown. Dalmeny is the name of a town and country house overlooking the Firth of Forth, west of Edinburgh. (Adopted by Borough of Bexhill 8th November 1966).",
				"adopted": "1966-11-08"
			}, {
				"name": "Danecourt Close",
				"date": "1940",
				"desc": "Near here the former independent school, Dane Court School for Girls, was opened by Miss Ford in 1920 and closed in the early 1930s. (Adopted by Borough of Bexhill 30th April 1958).",
				"adopted": "1958-04-30"
			}, {
				"name": "Daresbury Close",
				"date": "1964",
				"desc": "R A Larkin and Bros Ltd were major developers and house builders in Bexhill between 1924 to 1988. Daresbury Holdings owned and managed many of Larkins properties between 1964 to 1977. Before Reg Larkin moved to Bexhill he worked in Warrington, a town between Liverpool and Manchester, which is also where he met his future wife. Daresbury is a village 5 miles south-west of Warrington. (Adopted by Borough of Bexhill 16th August 1965).",
				"adopted": "1965-08-16"
			}, {
				"name": "Davis Close",
				"date": "1955",
				"desc": "Alderman Alfred Henry Davis was a local politician from about 1931 to the early 1940s. (Ashby Close is nearby). (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1966).",
				"adopted": "1966"
			}, {
				"name": "De La Warr Mews",
				"date": "1905",
				"desc": "The De La Warr family, which acquired the manor of Bexhill following the marriage in 1813 of Elizabeth Sackville to the 5th Earl De La Warr, originally came from the west Midlands. There, back in 1299, King Edward I conferred a barony on Roger La Warr. Originally a mews was a street or yard of stables often converted into dwelling-houses or garages. Evidence of earlier use of these buildings for livery stables and associated trades can still be seen. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "De La Warr Parade",
				"date": "road 1887; name c1945",
				"desc": "The De La Warr family, which acquired the manor of Bexhill following the marriage in 1813 of Elizabeth Sackville to the 5th Earl De La Warr, originally came from the west Midlands. There, back in 1299, King Edward I conferred a barony on Roger La Warr. From about 1900 street directories and maps have included this name for different sections of the town's eastern seafront. The present-day De La Warr Parade from Sea Road to the top of Galley Hill has previously been named Marina, Marine Parade and Marine Promenade. Although maps from the 1940s refer to the Parade it is only in the early 1950s that street directories specifically refer to the Parade in its present-day location. (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estate, by at least 1956).",
				"adopted": "1956"
			}, {
				"name": "De La Warr Road",
				"date": "1887",
				"desc": "The De La Warr family, which acquired the manor of Bexhill following the marriage in 1813 of Elizabeth Sackville to the 5th Earl De La Warr, originally came from the west Midlands. There, back in 1299, King Edward I conferred a barony on Roger La Warr. (Adopted at an unknown date as a publicly maintainable highway [Trunk Road] under the 1835 Highways Act).",
				"adopted": "unknown"
			}, {
				"name": "De Moleyns Close",
				"date": "1991",
				"desc": "Adam de Moleyns was Bishop of Chichester from 1445 to 1450. The Close is within the grounds of the former manor house which was originally owned by the church. (Adopted by East Sussex County Council on an unknown date).",
				"adopted": "unknown"
			}, {
				"name": "Deans Close",
				"date": "1962",
				"desc": "Probably relates to either the villages of East and West Dean in West Sussex, respectively 6 miles north-east and 5 miles north of Chichester or the villages of East Dean and Westdean in East Sussex, respectively 4 miles and 6 miles west of Eastbourne. Dean is also a place-name meaning in the valley; Deans Drive in particular leads down to the brook running through Sidley Wood. (Adopted by Borough of Bexhill 15th March 1965).",
				"adopted": "1965-03-15"
			}, {
				"name": "Deans Drive",
				"date": "1937",
				"desc": "Probably relates to either the villages of East and West Dean in West Sussex, respectively 6 miles north-east and 5 miles north of Chichester or the villages of East Dean and Westdean in East Sussex, respectively 4 miles and 6 miles west of Eastbourne. (Adopted by Borough of Bexhill, 1st part 26th March 1958, 2nd part 27th March 1963, 3rd part 29th June 1964 and last part 15th March 1965).",
				"adopted": "1958-03-26;1936-03-27;1964-06-29;1965-03-15"
			}, {
				"name": "Deerswood Lane",
				"date": "after 1974 but before 1983",
				"desc": "Deer belong to the species Cervidae and are even-toed hoofed animals characterised by the possession of antlers by the males. (Badgers Mount, Foxhill and Squirrel Close are nearby). (Adopted by East Sussex County Council on an unknown date).",
				"adopted": "unknown"
			}, {
				"name": "Denbigh Close",
				"date": "c1995",
				"desc": "Named after The Denbigh, a local public house and restaurant, which dates as the Denbigh Arms from between 1840 and 1863. The name is thought to have a Welsh origin maybe from Denbighshire. There is also a connection between a battalion under the command of Lord Abervenny (short for Abergavenny) being based in Bexhill during 1798 as the battalion included men from Wales, including Denbighshire.",
				"adopted": "unknown"
			}, {
				"status": "bygone",
				"name": "Depot Road",
				"date": "road before 1881; name 1912 to 1927",
				"desc": "Although described in street directories as from Station Road to Reginald Road it was probably that section of present-day Station Road which runs along the side of Sainsbury's car-park. The South East and Chatham Railway goods yard was located here following the opening of the town's first railway in 1846."
			}, {
				"status": "bygone",
				"name": "Devonshire Place",
				"date": "square 1886; name 1910 to 1920",
				"desc": "Previously known as Station Yard then Station Square. Now known as Devonshire Square."
			}, {
				"name": "Devonshire Road",
				"date": "1886",
				"desc": "County in south-west England, now more commonly referred to as Devon. Nearby Cornwall Road was also developed at the same time. John Webb was the surveyor and builder who laid out much of the town centre and was also the first licensee of the Devonshire Hotel (1886). He may also have been looking across to Eastbourne where the 7th Duke of Devonshire was a prominent landowner and developer at a similar time. Devonshire Road is also a major thoroughfare through Honor Oak, in the Borough of Lewisham, close to John Webb's original home in Brockley, also within Lewisham. (Adopted by Borough of Bexhill 1st June 1894). (Road passage west of Devonshire Road linking Parkhurst Road and Western Road, serving Devonshire Road, Parkhurst Road and Western Road properties, adopted by Borough of Bexhill 29th January 1912)."
			}, {
				"name": "Devonshire Square",
				"date": "square 1886; name c1920",
				"desc": "County in south-west England, now more commonly referred to as Devon. Nearby Cornwall Road was also developed at the same time. John Webb was the surveyor and builder who laid out much of the town centre and was also the first licensee of the Devonshire Hotel (1886). He may also have been looking across to Eastbourne where the 7th Duke of Devonshire was a prominent landowner and developer at a similar time. Previously known as Station Yard then Station Square then Devonshire Place. (Adopted by Borough of Bexhill 19th April 1895).",
				"adopted": "1895-04-19"
			}, {
				"name": "Diamond Jubilee Walk",
				"date": "2012",
				"desc": "This pedestrian walk through the Metropole Lawn was officially opened by the Earl and Countess of Wessex on 5th July 2012 in honour of Queen Elizabeth II's Diamond Jubilee."
			}, {
				"name": "Diana Close",
				"date": "1970",
				"desc": "Family forename of one of the developers surnames, Davey-Casselden Limited. (Allen Way, Amanda Close, Angela Close, Christine Close, Gwyneth Grove, Ian Close and Lesley Close are nearby). (Adopted by Borough of Bexhill 1st May 1972).",
				"adopted": "1972-05-01"
			}, {
				"name": "Dorset Road",
				"date": "road 1899; name 1930",
				"desc": "Descendants of Thomas Sackville would become Earls of Dorset from 1603 and Dukes of Dorset from 1714. The titles became extinct in 1843 when the unmarried 5th Duke died. The present-day road from the junction of Magdalen Road and Ashdown Road crosses over King Offa Way to Penland Road. (Adopted by Borough of Bexhill, 1st part 20th October 1902, 2nd 3rd and 4th parts 20th December 1909 and 5th part 1915. The section from Magdalen Road to King Offa Way was adopted at an unknown date as a publicly maintainable highway under the 1835 Highways Act).).",
				"adopted": "unknown"
			}, {
				"name": "Dorset Road South",
				"date": "road 1899; name 1930",
				"desc": "Descendants of Thomas Sackville would become Earls of Dorset from 1603 and Dukes of Dorset from 1714. The titles became extinct in 1843 when the unmarried 5th Duke died. The present-day road from De La Warr Parade to the junction of Magdalen Road and Ashdown Road. The level crossing over the railway closed soon after the then Manor Road (now Bridge Road) bridge was built in 1927 thereby creating two unequal parts to the present-day road. (Adopted by Borough of Bexhill, 1st part 20th October 1902, 2nd 3rd and 4th parts 20th December 1909 and 5th part 1915).",
				"adopted": "1902-10-20;1909-12-20;1915"
			}, {
				"status": "bygone",
				"name": "Dorset Road {1}",
				"date": "1897 to 1898",
				"desc": "Descendants of Thomas Sackville would become Earls of Dorset from 1603 and Dukes of Dorset from 1714. The titles became extinct in 1843 when the unmarried 5th Duke died. The original Dorset Road ran from the present-day De La Warr Parade to Cantelupe Road. In 1899 the road was extended to the present-day De La Warr Road and named Lower Dorset Road. (See also Upper Dorset Road)."
			}, {
				"status": "bygone",
				"name": "Dorset Road {2}",
				"date": "road 1899; name 1907 to 1929",
				"desc": "In 1907 both Lower Dorset Road and Upper Dorset Road were renamed as one road, Dorset Road, from De La Warr Parade to Hastings Road."
			}, {
				"name": "Dorset Road {3}",
				"date": "road 1899; name 1930",
				"desc": "The present-day road from the junction of Magdalen Road and Ashdown Road crosses over King Offa Way to Penland Road. (Adopted by Borough of Bexhill, 1st part 20th October 1902, 2nd 3rd and 4th parts 20th December 1909 and 5th part 1915. The section from Magdalen Road to King Offa Way was adopted at an unknown date as a publicly maintainable highway under the 1835 Highways Act).",
				"adopted": "unknown"
			}, {
				"name": "Down Road",
				"date": "~1841",
				"desc": "Road close to the old common land of Bexhill known as “The Down”. This word means, especially in south-east England, an undulating upland tract of pasture-land. Old parish road which in early records is sometimes recorded as Downs Road. The outline of the road can be seen on an Ordnance Survey map 1795 to 1825. The Down Road bridge carrying the Bexhill West to Crowhurst railway branch line not only crossed over Down Road but also Little Common Road, the central support falling between the two roads at the junction; the bridge was demolished in 1967. (Taken over as a Public Highway by the Local Board of Bexhill in 1884).",
				"adopted": "1884"
			}, {
				"name": "Downlands Avenue",
				"date": "1936",
				"desc": "Road close to the old common land of Bexhill known as “The Down”. This word means, especially in south-east England, an undulating upland tract of pasture-land. (Adopted by Borough of Bexhill 19th December 1938).",
				"adopted": "1938-12-19"
			}, {
				"name": "Downlands Close",
				"date": "1936",
				"desc": "Road close to the old common land of Bexhill known as “The Down”. This word means, especially in south-east England, an undulating upland tract of pasture-land. (Adopted by Borough of Bexhill 19th December 1938).",
				"adopted": "1938-12-19"
			}, {
				"name": "Drayton Rise",
				"date": "1969",
				"desc": "Lord George Sackville (1716 to 1785), the third son of the 1st Duke of Dorset, inherited the house and estate of Drayton on the Leicestershire / Northamptonshire border from Lady Elizabeth Germain. He was created Viscount Sackville of Drayton and Baron Bolebrooke in 1782. This road is built along a gentle slope away from Collington Lane West. (Adopted by Borough of Bexhill 8th November 1971).",
				"adopted": "1971-11-08"
			}, {
				"name": "Drove Road",
				"date": "before 1778",
				"desc": "Farm track named after a group of animals moving together in a group."
			}, {
				"name": "Druids Close",
				"date": "2022",
				"desc": "Druids Bend is the name of the hairpin corner in Brands Hatch racing circuit, Kent; or turn fifteen at Oulton Park racing circuit, Cheshire. (Becketts Close, Brooklands Road, Cascades Way, Clervaux Close, Gracelands Drive, Luffield Drive, Paddock Way and Woodcote Way are nearby)."
			}, {
				"name": "Duke Street",
				"date": "1964",
				"desc": "An important local farming family during the 1800s. Thomas, Walter and William Duke owned and managed a number of farms around Bexhill including Birchington and Preston Farms. (Adopted by Borough of Bexhill 30th April 1973).",
				"adopted": "1973-04-30"
			}, {
				"name": "East Parade",
				"date": "1883",
				"desc": "On the eastern side of Bexhill's seafront. This name more often refers to the traffic-free promenade from Sea Road to Galley Hill. In early street directories and on maps the adjacent road was more usually called Marina, Marine Parade or Marine Promenade before it was named De La Warr Parade. In 1896 the bicycle boulevard was built along East Parade from opposite the former Sackville Hotel to a turnaround point at the bottom of Galley Hill."
			}, {
				"name": "Eastergate",
				"date": "after 1974 but before 1996",
				"desc": "Village in West Sussex, 6 miles east of Chichester. (Adopted by East Sussex County Council on an unknown date).",
				"adopted": "unknown"
			}, {
				"name": "Eastway",
				"date": "c2000",
				"desc": "A narrow one-way road along which traffic travels in an easterly direction. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Eastwood Road",
				"date": "1911",
				"desc": "Previously known as Braggs Lane which led to Braggs Farm where Mr Ben Eastwood was a farmer. He also owned a considerable amount of land in this locality. (Adopted by Borough of Bexhill 23rd December 1929).",
				"adopted": "1929-12-23"
			}, {
				"name": "Eden Drive",
				"date": "1955",
				"desc": "Robert Anthony Eden (1897 to 1977), British Conservative Prime Minister, 1955 to 1957. (Alexander Drive and Winston Drive are nearby). (Adopted by Borough of Bexhill, 1st part 27th June 1962 and last part 5th July 1965).",
				"adopted": "1962-06-27;1965-07-05"
			}, {
				"name": "Edinburgh Road",
				"date": "road 1897; name 1899",
				"desc": "Prince Albert, Duke of Edinburgh (1844 to 1900), was the second son of Queen Victoria and Prince Albert. Previously known as Whillier Street. (Adopted by Borough of Bexhill 17th September 1900).",
				"adopted": "1900-09-17"
			}, {
				"name": "Edmonton Road",
				"date": "1950",
				"desc": "Capital of the Canadian province of Alberta. Canadian troops were stationed in Bexhill during both World Wars. (Calgary Road, Canada Way and St Lawrence Road are nearby). (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1956).",
				"adopted": "1956"
			}, {
				"name": "Effingham Drive",
				"date": "c1975",
				"desc": "Near here the former independent school called Effingham House School for Girls was opened by Miss Ismay in 1908, having moved to Bexhill from Folkestone. The school subsequently closed in about 1969. (Adopted by East Sussex County Council on an unknown date).",
				"adopted": "unknown"
			}, {
				"status": "bygone",
				"name": "Egerton Park Road",
				"date": "1897 to 1904",
				"desc": "Charles Augustus Egerton of The Banks, Mountfield near Battle, married Mabelle Brassey, older sister of Muriel who was the first wife of Gilbert, 8th Earl De La Warr. Charles Egerton was a wealthy local farmer. Initially this road ran from the Sackville Road and Marina roundabout to Egerton Park. In 1904 the road was extended to Brockley Road and in 1905 the whole road was re-named Egerton Road."
			}, {
				"name": "Egerton Road",
				"date": "road 1897; name 1905",
				"desc": "Charles Augustus Egerton of The Banks, Mountfield near Battle, married Mabelle Brassey, older sister of Muriel who was the first wife of Gilbert, 8th Earl De La Warr. Charles Egerton was a wealthy local farmer. Initially this road ran from the Sackville Road and Marina roundabout to Egerton Park. Previously known as Egerton Park Road. (Adopted by Borough of Bexhill, 1st part 17th September 1900, 2nd part 31st July 1902 and last part 30th November 1925). ([1] Road passage south of Egerton Road linking Brockley Road and Park Avenue, serving Egerton Road and West Parade residences, adopted by Borough of Bexhill 24th November 1930. [2] Road passage south of Egerton Road and east of Park Road linking Park Road and Egerton Road, serving Egerton Road and West Parade residences and [3] Road passage south of Egerton Road and west of Park Road linking Park Road and Egerton Road, serving Egerton Road and West Parade residences, both adopted by Borough of Bexhill 22nd July 1935).",
				"adopted": "1935-07-22"
			}, {
				"name": "Elderwood Close",
				"date": "c1998",
				"desc": "Elder or elderberry belong to the genus Sambucus and consist of up to 30 species of shrubs or small trees. Their clusters of black or red berries are familiar in the autumn. (Adopted by East Sussex County Council on an unknown date).",
				"adopted": "unknown"
			}, {
				"name": "Ellerslie Lane",
				"date": "road ~1841; name 1912",
				"desc": "An old parish lane part of which was previously known as Whitehill Lane. The outline of the lane can be seen on an Ordnance Survey map 1795 to 1825. The house called Ellerslie had been built on this lane by 1878 so maybe the lane was renamed after the house. (Taken over as a Public Highway by the Local Board of Bexhill in 1884).",
				"adopted": "1884"
			}, {
				"name": "Elm Close",
				"date": "2005",
				"desc": "Elms are deciduous or semi-deciduous trees belonging to the Ulmus genus. (Alder Gardens, Hazel Grove, Hornbeam Avenue and Poplar Close are nearby). (Adopted by East Sussex County Council on an unknown date).",
				"adopted": "unknown"
			}, {
				"name": "Elmstead Road",
				"date": "1896",
				"desc": "Origin of this name remains uncertain. Built on the former Fairmount Estate, which was bordered by the present-day Hastings Road, Elmstead Road, Dorset Road and King Offa Way. In the 1886 street directory, Fairmount and Elmstead were both large detached houses on St Johns Road. Elmstead is still there in March 2013 but Fairmount was demolished at an unknown date. Although Elmstead Road is close to Fairmount Road it is uncertain whether the two properties in St Johns Road had any influence on the choice of these two road names. Elmstead can mean a place by the elm-trees. Elmstead Heath, Elmstead Market and Elmstead Row are three villages close to, and to the east of, Colchester, Essex. (Adopted by Borough of Bexhill 20th October 1902).",
				"adopted": "1902-10-20"
			}, {
				"name": "Elsted Road",
				"date": "1964",
				"desc": "Village in West Sussex, 4 miles west of Midhurst. (Adopted by Borough of Bexhill 30th January 1967).",
				"adopted": "1967-01-30"
			}, {
				"name": "Elva Way",
				"date": "2010",
				"desc": "Elva was a sports and racing car manufacturing company originally based in Bexhill. It was founded by Frank G Nichols who was born in Bexhill in 1920. Starting in the late 1940s he subsequently had a number of garages in London Road. Production of Elva cars ceased in 1969 and the former Elva workshop in London Road was demolished in 2013.",
				"adopted": "unknown"
			}, {
				"name": "Endwell Road",
				"date": "road 1887; name 1893",
				"desc": "John Webb (1840 to 1922) was a surveyor and builder from Brockley, a district of south London located in the Borough of Lewisham. Mr Webb was responsible for developing much of the land south of the railway between Sea Road and the Polegrove. Endwell Road has been, and remains, a major route through Brockley in south London. In 2014 John Webb's former home “Brockley House” could still be seen at 11 Endwell Road. (Adopted by Borough of Bexhill 17th September 1900).",
				"adopted": "1900-09-17"
			}, {
				"name": "Eridge Close",
				"date": "1970",
				"desc": "Small village in East Sussex, 2 miles south-west of Tunbridge Wells. (Adopted by Borough of Bexhill 7th August 1972).",
				"adopted": "1972-08-07"
			}, {
				"name": "Eversley Road",
				"date": "1888",
				"desc": "The origin of the name remains uncertain but maybe named after Charles Shaw-Lefevre, 1st Viscount Eversley (1794 to 1888), a British Whig politician representing constituencies in Hampshire. He was the second longest serving Speaker of the House of Commons (1839 to 1857) as well as a Governor of the Isle of Wight. He died the year this road was first developed. The Eversley School for the Daughters of Gentlemen was founded at 43 Eversley Road in 1888 by the Misses Poulton. It closed about 1910 although the house is still there in January 2014. (Adopted by Borough of Bexhill 1st June 1894).",
				"adopted": "1894-06-01"
			}, {
				"status": "bygone",
				"name": "Excelsior Road",
				"date": "1902 to 1917",
				"desc": "This was one of the original roads on the Woodsgate Park Estate. The street directories list the road for over fifteen years but without indicating its exact location. No map has yet been seen with this road marked on it."
			}, {
				"name": "Fairfield Chase",
				"date": "after 1974 but before 1995",
				"desc": "Village in Kent, 5 miles north-east of Rye. (Adopted by East Sussex County Council on an unknown date).",
				"adopted": "unknown"
			}, {
				"name": "Fairlight Close",
				"date": "1966",
				"desc": "Village in East Sussex, 3 miles east of Hastings. (Adopted by Borough of Bexhill 7th November 1966).",
				"adopted": "1996-11-07"
			}, {
				"name": "Fairmount Road",
				"date": "1891",
				"desc": "Built on the former Fairmount Estate, which in 1887 was bordered approximately by the present-day Hastings Road, Elmstead Road, Dorset Road and De La Warr Road. In the 1886 street directory, Fairmount and Elmstead were both large detached houses on St Johns Road. Elmstead is still there in March 2013 but Fairmount was demolished in about 1923. Although Fairmount Road is close to Elmstead Road it is uncertain whether the two properties in St Johns Road had any influence on the choice of these two road names. (Adopted by Borough of Bexhill 20th October 1902).",
				"adopted": "1902-10-20"
			}, {
				"name": "Falconbury Drive",
				"date": "c1975",
				"desc": "Near here the former independent school called Falconbury Preparatory School for Boys was opened by Mr and Mrs Faulkner in 1930 and closed about 1968. (Adopted by East Sussex County Council on an unknown date).",
				"adopted": "unknown"
			}, {
				"name": "Faygate Close",
				"date": "1969",
				"desc": "Hamlet in West Sussex, 3 miles south-west of Crawley. (Adopted by Borough of Bexhill 1st February 1970).",
				"adopted": "1970-02-01"
			}, {
				"name": "Festival Gardens",
				"date": "1952",
				"desc": "Commemorates the 1951 Festival of Britain. (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1956).",
				"adopted": "1956"
			}, {
				"name": "Filsham Drive",
				"date": "1934",
				"desc": "Named after a nearby area of St Leonards-on-Sea, East Sussex. (Adopted by Borough of Bexhill 16th August 1971).",
				"adopted": "1971-08-16"
			}, {
				"name": "Filsham Lane",
				"date": "early 1940s",
				"desc": "Named after a nearby area of St Leonards-on-Sea, East Sussex."
			}, {
				"name": "Findon Close",
				"date": "1968",
				"desc": "Village in West Sussex, 4 miles north of Worthing. (Adopted by Borough of Bexhill 3rd February 1969).",
				"adopted": "1969-02-03"
			}, {
				"name": "Firle Road",
				"date": "1964",
				"desc": "Village in East Sussex, 4 miles east of Lewes. (Adopted by Borough of Bexhill 5th July 1965).",
				"adopted": "1965-07-05"
			}, {
				"name": "First Avenue",
				"date": "1939",
				"desc": "Ordinal number. (Second and Third Avenues are nearby). (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Firtree Close",
				"date": "1971",
				"desc": "Firs belong to the genus Abies and comprise around 50 species of evergreen coniferous trees. (Date of adoption by Borough of Bexhill or later East Sussex County Council not known).",
				"adopted": "unknown"
			}, {
				"name": "Fiveways",
				"date": "no date",
				"desc": "Old popular name for road junction near St Stephen's Church where Down Road, West Down Road, Broadoak Lane, Gunters Lane and Woodsgate Park meet."
			}, {
				"name": "Fontwell Avenue",
				"date": "1970",
				"desc": "Village in West Sussex, 4 miles west of Arundel. (Date of adoption by Borough of Bexhill or later East Sussex County Council not known).",
				"adopted": "unknown"
			}, {
				"name": "Four Turnings",
				"date": "no date",
				"desc": "Old popular name for crossroad between Peartree Lane, Turkey Road and Whydown Road."
			}, {
				"name": "Fowlers Close",
				"date": "1963",
				"desc": "The origin of the name remains uncertain but maybe it is the rural occupation of a fowler as a keeper of poultry; land in this area was previously meadows and orchards belonging to Hurchington Farm. (Bale Close and Riders Bolt are nearby). (Adopted by Borough of Bexhill 21st September 1970).",
				"adopted": "1970-09-21"
			}, {
				"name": "Foxglove Avenue",
				"date": "2020",
				"desc": "Foxglove is the common name of a species of flowering plants belonging to the Plantaginaceae family. (Bluebell Close, Buttercup Close, Clover Way, Daisy Way, Daffodil Way, Snowdrop Way, Tulip Way and Orchid Way are nearby)."
			}, {
				"name": "Foxhill",
				"date": "after 1974 but before 1983",
				"desc": "Foxes are wild animals belonging to the Canidae family who have red or grey fur, long narrow snouts and a bushy tail. (Badgers Mount, Deerswood Lane and Squirrel Close are nearby). (Adopted by East Sussex County Council on an unknown date).",
				"adopted": "unknown"
			}, {
				"name": "Foxley Drive",
				"date": "2015",
				"desc": "Foxley is name of the private residence that used to occupy this land together with Kewhurst Farm."
			}, {
				"name": "Frant Avenue",
				"date": "1971",
				"desc": "Village in East Sussex, 5 miles south of Tunbridge Wells. (Date of adoption by Borough of Bexhill or later East Sussex County Council not known).",
				"adopted": "unknown"
			}, {
				"name": "Frant Close",
				"date": "1971",
				"desc": "Village in East Sussex, 5 miles south of Tunbridge Wells. (Adopted by East Sussex County Council on an unknown date).",
				"adopted": "unknown"
			}, {
				"name": "Freezeland Lane",
				"date": "road ~1841; name c1930",
				"desc": "Old parish lane which in 1797 was described as Shortwood Lane leading from Friesland to Cobshill. The outline of the lane can be seen on an Ordnance Survey map 1795 to 1825. Freezeland Farm is close to the junction of this lane with Ninfield Road. (Taken over as a Public Highway by the Local Board of Bexhill in 1884).",
				"adopted": "1884"
			}, {
				"name": "Freshfields",
				"date": "1989",
				"desc": "A building developer called Freshfield Properties Ltd was based in Little Common in the 1980's. Alternatively it may just be an attempt to project a positive public image to a road leading to Pebsham Landfill and Waste Water sites. (This road had not been adopted by East Sussex County Council)."
			}, {
				"name": "Fryatts Way",
				"date": "after 1974 but before 1984",
				"desc": "Charles F Fryatt was a local developer / builder and farmer at Oldborne or Little Broadoak Farm. This development was built on some of the farmland. (Adopted by East Sussex County Council on an unknown date).",
				"adopted": "unknown"
			}, {
				"name": "Furnells Way",
				"date": "2017",
				"desc": "Furnells is a name that appears on the Tithe map of 1839 as land used by Upper Worsham Farm, specifically for the cultivation of hops."
			}, {
				"name": "Fyning Place",
				"date": "1971",
				"desc": "Hamlet in West Sussex, 6 miles west of Midhurst. (Date of adoption by Borough of Bexhill or later East Sussex County Council not known).",
				"adopted": "unknown"
			}, {
				"name": "Gainsborough Road",
				"date": "after 1974 but before 1997",
				"desc": "Thomas Gainsborough (1727 to 1788) was an English portrait and landscape painter. (Constable Way, Reynolds Drive and Turner Close are nearby). (Adopted by East Sussex County Council on an unknown date).",
				"adopted": "unknown"
			}, {
				"name": "Galley Hill",
				"date": "before 1860",
				"desc": "Section of the esplanade from the present-day Brookfield Road to the top of Galley Hill, some maps show it as part of De La Warr Parade. The origin of the name Galley Hill remains uncertain but probably it was an earlier Gallows Hill although there is no known evidence to confirm this."
			}, {
				"name": "Galley Hill View",
				"date": "c2000",
				"desc": "The origin of the name Galley Hill remains uncertain but probably it was an earlier Gallows Hill although there is no known evidence to confirm this. Galley Hill can be seen from here. (Adopted by East Sussex County Council on an unknown date).",
				"adopted": "unknown"
			}, {
				"name": "Garden Close",
				"date": "1966",
				"desc": "Built in the grounds of a former large home called The Garden House which was built in the early 1950s and demolished about 1964. (Adopted by Borough of Bexhill 29th June 1970).",
				"adopted": "1970-06-29"
			}, {
				"name": "Garth Close",
				"date": "c1995",
				"desc": "Deutches Paedagogium was an independent school for German boys founded in 1910 by Mrs Du Mont who lived at the Manor House, Bexhill Old Town. It closed at the outbreak of World War One and then reopened in 1920 as Garth Place, an independent school for boys aged 7 to 14 years. This school closed in 1938 but eventually housed St Francis independent school for girls aged 4 to 18 years, plus a few boys of junior school age. The gate house can still be seen adjacent to West Down Road. (St Francis Chase is nearby). (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Gatehouse Close",
				"date": "1992",
				"desc": "Built on the site of former Gate House Hotel which opened in about 1937 but did not close until sometime after 1974. There was already a house called Gatehouse on this site, flanked by both the East and West Lodges on Cooden Drive, when the hotel first opened. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Gatelands Drive",
				"date": "1964",
				"desc": "Name probably relates to an entrance to the former Woodsgate Farm which was located very near here. There was also a Gatelands Guest House at 17 Amherst Road during the 1950s but no connection to Gatelands Drive has been established. (Adopted by Borough of Bexhill, 1st part 16th August 1965 and 2nd part 30th January 1967).",
				"adopted": "1965-08-16;1967-01-30"
			}, {
				"name": "Gavin Astor Close",
				"date": "1971",
				"desc": "Gavin Astor, 2nd Baron Astor of Hever (1918 to 1984), was a British soldier and publisher. (There is also a Hever Crescent in Bexhill). (Adopted by Borough of Bexhill 30th April 1973).",
				"adopted": "1973-04-30"
			}, {
				"status": "bygone",
				"name": "Gay Close",
				"date": "1972 to 1974",
				"desc": "This road, without any properties, was listed in the street directories from 1972 to 1974, the last published directory. The road was described as being at 63 Gwyneth Close but that does not correspond to any present-day road development. Maybe this road was only a proposal which was never built."
			}, {
				"name": "Georgian Close",
				"date": "1961",
				"desc": "The houses in this road resemble the Georgian style of architecture. (Adopted by Borough of Bexhill 30th January 1963).",
				"adopted": "1963-01-30"
			}, {
				"name": "Gibb Close",
				"date": "1957",
				"desc": "The origin of the name remains uncertain. Either the name relates to Alderman James Gibb who was Bexhill Borough Mayor, 1920 to 1921, he also farmed Glyne Farm, or Councillor Ronald Gibb, CBE who was Bexhill Borough Mayor, 1922 to 1923. Maybe the road name commemorates them both as they have the same surname and their mayorships were consecutive. (Adopted by Borough of Bexhill 28th January 1959).",
				"adopted": "1959-01-28"
			}, {
				"name": "Gillham Wood Avenue",
				"date": "1927",
				"desc": "George Gillham (1773 to 1831), leader of the ruthless Little Common Gang of smugglers, is said to have had a hide-out in these woods. Later the Gillham family became builders and carpenters and were responsible for much of the 19th century development of Little Common. (Date of adoption by Borough of Bexhill or later East Sussex County Council not known).",
				"adopted": "unknown"
			}, {
				"name": "Gillham Wood Road",
				"date": "road 1925; name 1928",
				"desc": "George Gillham (1773 to 1831), leader of the ruthless Little Common Gang of smugglers, is said to have had a hide-out in these woods. Later the Gillham family became builders and carpenters and were responsible for much of the 19th century development of Little Common. Part of this road between Kewhurst Avenue and Tilgate Drive previously formed part of the former Birchington Avenue. (Date of adoption by Borough of Bexhill or later East Sussex County Council not known).",
				"adopted": "unknown"
			}, {
				"name": "Glassenbury Drive",
				"date": "1925",
				"desc": "Village in Kent, 2 miles west of Cranbrook. (Adopted by Borough of Bexhill 30th September 1959).",
				"adopted": "1959-09-30"
			}, {
				"name": "Glebe Close",
				"date": "after 1974 but before 1995",
				"desc": "A glebe, also known as a Church furlong, means an area of land the income from which is used to support a clergyman. Over the years St Peters Church has held land in Kewhurst, Collington and Peartree Lane although documentary proof that the land upon which this development has taken place belonged to the Church has not yet been established. (Adopted by East Sussex County Council on an unknown date).",
				"adopted": "unknown"
			}, {
				"name": "Gleneagles Close",
				"date": "after 1974 but before 1995",
				"desc": "Gleneagles in Perthshire, Scotland, is home to three championship golf courses. This close is built near the former Bexhill Golf Club course on Galley Hill and the adjacent land north of the railway line. (Links Drive and Sunningdale Close are nearby). (Adopted by East Sussex County Council on an unknown date).",
				"adopted": "unknown"
			}, {
				"name": "Glenleigh Avenue",
				"date": "1939",
				"desc": "Alternative spelling for Glynleigh. Part of Pevensey Levels south of Hailsham, East Sussex, is called Glynleigh Level. (Adopted by Borough of Bexhill 27th May 1940).",
				"adopted": "1940-05-27"
			}, {
				"name": "Glenleigh Park Road",
				"date": "1937",
				"desc": "Alternative spelling for Glynleigh. Part of Pevensey Levels south of Hailsham, East Sussex, is called Glynleigh Level. Known simply as Glenleigh Park until 1939. (Adopted by Borough of Bexhill, 1st part 27th May 1940, 2nd part 27th June 1956 and last part 25th July 1956).",
				"adopted": "1940-05-27;1956-06-27;1956-07-25"
			}, {
				"name": "Gloucester Avenue",
				"date": "1938",
				"desc": "Prince Henry, Duke of Gloucester (1900 to 1974) was the third son of King George V. (Kent Close and York Road are nearby). (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Glovers End",
				"date": "2015",
				"desc": "Service road leading to what was Glovers Farm. The name Glovers Farm can be seen in records as far back as 1567."
			}, {
				"name": "Glovers Lane",
				"date": "1895",
				"desc": "Lane leading to Glovers Farm to the north-east of Sidley Green. The name Glovers Farm can be seen in records as far back as 1567. (Adopted by Borough of Bexhill 25th April 1956).",
				"adopted": "1956-04-25"
			}, {
				"name": "Glyne Ascent",
				"date": "1925",
				"desc": "The former manor of Glyne, founded in the 16th century, was on coastal land at the eastern side of Bexhill. Glyne Manor Farm is recorded in 1263 as the home of John de Glynde. This road is built on a gentle slope between Hastings Road and De La Warr Road. (Adopted by Borough of Bexhill 29th October 1958).",
				"adopted": "1958-10-29"
			}, {
				"name": "Glyne Barn Close",
				"date": "1957",
				"desc": "The former manor of Glyne, founded in the 16th century, was on coastal land at the eastern side of Bexhill. Glyne Manor Farm is recorded in 1263 as the home of John de Glynde. (Adopted by Borough of Bexhill 29th April 1959).",
				"adopted": "1959-04-29"
			}, {
				"name": "Glyne Drive",
				"date": "1939",
				"desc": "The former manor of Glyne, founded in the 16th century, was on coastal land at the eastern side of Bexhill. Glyne Manor Farm is recorded in 1263 as the home of John de Glynde. (Adopted by Borough of Bexhill 29th April 1959).",
				"adopted": "1959-04-29"
			}, {
				"name": "Glyne Gap",
				"date": "C16",
				"desc": "The former manor of Glyne, founded in the 16th century, was on coastal land at the eastern side of Bexhill. Glyne Manor Farm is recorded in 1263 as the home of John de Glynde. Area of land separating the eastern edge of Bexhill from the western edge of St Leonards-on-Sea. The Combe Haven flowing into the English Channel at Bulverhythe is the natural division between these two areas."
			}, {
				"name": "Goodwood Close",
				"date": "1969",
				"desc": "Village in West Sussex, with a racecourse, 5 miles north of Chichester. (Plumpton Close and Paddock Close are nearby). (Adopted by Borough of Bexhill 30th June 1969).",
				"adopted": "1969-06-30"
			}, {
				"name": "Gotham",
				"date": "C15",
				"desc": "A former manor, first described in the 15th century, was on the north-western side of Bexhill. The original name may have meant \"Goda's Valley\" or related to the home of John de Gotecumbe in the 13th century."
			}, {
				"name": "Gracelands Drive",
				"date": "2021",
				"desc": "Gracelands is the name of turn six in the Rockingham Motor Speedway, Northamptonshire. (Becketts Close, Brooklands Road, Cascades Way, Clervaux Close, Druids Close, Luffield Drive, Paddock Way and Woodcote Way are nearby)."
			}, {
				"name": "Grand Avenue",
				"date": "1940",
				"desc": "Originally called Grand Drive, this is a descriptive name probably meaning the main avenue linking First, Second and Third Avenues. (Date of adoption of part of this avenue by Borough of Bexhill or later East Sussex County Council not known; the other part had not been adopted by January 2014).",
				"adopted": "unknown"
			}, {
				"name": "Grange Court Drive",
				"date": "1938",
				"desc": "Near here the former independent girls' school called Grange Court School was open during the 1930s. Miss Edkins had originally opened the school in Dorset Road during the 1920s. (Adopted by Borough of Bexhill, 1st part 30th April 1958 and last part 2nd February 1970).",
				"adopted": "1958-04-30;1970-02-02"
			}, {
				"name": "Grazebrook Close",
				"date": "1963",
				"desc": "The origin of the name remains uncertain. Maybe a descriptive name for an area of animal grazing land near to a stream as this development is on former farm land. (Adopted by Borough of Bexhill 19th December 1966)."
			}, {
				"name": "Green Lane",
				"date": "1902",
				"desc": "A green lane usually describes an ancient track which provided farmers, drovers, pack-horses and horse-drawn carts with accessible routes through the countryside. (Adopted by Borough of Bexhill 24th April 1963).",
				"adopted": "1963-04-24"
			}, {
				"name": "Greenways",
				"date": "1959",
				"desc": "Greenway can mean a grassy country track. This land, as well as the small woodland on the opposite northern side of Turkey Road, was part of Clinch Green Wood. (Clinch Green Avenue is nearby). (Adopted by Borough of Bexhill 3rd January 1962).",
				"adopted": "1962-01-03"
			}, {
				"name": "Grenada Close",
				"date": "1969",
				"desc": "R A Larkin and Bros Ltd were major developers and house builders in Bexhill between 1924 to 1988. This Caribbean island was one of the Larkin family's holiday destinations. (Adopted by Borough of Bexhill 27th September 1971).",
				"adopted": "1971-09-27"
			}, {
				"name": "Gullivers Mews",
				"date": "2023",
				"desc": "Charles Gulliver came to Bexhill in 1925 and founded Gullivers Bowls Club in 1952. Gulliver was Managing Director of the London Theatres of Variety Limited, owning some thirty music halls, including the London Palladium and the Holborn Empire. He passed away in June 1961.",
				"source": "https://gulliversbowlsclub.co.uk/pages/page_29698/history.aspx"
			}, {
				"name": "Gunters Lane",
				"date": "~1841",
				"desc": "An old parish lane; the outline of the lane can be seen on an Ordnance Survey map 1795 to 1825. There was a small tenement called Gunters at the corner of present-day Gunters Lane and Turkey Road; it was owned by John Gunter in the 17th century. (Taken over as a Public Highway by the Local Board of Bexhill in 1884).",
				"adopted": "1884"
			}, {
				"name": "Gwyneth Grove",
				"date": "1967",
				"desc": "Family forename of one of the developers surnames, Davey-Casselden Limited. (Allen Way, Amanda Close, Angela Close, Christine Close, Diana Close, Ian Close and Lesley Close are nearby). (Adopted by Borough of Bexhill 7th February 1972).",
				"adopted": "1972-02-07"
			}, {
				"status": "bygone",
				"name": "Haddocks Hill",
				"date": "road before 1841; name 1881 to 1936",
				"desc": "Previously known as Biggs Hill, then called Haddocks Hill after Mr Shoesmith, a fisherman, who lived in Haddocks House and was nicknamed \"Haddock's Eyes\". In some records between about 1890 and 1920 it is called Haddocks Hill Road. It ran from the present-day junction of Ninfield Road to about the junction of Chantry Avenue and Wrestwood Road; it is now part of Wrestwood Road. The outline of the road can be seen on an Ordnance Survey map 1795 to 1825."
			}, {
				"status": "bygone",
				"name": "Hamilton Road",
				"date": "before 1886 to 1907",
				"desc": "Now known as Chandler Road."
			}, {
				"name": "Hamilton Terrace",
				"date": "1898",
				"desc": "The origin of the name remains uncertain. Either there is an unidentified link to the Dukes of Hamilton in Scotland, remembering Sutherland Avenue, also with possible Scottish links, was developed at the same time. Maybe there is a connection to Hamilton Hall, now the Bexhill Christian Assembly, which was originally a corrugated iron building opened on Hamilton Terrace and Eastwood Road in 1898. Hamilton is also the name of a village in south Lancashire. (Adopted by Borough of Bexhill 3rd March 1902).",
				"adopted": "1902-03-03"
			}, {
				"name": "Hanover Close",
				"date": "1959",
				"desc": "Built near the site of the Kings German Legion's barracks, 1804 to 1814. These troops were Hanoverians. (Barrack Road is nearby). (Adopted by Borough of Bexhill 26th June 1963).",
				"adopted": "1963-06-26"
			}, {
				"name": "Harewood Close",
				"date": "1973",
				"desc": "Near here the former independent school called Harewood Preparatory School for Boys was opened by the Reverend Whicker in 1920. It amalgamated with its neighbouring school Normandale in 1963, finally closing in 1971. (Normandale is nearby). (Date of adoption by Borough of Bexhill or later East Sussex County Council not known).",
				"adopted": "unknown"
			}, {
				"name": "Hartfield Place",
				"date": "2020",
				"desc": "Village in East Sussex, 7 miles south-west of Tunbridge Wells. Buckhurst Park, the ancestral home of the Sackville family since the 16th century, is near this village. (This road had not been adopted by East Sussex County Council by September 2020)."
			}, {
				"name": "Hartfield Road",
				"date": "1924",
				"desc": "Village in East Sussex, 7 miles south-west of Tunbridge Wells. Buckhurst Park, the ancestral home of the Sackville family since the 16th century, is near this village. (Adopted by Borough of Bexhill 13th March 1967).",
				"adopted": "1967-03-13"
			}, {
				"name": "Haslam Crescent",
				"date": "1933",
				"desc": "The origin of the name is uncertain but on 2nd June 1931 land at Pebsham was purchased by an Ethel Clarice Haslam. (Adopted by Borough of Bexhill, 1st part 24th April 1963 and last part 15th August 1966).",
				"adopted": "1963-04-24;1966-08-15"
			}, {
				"status": "bygone",
				"name": "Hastings Lane",
				"date": "before 1841 to 1887",
				"desc": "Neighbouring town in East Sussex. This lane was once part of the medieval \"King's Highway\" leading from Bexhill to Hastings. The outline of the lane can be seen on an Ordnance Survey map 1795 to 1825. Now known as Hastings Road."
			}, {
				"name": "Hastings Road",
				"date": "road ~1841; name 1888",
				"desc": "Neighbouring town in East Sussex. This lane was once part of the medieval “King's Highway” leading from Bexhill to Hastings. Previously known as Hastings Lane. The present-day road is split into two unequal parts by King Offa Way. (Part adopted at an unknown date as a publicly maintainable highway [Trunk Road] under the 1835 Highways Act) and part taken over as a Public Highway by the Local Board of Bexhill in 1884).",
				"adopted": "unknown"
			}, {
				"name": "Havelock Road",
				"date": "road ~1886; name 1899",
				"desc": "Major-General Sir Henry Havelock KCB (1795 to 1857) was the hero of the relief of Lucknow (1857) during the Indian Mutiny. This road was previously known as Albert Road. (Adopted by Borough of Bexhill 3rd March 1902).",
				"adopted": "1902-03-03"
			}, {
				"name": "Haven Brook Avenue",
				"date": "2019",
				"desc": "The Combe Haven river/brook runs past here, previously known as the River Asten which has been suggested is to do with the etymology of the word Hastings."
			}, {
				"name": "Hawkhurst Way",
				"date": "1961",
				"desc": "Village in Kent, 10 miles south-east of Tunbridge Wells. This road is now continuous with Withyham Road which was developed in 1924. (Adopted by Borough of Bexhill, 1st part 4th July 1966, 2nd part 3rd February 1969 and 3rd part 26th April 1971).",
				"adopted": "1966-07-04;1969-02-03;1971-04-26"
			}, {
				"name": "Hawthorn Avenue",
				"date": "after 1974 but before 1996",
				"desc": "Hawthorn, also known as thornapple and hawberry, belongs to the genus Crataegus and comprises a large group of shrubs and trees. This site used to be occupied by Seafield School, which in turn was used as a prisoner of war camp during the Second World War. (Adopted by East Sussex County Council on an unknown date).",
				"adopted": "unknown"
			}, {
				"name": "Hazel Grove",
				"date": "2004",
				"desc": "Hazels are deciduous trees and large shrubs belonging to the genus Corylus. The nuts of all hazels are edible. (Alder Gardens, Elm Close, Hornbeam Avenue and Poplar Close are nearby). (Adopted by East Sussex County Council on an unknown date).",
				"adopted": "unknown"
			}, {
				"name": "Hazelwood Close",
				"date": "after 1974 but before 1997",
				"desc": "Hazels are deciduous trees and large shrubs belonging to the genus Corylus. The nuts of all hazels are edible. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Heatherdune Road",
				"date": "~1899",
				"desc": "Built through the grounds of a house called Heatherdune which was probably built in the late 1880s. The outline of the road can be seen on an Ordnance Survey map 1899. Between 1898 and 1908 the house was used as a school opened by Miss Potter and in the 1930s it was a convalescent home for children before later becoming a nursing home. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Heighton Close",
				"date": "c1975",
				"desc": "South Heighton is a village in East Sussex, 1 mile north of Newhaven. (Adopted by East Sussex County Council on an unknown date).",
				"adopted": "unknown"
			}, {
				"name": "Herbrand Walk",
				"date": "road ~1841; name 1925",
				"desc": "Earliest known ancestor of the Sackville family is Herbrand de Salcherville or Salkaville from the name of the village of Saqueville between Dieppe and Longueville, France. Herbrand is also a Christian name of both the 9th and 10th Earls De La Warr. The 8th Earl developed the Cooden Beach Golf Club in 1912 and the 9th Earl created the Cooden Beach Hotel in 1931. Herbrand Walk is adjacent to both properties. The outline of the road can be seen on an Ordnance Survey map 1795 to 1825. (Adopted by Borough of Bexhill 30th November 1931).",
				"adopted": "1931-11-30"
			}, {
				"name": "Hever Crescent",
				"date": "1922",
				"desc": "Village in Kent, 7 miles north-west of Tunbridge Wells. Gavin Astor Close in Pebsham is derived from Gavin Astor, 2nd Baron Astor of Hever (1918 to 1984). (Adopted by Borough of Bexhill 24th November 1930).",
				"adopted": "1930-11-24"
			}, {
				"name": "High Branches",
				"date": "after 1974 but before 1998",
				"desc": "A house called High Branches was built near here in about 1948 and demolished at an unknown date. This development was built within the grounds of the former house. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "High Peartree Lane",
				"date": "road ~1841; name 1925",
				"desc": "Name sometimes used to describe Peartree Lane from the Turkey Road and Whydown Road crossroads to Ninfield Road. High Peartree Wood is at the southern end of High Woods. The outline of the lane can be seen on an Ordnance Survey map 1795 to 1825. (Adopted at an unknown date as a publicly maintainable highway under the 1835 Highways Act).",
				"adopted": "unknown"
			}, {
				"name": "High Street",
				"date": "before 1841",
				"desc": "High streets were originally so named because they were in an elevated position, clear of flood water and likely to be easier to travel along, as is the case in Bexhill Old Town. Since these streets generally attracted shops and inns as a result, the name later became synonymous with the main street of a town.This is one of Bexhill’s old parish streets and its outline can be seen on an Ordnance Survey map 1795 to 1825.(Adopted at an unknown date as a publicly maintainable highway [Trunk Road] under the 1835 Highways Act until the opening of King Offa Way in 1980).",
				"adopted": "unknown"
			}, {
				"name": "Highfield Gardens",
				"date": "1939",
				"desc": "Probably a descriptive name for a row of houses built in fields above the cutting of the former Bexhill to Crowhurst railway branch line. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Highlands Close",
				"date": "1958",
				"desc": "The Highlands is an area of high ground bordered by Turkey Road, Ninfield Road and Bexhill Cemetery. (Adopted by Borough of Bexhill 3rd January 1962).",
				"adopted": "1962-01-03"
			}, {
				"name": "Highwoods Avenue",
				"date": "1965",
				"desc": "Close to the High Woods; there are records for these woods since at least 1583. (Beech Close and Holly Close are nearby). (Adopted by Borough of Bexhill 11th August 1969).",
				"adopted": "1969-08-11"
			}, {
				"name": "Hillborough Close",
				"date": "c1995",
				"desc": "This close runs through the former back garden of a large detached house called Hillborough House, built in about 1948, which still stands on Little Common Road. (Adopted by East Sussex County Council on an unknown date).",
				"adopted": "unknown"
			}, {
				"name": "Hillcrest Avenue",
				"date": "1936",
				"desc": "Descriptive name for this avenue which runs on the top, or crest, of a hill. (Adopted by Borough of Bexhill, 1st part 28th June 1937 and last part 26th March 1958).",
				"adopted": "1937-06-28;1958-03-26"
			}, {
				"name": "Hillside Road",
				"date": "1924",
				"desc": "Descriptive name for this road which runs along the slope of a hill between London Road and Barrack Road. (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1956).",
				"adopted": "1956"
			}, {
				"name": "Holland Avenue",
				"date": "1929",
				"desc": "According to a tithe map / schedule of 1839 / 1843, Eliza Holland owned four plots of land in this area. They consisted of two meadows, a lodge with yard and a house with attached smithys shop. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Holliers Hill",
				"date": "~1841",
				"desc": "Holliers field was on the east side of this road. Richard Hollier is recorded as living in this area in 1543. The outline of the road can be seen on an Ordnance Survey map 1795 to 1825. (Adopted at an unknown date as a publicly maintainable highway under the 1835 Highways Act).",
				"adopted": "unknown"
			}, {
				"name": "Holly Close",
				"date": "1965",
				"desc": "Holly comprises 400 to 600 species of flowering plants in the genus Ilex. The plants are evergreen and deciduous trees, shrubs or climbers. (Beech Close and Highwoods Avenue are nearby). (Adopted by Borough of Bexhill 11th August 1969).",
				"adopted": "1969-08-11"
			}, {
				"name": "Holm Oak Close",
				"date": "1962",
				"desc": "Holm Oak is a large evergreen oak belonging to the genus Quercus. It is also called the Holly Oak as the word holm is an ancient name for holly. (Adopted by Borough of Bexhill 4th July 1966).",
				"adopted": "1966-07-04"
			}, {
				"name": "Holmesdale Road",
				"date": "1914",
				"desc": "William Pitt Amherst, 2nd Earl Amherst (1805 to 1886) and William Archer Amherst, 3rd Earl Amherst (1836 to 1910) were both given the courtesy title of Viscount Holmesdale. There is also an Amherst Road in Bexhill. (Adopted by Borough of Bexhill 27th November 1933).",
				"adopted": "1933-11-27"
			}, {
				"name": "Homelands Close",
				"date": "1954",
				"desc": "The entrance to this close was built through land belonging to a property called Homeland. Homelands mean a native or familiar land. (There is an interconnecting footpath with Uplands Close). (Adopted by Borough of Bexhill 24th May 1957).",
				"adopted": "1957-05-24"
			}, {
				"name": "Honies Estate",
				"date": "1887",
				"desc": "This estate was bounded approximately by the present-day London Road, Springfield Road, Beaconsfield Road, Holliers Hill and Sedgewick Road. The name is likely to be derived from the surname Honey, usually spelt Hony or Huny, which was fairly common in East Sussex during the Middle Ages, although confined to less well-to-do folk. One such family probably gave its name to that area of Bexhill."
			}, {
				"status": "bygone",
				"name": "Hooe Road",
				"date": "before 1841 to 1917",
				"desc": "Hooe is an ancient name meaning a place at a spur of land. Centuries ago the whole of the local coast was much more indented than it is today. The settlement of Hooe would be on higher ground from the nearby Hooe Level. Some early street directories describe this road as running from the present-day crossroad of Peartree Lane, Turkey Road and Whydown Road to Whydown whereas other street directories have never used this name and have always called this section of road Whydown Road. Regardless of name the outline of the road can be seen on an Ordnance Survey map 1795 to 1825."
			}, {
				"name": "Hornbeam Avenue",
				"date": "2003",
				"desc": "Hornbeams are relatively small hardwood trees belonging to the genus Carpinus. (Alder Gardens, Elm Close, Hazel Grove and Poplar Close are nearby). (Adopted by East Sussex County Council on an unknown date).",
				"adopted": "unknown"
			}, {
				"name": "Howards Crescent",
				"date": "1933",
				"desc": "This crescent takes its name from the former Howard's Lodge and Farm which are recorded on a tithe map / schedule of 1839 / 1843. (Adopted by Borough of Bexhill 24th April 1933).",
				"adopted": "1933-04-24"
			}, {
				"name": "Hunting Close",
				"date": "1961",
				"desc": "The origin of the name remains uncertain. Maybe because this development was built near the site of the Bexhill Harriers' former kennels at Brook Lodge (now The Grange) on Upper Sea Road. They were a pack of the now extinct Southern hound which existed from about 1785 until 1915. The pack was owned until 1891 by the Brook family after which it was acquired by Viscount Cantelupe who had new kennels built at Cooden. (Adopted by Borough of Bexhill 27th September 1961).",
				"adopted": "1961-09-27"
			}, {
				"name": "Hurchington Drive",
				"date": "2015",
				"desc": "Once the lane leading to Hurchington Farm. The name Yrchington Farm can be seen in records as far back as 1567."
			}, {
				"name": "Hurstwood Close",
				"date": "after 1974 but before 1998",
				"desc": "High Hurstwood is a village in East Sussex, 3 miles north-east of Uckfield. (Adopted by East Sussex County Council on an unknown date).",
				"adopted": "unknown"
			}, {
				"name": "Ian Close",
				"date": "1968",
				"desc": "Family forename of one of the developers surnames, Davey-Casselden Limited. This road was called Ian Crescent between 1968 and 1970. (Allen Way, Amanda Close, Angela Close, Christine Close, Diana Close, Gwyneth Grove and Lesley Close are nearby). (Date of adoption by Borough of Bexhill or later East Sussex County Council not known).",
				"adopted": "unknown"
			}, {
				"status": "bygone",
				"name": "Ingram Road",
				"date": "1902 to c1945",
				"desc": "Road linking Preston Road to the top of North Road but whose precise location remains uncertain."
			}, {
				"name": "Ingrams Avenue",
				"date": "1949",
				"desc": "Built on the site of Ingrams Farm which was originally part of the Manor of Ninfield. The name is derived from Robert and Andrew Ingeram as the first holders of land in Ninfield at the end of 13th century. (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1956).",
				"adopted": "1956"
			}, {
				"name": "Jacobs Acre",
				"date": "after 1974 but before 1998",
				"desc": "The origin of the name remains uncertain. Maybe relates to a Jacob Russell who, according to a tithe map / schedule of 1839 / 1843, occupied, with Thomas Winborn, a plot of land close to the site of the present-day Bexhill Leisure Centre. That plot of land was owned by the Parish Officers of Bexhill. Also Jacobs Acre occupies land which was formerly part of the Kings German Legion's barrack grounds, including a small burial ground. Later this land was close to the site of the town's first formally established school, St Peters, in 1853 as well as allotment gardens which are shown on an Ordnance Survey map of 1909. (Adopted by East Sussex County Council on an unknown date).",
				"adopted": "unknown"
			}, {
				"name": "James Walk",
				"date": "2009",
				"desc": "Leads to the front of St James House which was a convent, children's home and school run by the Sisters of Nazareth. There are two statues outside the building; one is St James, the other the Virgin Mary. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Jameson Mews",
				"date": "1897",
				"desc": "Probable a corruption of the name Jamestown. Thomas West, 3rd Baron De La Warr, brought food to the starving inhabitants of Jamestown, Virginia, USA. Later he was appointed Governor and Captain-General of the colony of Virginia in 1610 and died there in 1618. The state of Delaware, one of the 13 founding-members of the United States of America, is named after him. (This road had not been adopted by East Sussex County Council by December 2020)."
			}, {
				"name": "Jameson Road",
				"date": "1897",
				"desc": "Probable a corruption of the name Jamestown. Thomas West, 3rd Baron De La Warr, brought food to the starving inhabitants of Jamestown, Virginia, USA. Later he was appointed Governor and Captain-General of the colony of Virginia in 1610 and died there in 1618. The state of Delaware, one of the 13 founding-members of the United States of America, is named after him. (Adopted by Borough of Bexhill 26th September 1904).",
				"adopted": "1904-09-26"
			}, {
				"name": "Jarvis Brook Close",
				"date": "c1975",
				"desc": "Village in East Sussex, 2 miles east of Crowborough. (Adopted by East Sussex County Council on an unknown date).",
				"adopted": "unknown"
			}, {
				"name": "Jasmine Way",
				"date": "2002",
				"desc": "Jasmines are shrubs and vines belonging to the genus Jasminus. There are around 200 species and the plants are widely cultivated for the characteristic fragrance of their flowers. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Jevington Close",
				"date": "1967",
				"desc": "Village in East Sussex, 1 mile south of Polegate. (Adopted by Borough of Bexhill 6th November 1967).",
				"adopted": "1967-11-06"
			}, {
				"name": "Jubilee Road",
				"date": "1952",
				"desc": "Built at the time of the Golden Jubilee of the Charter of Incorporation of the Borough of Bexhill (1902 to 1952). It is thought that the original name proposed for this road was Charter Grove. (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1966).",
				"adopted": "1966"
			}, {
				"name": "Juniper Place",
				"date": "2020",
				"desc": "Junipers are coniferous trees and shrubs in the genus Juniperus of the cypress family Cupressaceae. Their berries are often used as the main ingredient in gin."
			}, {
				"name": "Kennedy Road",
				"date": "1968",
				"desc": "The origin of the name remains uncertain. Maybe relates to John Fitzgerald Kennedy (1917 to 1963), 35th President of the United States from 1961 to 1963. (Adopted by Borough of Bexhill 2nd November 1970).",
				"adopted": "1970-11-02"
			}, {
				"name": "Kennel Lane",
				"date": "1926",
				"desc": "Close to the Little Common site of the old kennels of the Bexhill Harriers, a pack of now extinct Southern hounds. The kennels were built in 1891 by Viscount Cantelupe and although the lane is now mainly an unmade footpath, part of it still forms a section of Meads Avenue. (Old Harrier Close is nearby). (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Kent Close",
				"date": "1938",
				"desc": "Prince George, Duke of Kent (1902 to 1942) was the fourth son of King George V. (Gloucester Avenue and York Road are nearby). (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Kenton Close",
				"date": "1963",
				"desc": "The origin of the name remains unknown. There are four towns or villages around the United Kingdom called Kenton but none are in the south-east of England. (Adopted by Borough of Bexhill 21st December 1964).",
				"adopted": "1964-12-21"
			}, {
				"name": "Kestrel Close",
				"date": "after 1974 but before 1995",
				"desc": "Kestrels are birds of prey belonging to the falcon (Falco) family. (Adopted by East Sussex County Council on an unknown date).",
				"adopted": "unknown"
			}, {
				"name": "Kewhurst Avenue",
				"date": "1926",
				"desc": "Built on land forming part of Kewhurst farmland. The name means Caega's enclosure and in 1306 was spelt Kayworth. The present-day Kewhurst Manor was built in 1895 and converted to flats in 1955. (Adopted by Borough of Bexhill 19th December 1967).",
				"adopted": "1967-12-19"
			}, {
				"name": "King Offa Way",
				"date": "1980",
				"desc": "King Offa ruled Mercia for 39 years from 757 until his death in 796; he also controlled much of Kent and Sussex. King Offa's Charter of 772 AD granted land in Bexhill and is the first recorded reference to the town. (Adopted at an unknown date as a publicly maintainable highway [Trunk Road] under the 1835 Highways Act).",
				"adopted": "unknown"
			}, {
				"name": "Kingfisher Close",
				"date": "2012",
				"desc": "Kingfishers are a group of small to medium sized brightly coloured birds in the order Coraciiformes. They are often found near rivers and lakes and this development is by the side of Waller's Haven river. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Kings Close",
				"date": "1939",
				"desc": "The origin of the name is uncertain but may refer to this development taking place early in King George VI's reign which began in 1936. (Adopted by Borough of Bexhill 24th April 1963).",
				"adopted": "1963-04-24"
			}, {
				"name": "Kingswood Avenue",
				"date": "1939",
				"desc": "Kingswood Builders Ltd was a local company involved in house building during the 1930s. (Adopted by Borough of Bexhill 27th June 1956).",
				"adopted": "1956-06-27"
			}, {
				"name": "Kinver Lane",
				"date": "1938",
				"desc": "The origin of the name remains unknown. Originally, Kinver Lane ran from Martyns Way to Pebsham Lane before Mistley Close was developed. (Date of adoption by Borough of Bexhill or later East Sussex County Council not known).",
				"adopted": "unknown"
			}, {
				"name": "Kites Nest Walk",
				"date": "1999",
				"desc": "Kites Nest Wood and the site of the former Kites Nest Farm lie to the north of this walk. The name was recorded as Keteneste in 1535. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Knebworth Road",
				"date": "1911",
				"desc": "The origin of the name remains unknown. Knebworth is the name of a large country house and town in Hertfordshire but no obvious connection to Bexhill has yet been identified. (Adopted by Borough of Bexhill 30th November 1925)."
			}, {
				"name": "Knole Road",
				"date": "1896",
				"desc": "Small village in Kent on the eastern edge of Sevenoaks. Knole is the ancestral home of the Sackville family. The Estate was given by Queen Elizabeth I to Sir Thomas Sackville in 1566. (Adopted by Borough of Bexhill 29th January 1912)."
			}, {
				"name": "Laburnum Gardens",
				"date": "1958",
				"desc": "Laburnum, also known as the golden chain tree, is a deciduous tree with characteristic yellow flowers belonging to the Laburnum genus. (Cherry Tree, Maytree and Rowan Gardens are nearby). (Adopted by Borough of Bexhill 27th March 1963)."
			}, {
				"name": "Lake House Close",
				"date": "c1996",
				"desc": "Lake House School was originally established in about 1898 by Mr Bond on the Woodsgate Park estate as an independent preparatory school for the sons of gentlemen. There was a lake on that estate to the north of a property called Lake House. The school transferred to Collington Lane West in 1902. It was taken over by Mr Knott and renamed Beechmont in 1929 but the school did not reopen after World War Two. Later the building was used as the headquarters of the Girls Life Brigade. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Lakelands Drive",
				"date": "1973",
				"desc": "Descriptive name linked to the former nearby Lake House School. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Landsdowne Way",
				"date": "after 1985 but before 1997",
				"desc": "The Marquess of Lansdowne (1845 to 1927) was a British politician and Irish peer. Amongst his many appointments he was Governor General of Canada, Viceroy of India and senior politician in both Liberal and Conservative governments. An error on the development plan misspelt his name adding an extra D. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Langley Close",
				"date": "1969",
				"desc": "Langley Green is a suburb of Crawley, West Sussex. (Adopted by Borough of Bexhill 16th August 1971)."
			}, {
				"name": "Larkhill",
				"date": "1972",
				"desc": "The origin of the name remains uncertain. R A Larkin and Bros Ltd were major developers and house builders in Bexhill between 1924 to 1988. They developed this road and as the houses are built along a hillside then maybe this is a made-up name combining Larkin and hill. Alternatively, larks are small to medium sized perching birds of the family Alaudidae, noted for their extravagant songs. Maybe in the past they were a common sight in this hilly area. Finally, Larkhill is a long-established garrison town on Salisbury Plain near Durrington, Wiltshire, but any possible link to Bexhill has not yet been established. (Date of adoption by Borough of Bexhill or later East Sussex County Council not known)."
			}, {
				"name": "Lavant Close",
				"date": "1970",
				"desc": "East, Mid and West Lavant are villages in West Sussex, 2 miles north of Chichester. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Leasingham Gardens",
				"date": "1932",
				"desc": "R A Larkin and Bros Ltd were major developers and house builders in Bexhill between 1924 to 1988. At the start of the First World War, Reginald Arthur Larkin joined the Royal Naval Air Service which later amalgamated with the Royal Flying Corps to create, in 1918, the Royal Air Force. The RAF's training headquarters was established at Cranwell, Lincolnshire, where they remain to this day. Leasingham is a village 3 miles to the east of RAF College (Cranwell). After moving to Bexhill, Reg Larkin named his early home in Gunters Lane Cranwell before transferring the firm's headquarters to Woodsgate Place. (Adopted by Borough of Bexhill 23rd May 1932)."
			}, {
				"name": "Leopold Road",
				"date": "1897",
				"desc": "Prince Leopold, Duke of Albany (1853 to 1884) was the eighth child and fourth son of Queen Victoria and Prince Albert. There is also an Albany Road in Bexhill. (Adopted by Borough of Bexhill 26th September 1904)."
			}, {
				"name": "Lesley Close",
				"date": "1964",
				"desc": "Family forename of one of the developers surnames, Davey-Casselden Limited. Street directories in the early 1960s call this road Leslie Close. (Allen Way, Amanda Close, Angela Close, Christine Close, Diana Close, Gwyneth Grove and Ian Close are nearby). (Adopted by Borough of Bexhill 1st May 1967)."
			}, {
				"name": "Levetts Wood",
				"date": "2019",
				"desc": "A wood of this name is located north of Sidley, originally part of Ingrams Farm where Daniel Levett was a tenant 1727-1738."
			}, {
				"name": "Lewes Close",
				"date": "1962",
				"desc": "County town of East Sussex. (Adopted by Borough of Bexhill 15th March 1965)."
			}, {
				"name": "Lewis Avenue",
				"date": "tramway 1906; name c1990",
				"desc": "The origin of the name remains unknown. This avenue was part of the route taken by the Hastings Tramways between Bexhill and Hastings, a service which began on 9th April 1906 and ended during 1929. Maybe Lewis is a surname connected to the history of the tramways. At present a short section of this avenue leading east from De La Warr Road is tarmacked, the avenue then becomes a rough track over the Pebsham fields towards Bexhill Road where there is another short tarmacked section near the entrance to Hastings Household Waste site. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Linden Road",
				"date": "1893",
				"desc": "John Webb (1840 to 1922) was a surveyor and builder from Brockley, a district of south London located in the Borough of Lewisham. Mr Webb was responsible for developing much of the land south of the railway between Sea Road and the Polegrove. Linden Grove is a major road through Southwark, in the Borough of Lewisham, south of Brockley. Many early roads, especially in London, are named after trees and the linden tree is another name for a lime-tree. (Adopted by Borough of Bexhill 21st November 1898)."
			}, {
				"name": "Links Drive",
				"date": "1968",
				"desc": "This drive is built near the former Bexhill Golf Club course on Galley Hill and the adjacent land north of the railway line. (Gleneagles Close and Sunningdale Close are nearby). (Adopted by Borough of Bexhill, 1st part 2nd November 1970, 2nd part 8th November 1971 and last part 30th April 1973)."
			}, {
				"name": "Linley Close",
				"date": "1964",
				"desc": "The origin of the name remains uncertain. Maybe relates to Viscount Linley, born 3rd November 1961, the son of Princess Margaret and Antony Armstrong-Jones, 1st Earl of Snowden. (Adopted by Borough of Bexhill 27th September 1965)."
			}, {
				"name": "Lionel Road",
				"date": "1901",
				"desc": "In memory of Lionel Charles Cranford Sackville (1868 to 1890), eldest son of 7th Earl De La Warr, who drowned whilst yachting on Belfast Lough. Lionel was also a forename of 7th Earl and 1st Duke of Dorset (1688 to 1765). A map of 1900 records this road as Russell Grove. (Adopted by Borough of Bexhill 26th July 1926)."
			}, {
				"name": "Little Common Road",
				"date": "road ~1841; name 1910",
				"desc": "Little Common takes its name from a triangular common including, and slightly larger than, the area between Green Lane and Lower Peartree Lane; at its apex is the Picknill Stream and at its base the present-day A259. Originally this was the road leading from Bexhill Old Town to and from Little Common. The part from near White Hill Avenue to the Little Common roundabout was previously known as Church Hill (Road). The section around the present-day Denbigh Hotel and the former Hurchington estate was previously known as Whitehill as well as Whitehill Lane. The outline of the whole road can be seen on an Ordnance Survey map 1795 to 1825. Beaconsfield Terrace, built around 1880 and Congressbury Terrace, probably built a few years later, on either side of the present-day Chandler Road, feature as a street address in census and street directories of that time. The Down Arch (previously known as the South Eastern Railway bridge) which carried the railway branch line from Crowhurst to Bexhill over this road where it meets London Road was demolished in 1967. (Adopted at an unknown date as a publicly maintainable highway [Trunk Road] under the 1835 Highways Act)."
			}, {
				"name": "Little Twitten",
				"date": "1926",
				"desc": "Twitten is a Sussex dialect word for a narrow path between two walls or hedges. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "London Road",
				"date": "road ~1881; name 1930",
				"desc": "The main road leading north from the centre of town towards London. The section between Buckhurst Place and the crossroads with King Offa Way and Little Common Road was previously called Russells Lane then Station Road then Lower Station Road before becoming part of present-day London Road in 1930. The section between the present-day crossroads with King Offa Way and Little Common Road extending to Sidley was previously called Station Road North then various sections were added named Alexandra Road, North Street, Sandhurst Road and Spa Road before becoming part of the completed present-day London Road in 1930. (Adopted by Borough of Bexhill, 1st part 21st November 1898 and last part 29th March 1944. Also adopted at an unknown date as a publicly maintainable highway under the 1835 Highways Act). (Foot passage to west of London Road and south of Victoria Road running from Victoria Road towards Buckhurst Place (but not a thoroughfare), serving Windsor Road and London Road residences, adopted by Borough of Bexhill 20th December 1909)."
			}, {
				"name": "Long Avenue",
				"date": "1932",
				"desc": "Probably a descriptive name for one of the original roads to be built in Pebsham. On maps up to the early 1950s Long Avenue is shown at about twice its present-day length because it included that part of the present-day Martyns Way from Seabourne Road to Cuckfield Close. (Adopted by Borough of Bexhill 29th June 1970)."
			}, {
				"status": "bygone",
				"name": "Lower Dorset Road",
				"date": "1899 to 1906",
				"desc": "This road ran from the present-day De La Warr Parade to De La Warr Road. (Please see Dorset Roads {1}, {2} and {3} as well as Upper Dorset Road)."
			}, {
				"name": "Lower Marine Parade",
				"date": "before 1893",
				"desc": "Recorded on an 1893 map as part of the present-day West Parade."
			}, {
				"name": "Lower Peartree Lane",
				"date": "road ~1841; name 1928",
				"desc": "Name sometimes used to describe Peartree Lane from Little Common roundabout (A259) to the Turkey Road and Whydown Road crossroads. It was previously called Kiln Bank or Over Kiln Bank. The outline of the lane can be seen on an Ordnance Survey map 1795 to 1825. (Adopted at an unknown date as a publicly maintainable highway under the 1835 Highways Act)."
			}, {
				"name": "Lower Sea Road",
				"date": "road before 1841; name 1899",
				"desc": "In about 1899 the original Sea Road {1} was divided into two parts; Sea Road {2} and Upper Sea Road. Sea Road {2} runs from the present-day De La Warr Parade to Station Road. Some street directories called this section of road Lower Sea Road from about 1899 to about 1917 although that name is rarely seen on maps. (Please see Sea Roads {1} and {2} and Upper Sea Road)."
			}, {
				"status": "bygone",
				"name": "Lower Station Road",
				"date": "road c1850; name 1899 to 1930",
				"desc": "The road between Buckhurst Place and the crossroads with King Offa Way. It was previously known as Russells Lane then Station Roads {1} and {2} and is now part of London Road. (See also Upper Station Road and Station Roads {1} {2} {3})."
			}, {
				"name": "Loxwood Close",
				"date": "1972",
				"desc": "Village in West Sussex, 5 miles north-west of Billingshurst. (Date of adoption by Borough of Bexhill or later by East Sussex County Council not known)."
			}, {
				"name": "Luffield Drive",
				"date": "2020",
				"desc": "Luffield Corner is turn seven at Silverstone racing circuit, Northamptonshire. It takes its name from Luffield Abbey, the remains of which were found near to the corner. (Becketts Close, Brooklands Road, Cascades Way, Clervaux Close, Druids Close, Gracelands Drive, Paddock Way and Woodcote Way are nearby)."
			}, {
				"name": "Lullington Close",
				"date": "c1995",
				"desc": "Hamlet near Alfriston in East Sussex. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Lunsford Cross",
				"date": "1547",
				"desc": "The name was being used in this area by 1547 and is likely to be derived from someone whose family belonged to Lundsford Farm near Etchingham, East Sussex. Probably connected with this family was Colonel Sir Thomas Lunsford (1611 to 1656) whose own family lived at nearby Old Whyly Manor, East Hoathly. He fought on the King's side during the Civil War at the battle of Edgehill in 1642. Today the name refers to the area at the crossroads of Ninfield Road, Potman's Lane and Peartree Lane. Near this crossroads are the present-day Lunsford Manor and Lunsford Cross Farm."
			}, {
				"name": "Lychgates Close",
				"date": "1972",
				"desc": "A lychgate is a roofed churchyard gate. This close is adjacent to St Peter's Church, Bexhill Old Town. (Church Vale Road, Rectory Way and St Peter's Crescent are nearby). (Date of adoption by Borough of Bexhill or later East Sussex County Council not known)."
			}, {
				"name": "Magdalen Road",
				"date": "1898",
				"desc": "St Mary Magdalene's clergy and school-house was established on the corner of this road and Sea Road in 1891; the present church opened in 1907. (Adopted at an unknown date as a publicly maintainable highway under the 1835 Highways Act)."
			}, {
				"name": "Magpie Close",
				"date": "after 1974 but before 1995",
				"desc": "Magpies are birds of the genus Pica and usually have long tails and predominately black and white markings. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"status": "bygone",
				"name": "Manor Lane",
				"date": "1905 to 1938",
				"desc": "Built in the grounds of the former Bexhill Manor House and Manor Farm. Probably had few properties built along this lane until it was developed as Chelsea Close. Old Manor Close and the former Manor Lane follow the route of an old drove road from Court Lodge Farm down to the former salt-marsh grazing fields near the sea."
			}, {
				"name": "Manor Road",
				"date": "1899",
				"desc": "Built in the grounds of the former Bexhill Manor House and Manor Farm. Probably had few properties built along this lane until it was developed as Chelsea Close. Old Manor Close and the former Manor Lane follow the route of an old drove road from Court Lodge Farm down to the former salt-marsh grazing fields near the sea. Also included present-day Bridge Road until that name adopted in about 2000. (Adopted by Borough of Bexhill 24th July 1922)."
			}, {
				"name": "Mansell Close",
				"date": "after 1974 but before 1997",
				"desc": "Mansell House Lodge was situated near the entrance to this close. Originally the building was the lodge for the Little Folks Home then later became a convalescent home for short holidays by mentally handicapped patients from Leybourne Grange, near Maidstone in Kent where Sister Mansell was one of the matrons. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Maple Avenue",
				"date": "1937",
				"desc": "Maple trees and shrubs belong to the Acer genus. The maple leaf is the most widely recognised national symbol of Canada. Canadian troops were stationed in Cooden during both World Wars. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Maple Close",
				"date": "road 1936; name 1940",
				"desc": "Maple trees and shrubs belong to the Acer genus. The maple leaf is the most widely recognised national symbol of Canada. Canadian troops were stationed in Cooden during both World Wars. Previously known as Maple Drive. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"status": "bygone",
				"name": "Maple Drive",
				"date": "1936 to 1939",
				"desc": "Originally called a drive, maybe there was an intention to link Maple Avenue with Clavering Walk. However, this road's layout and name changed to a close in about 1940 although Maple Drive has been seen recorded on a town map as late as 1956."
			}, {
				"name": "Maple Walk",
				"date": "1924",
				"desc": "Maple trees and shrubs belong to the Acer genus. The maple leaf is the most widely recognised national symbol of Canada. Canadian troops were stationed in Cooden during both World Wars. (Date of adoption by Borough of Bexhill or later East Sussex County Council not known)."
			}, {
				"name": "Marina",
				"date": "1886",
				"desc": "Descriptive name from the road's position on the seafront. Although the present-day road is from the Sackville Road roundabout to Sea Road, earlier street directories describe Marina as from Cornwall Road to Sackville Hotel (Middlesex Road) (1891 to 93), Egerton Park to Sackville Hotel (1894 to 98), Sackville Road to Sackville Hotel (1899) and Sackville Road to golf links (bottom of Galley Hill) (1900 to 06). Between about 1900 and 1930 the names Marine Parade or Marine Promenade were also used in street directories or on maps instead of Marina. From about 1900 De La Warr Parade is often included as part of Marina but not as a specifically named section of road until about 1945. (Adopted at an unknown date as a publicly maintainable highway under the 1835 Highways Act)."
			}, {
				"name": "Marina Arcade",
				"date": "1901",
				"desc": "Descriptive name from the road's position on the seafront. Although the present-day road is from the Sackville Road roundabout to Sea Road, earlier street directories describe Marina as from Cornwall Road to Sackville Hotel (Middlesex Road) (1891 to 93), Egerton Park to Sackville Hotel (1894 to 98), Sackville Road to Sackville Hotel (1899) and Sackville Road to golf links (bottom of Galley Hill) (1900 to 06). Now a paved footpath adjacent to a row of premises which include a former library, gift shop, photographic studio and tea rooms. Previous names include The Arcade and Bazaar as well as Marine Arcade and Bazaar (1906)."
			}, {
				"name": "Marina Court Avenue",
				"date": "1902",
				"desc": "Marina Court was a large apartment block, opened in 1901, adjacent to this avenue. The building was demolished in 1970 to extend the De La Warr Pavilion's car park. (Adopted by Borough of Bexhill 29th January 1912)."
			}, {
				"name": "Marine Crescent",
				"date": "1950",
				"desc": "Descriptive name for a curving street built on a tract of grassland beside a stream. This development covers part of the fields to the south of the former Ingram's Farm. (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1956)."
			}, {
				"status": "bygone",
				"name": "Marine Parade",
				"date": "road c1890; name 1898 to 1923",
				"desc": "Descriptive name from the road's position on the seafront. Originally known as Park Crescent then Marine Crescent and now known as West Parade, it is that part of the road from the Marina roundabout along the seafront to Park Road."
			}, {
				"status": "bygone",
				"name": "Marine Promenade",
				"date": "road 1887; name 1903 to c1930",
				"desc": "See entry for Marine Parade."
			}, {
				"name": "Marsh Road",
				"date": "1933",
				"desc": "The A259 road as it runs across the marshes of Pevensey Levels from Bexhill to Pevensey. The road's construction was in part a job creation scheme during the Great Depression (1924 to 1934). (Adopted after 1933 as a publicly maintainable highway [Trunk Road] under the 1835 Highways Act)."
			}, {
				"name": "Martlets",
				"date": "1972",
				"desc": "Martlet is a heraldic charge depicting a stylised bird similar to a swift or swallow. The county shield of Sussex contains six martlets said to represent the six traditional rapes (administrative sub-divisions) of the county of which Hastings was one. (Adopted by Borough of Bexhill 30th April 1973)."
			}, {
				"name": "Martyns Way",
				"date": "1937",
				"desc": "The origin of the name remains uncertain but the place-name Martin is derived from Old English meaning a farmstead near a boundary or by a pool. This road is built over farmland belonging to Glyne Manor Farm and, when completed, the eastern end of the road finished at the former Bexhill Borough Council's boundary with Hastings. The section of the present-day road from Seabourne Road to Cuckfield Close was previously considered part of Long Avenue. (Adopted by Borough of Bexhill 28th April 1969)."
			}, {
				"name": "Mayfair Mews",
				"date": "1999",
				"desc": "These mews were developed by the Park Lane Group. Park Lane is a major road in central London and to the east of that road is Mayfair, an important area also in central London. Originally a mews was a street or yard of stables often converted into dwelling-houses or garages. The name is often used now for a small modern development of houses either as a terrace or around a court-yard. At present no past links to horses or livery stables in this area have been identified. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Mayfield Way",
				"date": "1963",
				"desc": "Village in East Sussex, 10 miles south of Tunbridge Wells. (Adopted by Borough of Bexhill 24th July 1963)."
			}, {
				"name": "Mayo Lane",
				"date": "road ~1841; name 1924",
				"desc": "On land forming part of Mayo Farm, owned by Henry Mayo in the late 18th and early 19th centuries. The outline of the lane can be seen on an Ordnance Survey map 1795 to 1825. (Taken over as a Public Highway by the Local Board of Bexhill in 1884)."
			}, {
				"name": "Mayo Rise",
				"date": "1937",
				"desc": "On land forming part of Mayo Farm, owned by Henry Mayo in the late 18th and early 19th centuries. The outline of the lane can be seen on an Ordnance Survey map 1795 to 1825. Built along a gentle slope away from Ninfield Road and close to Mayo Lane. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Maytree Gardens",
				"date": "1958",
				"desc": "The may is a tree or shrub belonging to the Crataegus genus. It has many alternative names including mayblossum, maythorn, quickthorn, whitethorn, motherdie, haw and common hawthorn. Its small white flowers in late spring and red berries (haw) in autumn are a common sight in our hedgerows. (Cherry Tree, Laburnum and Rowan Gardens are nearby). (Adopted by Borough of Bexhill 4th January 1961)."
			}, {
				"name": "Meadow Crescent",
				"date": "1950",
				"desc": "Descriptive name for a curving street built on a tract of grassland beside a stream. This development covers part of the fields to the south of the former Ingram's Farm. (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1956)."
			}, {
				"name": "Meads Avenue",
				"date": "1925",
				"desc": "Meads is an area at the westerly end of Eastbourne, East Sussex. The hamlet of Meads had already been established by the late 1700s and from 1872 onwards the estate was developed on behalf of the 7th Duke of Devonshire with wide, well ordered, tree-lined roads, brick pavements and flint and stone walls. Meads Avenue now incorporates part of Kennel Lane. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Meads Road",
				"date": "1906",
				"desc": "Meads is an area at the westerly end of Eastbourne, East Sussex. The hamlet of Meads had already been established by the late 1700s and from 1872 onwards the estate was developed on behalf of the 7th Duke of Devonshire with wide, well ordered, tree-lined roads, brick pavements and flint and stone walls. (Adopted by Borough of Bexhill 24th July 1957)."
			}, {
				"name": "Middlesex Road",
				"date": "1890",
				"desc": "Charles Sackville, 6th Earl of Dorset (1638 to 1706), was created Earl of Middlesex and Baron Cranfield by King Charles II in 1675. (Adopted by Borough of Bexhill 26th September 1904)."
			}, {
				"name": "Mill View Road",
				"date": "1926",
				"desc": "The Down or Hoad's Mill on Gunters Lane, as well as a number of Sidley's former windmills, Black Mill, Mount Idle (sic) Mill, Pankhurst Mill and Putlands Mill could probably have been seen from here. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Milland Close",
				"date": "1968",
				"desc": "Village in West Sussex, 6 miles north-east of Petersfield. (Adopted by Borough of Bexhill 22nd September 1969)."
			}, {
				"name": "Millfield Rise",
				"date": "1940",
				"desc": "The land to the east of the road built on rising land away from Mitten Road was called Mill Field. Before the 18th century there was a windmill on Belle Hill near the house now called Millfield. (Adopted by Borough of Bexhill 24th April 1963)."
			}, {
				"name": "Millwood Road",
				"date": "1972",
				"desc": "Mill Wood just to the north of this road forms part of The Highlands. (Date of adoption by Borough of Bexhill or later East Sussex County Council not known)."
			}, {
				"name": "Minsted Square",
				"date": "1964",
				"desc": "Village in West Sussex, 2 miles west of Midhurst. (Adopted by Borough of Bexhill 30th January 1967)."
			}, {
				"name": "Mistley Close",
				"date": "after 1974 but before 1996",
				"desc": "Leslie Graves owned Mistley Nursery which was situated behind his home in Pebsham Lane. When he sold it for development, probably in the 1980s, he stipulated that the new development should be called Mistley Close as a reminder of the nursery which itself was named after Mistley, a small village near Manningtree, Essex. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Mitten Road",
				"date": "1898",
				"desc": "According to a tithe map / schedule of 1839 / 1843 there was a field called Mitten's Mead close to where this road was developed. Mead is another name for a meadow. (Adopted by Borough of Bexhill 23rd December 1907)."
			}, {
				"status": "bygone",
				"name": "Modest Lane",
				"date": "c1890 to c1895",
				"desc": "Track in Sidley leading to Ingrams, Woods and Glovers Farms; now part of Glovers Lane."
			}, {
				"name": "Monks Way",
				"date": "C13",
				"desc": "A footpath leading towards the former St. Mary's Chapel of Bulverhythe."
			}, {
				"name": "Monterey Close",
				"date": "1972",
				"desc": "R A Larkin and Bros Ltd were major developers and house builders in Bexhill between 1924 to 1988. Monterey Bay along the Pacific coast of central California was one of the Larkin family's holiday destinations. Also on this bay is Carmel-by-the-Sea. (Carmel Close is nearby). (Date of adoption by Borough of Bexhill or later East Sussex County Council not known)."
			}, {
				"name": "Monterey Gardens",
				"date": "1970",
				"desc": "R A Larkin and Bros Ltd were major developers and house builders in Bexhill between 1924 to 1988. Monterey Bay along the Pacific coast of central California was one of the Larkin family's holiday destinations. (Date of adoption by Borough of Bexhill or later East Sussex County Council not known)."
			}, {
				"name": "Morgan Close",
				"date": "after 1974 but before 1997",
				"desc": "Councillor Harold George Morgan was the last Bexhill Borough Mayor, 1973 to 1974. (Cooper Drive is nearby). (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Mount Idol View",
				"date": "1952",
				"desc": "Mount Idle (sic) was one of the names on a list of Sidley windmills published in a Sussex magazine in the 1930s which were later used to name various roads. These are the nearby Blackmill Close, Pankhurst Close and Rise and Putlands Crescent. Previously spelt Mount Idle, this area of raised land to the north of Sidley is shown on an Ordnance Survey map of 1795 to 1825. (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1966)."
			}, {
				"name": "Mount Pleasant",
				"date": "early 1800s",
				"desc": "Area along present-day Ninfield Road between Lunsford Cross and Freezeland Lane. Probably a descriptive name for an area of elevated land which is considered to be agreeable as a place of residence. Highlands was an earlier name for this area."
			}, {
				"name": "Mount View Street",
				"date": "2015",
				"desc": "The Mount is a topographic name for the hill west of this road. The hill can be found on early Ordnance Survey maps and referenced as Mount Field on the 1839 Bexhill Tithe. Today used as an underground reservoir and a communications mast."
			}, {
				"name": "Mulberry Close",
				"date": "after 1974 but before 1995",
				"desc": "Mulberries are deciduous trees belonging to the Morus genus. (Aspen Way and Spindlewood Drive are nearby). (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Nazareth Close",
				"date": "2007",
				"desc": "Near to the former Nazareth House which opened in 1894. This was a home for the elderly, the poor and orphaned girls run by the Sisters of Nazareth. An east wing was added in 1937 which subsequently housed the junior school run by the Sisters which moved in 1961 from its Magdalen Road site. The former Nazareth House, now called “The Chapel”, is Grade II listed and has been converted into residential accommodation. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Nazareth Gardens",
				"date": "2012",
				"desc": "Near to the former Nazareth House which opened in 1894. This was a home for the elderly, the poor and orphaned girls run by the Sisters of Nazareth. An east wing was added in 1937 which subsequently housed the junior school run by the Sisters which moved in 1961 from its Magdalen Road site. The former Nazareth House, now called “The Chapel”, is Grade II listed and has been converted into residential accommodation. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "New Park Avenue",
				"date": "1939",
				"desc": "Built in the grounds or park of Millfield, the late Regency home of Samuel Scrivens, a wealthy landowner. (Millfield Rise is nearby). (Adopted by Borough of Bexhill 24th April 1963)."
			}, {
				"name": "Newlands Avenue",
				"date": "1937",
				"desc": "On land formerly belonging to Newlands Farm which later combined with Woodsgate Farm. There was also a Newlands Cottage on The Down in 1889 and six such named cottages on Gunters Lane by 1909. There was a nearby road called The Newlands between 1905 and 1929. On some early maps the area covered by this avenue is called St Georges Road. (Adopted by Borough of Bexhill 25th November 1953)."
			}, {
				"name": "Nickles Close",
				"date": "2019",
				"desc": "The entrance of the estate where Broolands Road joins with Barnhorn Road was once a field known as Nickles as shown on the Tithe map of 1839."
			}, {
				"name": "Ninfield Road",
				"date": "road ~1841; name 1895",
				"desc": "Village in East Sussex, 4 miles north of Bexhill. This is the main road between Sidley, a district in the north of Bexhill, and Ninfield. The outline of the road can be seen on an Ordnance Survey map 1795 to 1825. (Adopted at an unknown date as a publicly maintainable highway under the 1835 Highways Act)."
			}, {
				"name": "Norfolk Close",
				"date": "1965",
				"desc": "English county in East Anglia. (Suffolk Road is nearby and was built a few years before Norfolk Road). (Adopted by Borough of Bexhill, 1st part 11th March 1968 and last part 26th June 1972)."
			}, {
				"status": "bygone",
				"name": "Norfolk Road",
				"date": "1902 to 1917",
				"desc": "Road linking the northern side of Preston Road to North Road. The road was never fully developed but its route was probably similar to the present-day Norfolk Close. However, Norfolk Road was open at both ends whereas the present-day Norfolk Close is a cul-de-sac."
			}, {
				"name": "Normandale",
				"date": "1973",
				"desc": "Near here the former independent school called Normandale Preparatory School for Boys was opened in 1911. The school had originally been opened in 1905 by Mr Salmon in Dorset Road. It amalgamated with its neighbouring school, Harewood, in 1963 before finally closing in 1971. (Harewood Close is nearby). (Date of adoption by Borough of Bexhill or later East Sussex County Council not known)."
			}, {
				"name": "Normans Bay Road",
				"date": "1905",
				"desc": "Normans are natives or inhabitants of Normandy, France, who conquered England in 1066. This area was previously called Pevensey Sluice but renamed Normans Bay when the railway halt of that name was first opened in 1905."
			}, {
				"name": "North Road",
				"date": "1899",
				"desc": "Descriptive name for this road which mainly runs north from Glovers Lane to Preston Road. It probably includes part of a road previously known as Ingram Road. (Adopted by Borough of Bexhill 23rd December 1907). (Foot passage between North Road and Sidley Street adopted by Borough of Bexhill 30th January 1939)."
			}, {
				"name": "North Street",
				"date": "road 1889; name c1908",
				"desc": "Previously known as Station Road North, this street was replaced by the current London Road from about the King Offa Way crossroads to just beyond Salisbury Road. This section of road was also known as Slopers Island in reference to the homeless people who camped out there."
			}, {
				"name": "Northcliffe",
				"date": "2013",
				"desc": "Alfred Charles William Harmsworth, 1st Viscount Northcliffe (1865 to 1922) was a British newspaper and publishing magnate. He did much to popularise motoring and was a competitor in the 1902 motor races held along East Parade. His brother, Sir Robert Leicester Harmsworth (1870 to 1937) and his family lived at the Manor House in Bexhill Old Town, although usually only for holidays, from 1912 until the death of Lady Harmsworth in 1963. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"status": "bygone",
				"name": "Northeye Close",
				"date": "1960 to 1971",
				"desc": "A former medieval farming village from 1229 to 1515, it stood on the northern part of Hooe Level between Norman's Bay and the higher ground of Barnhorn. Northeye became abandoned when a storm destroyed the villages' crops. Only the buried foundations of The Chapel of St James remain. A related Southeye can be seen close by, now called Rockhouse Bank."
			}, {
				"name": "Oak Road",
				"date": "c1996",
				"desc": "Descriptive name for a clearing in a wood or woodland of oak trees. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Oak Tree Place",
				"date": "2020",
				"desc": "The oak is a tree or shrub belonging to the genus Quercus. East of this road is a wooded area containing a number of oak trees."
			}, {
				"name": "Oakfield Way",
				"date": "after 1974 but before 1995",
				"desc": "The oak is a tree or shrub belonging to the genus Quercus. There are about 600 species and many are recognised by lobed margins of their leaves and the autumnal acorns. Wet Wood and Kite's Nest Wood are nearby. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Oakleigh Road",
				"date": "1934",
				"desc": "Descriptive name for a clearing in a wood or woodland of oak trees. (Chestnut Walk, Sycamore Close and Willow Drive are nearby). (Adopted by Borough of Bexhill 16th August 1965)."
			}, {
				"name": "Oakwood Avenue",
				"date": "1937",
				"desc": "Descriptive name for a wood of oak trees. (Adopted by Borough of Bexhill 25th February 1953)."
			}, {
				"name": "Ocklynge Close",
				"date": "1937",
				"desc": "Mr Edman Hurst was the first resident of Bexhill to be elected chairman of the Hastings county bench of magistrates. He built a house in Little Common (between Peartree and Green Lanes) called Ocklynge which means “oak line”. Ocklynge Manor, near Eastbourne, was the name of his family's home since the time of King Charles II. (Adopted by Borough of Bexhill 26th November 1958)."
			}, {
				"name": "Old Farm Road",
				"date": "1960",
				"desc": "Built on land previously belonging to Woodsgate Farm. (Adopted by Borough of Bexhill 24th April 1963)."
			}, {
				"name": "Old Harrier Close",
				"date": "2011",
				"desc": "Close to the Little Common site of the old kennels of the Bexhill Harriers, a pack of now extinct Southern hounds. The kennels were built in 1891 by Viscount Cantelupe. (Kennel Lane is nearby). (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Old Manor Close",
				"date": "1956",
				"desc": "Built in the grounds of the former Bexhill Manor House and Manor Farm. Old Manor Close and Manor Lane, now known as Chelsea Close, follow the route of an old drove road from Court Lodge Farm down to the former salt-marsh grazing fields near the sea. (Adopted by Borough of Bexhill 29th June 1960)."
			}, {
				"name": "Old Marsh Road",
				"date": "~1841",
				"desc": "The original route across the marshes of Pevensey Levels from Bexhill to Pevensey. Parts of the old road can still be found running adjacent to the modern A259 road which was completed in 1933. (No information is available as to whether this road is still adopted or not)."
			}, {
				"name": "Old Mill Park",
				"date": "1995",
				"desc": "The preserved remains of Down or Hoad's Mill, a former post-mill, can still be seen by the entrance to this road. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Orchard Close",
				"date": "1937",
				"desc": "Probably built on land previously occupied by back gardens and orchards of existing houses in Church Street. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Orchard Road",
				"date": "1927",
				"desc": "An Ordinance Survey map of 1909 shows a large house called The Firs whose grounds included a designated area of trees, maybe an orchard. It is through this area of trees that the road has been built. (Adopted by Borough of Bexhill 28th March 1938)."
			}, {
				"name": "Orchid Way",
				"date": "2022",
				"desc": "Orchid is the common name of a species of flowering plants belonging to the Orchidaceae family. (Bluebell Close, Buttercup Close, Clover Way, Daisy Way, Daffodil Way, Foxglove Avenue, and Snowdrop Way, Tulip Way are nearby)."
			}, {
				"name": "Osbern Close",
				"date": "c1985",
				"desc": "Bishop Osbern of Exeter (1072 to 1103), is mentioned in Domesday Book as holding land in Bexhill from the Count Robert of Eu. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"status": "bygone",
				"name": "Over Kiln Bank",
				"date": "road before 1841; name 1928",
				"desc": "The names Kiln Bank and Over Kiln Bank appear to be interchangeable in early street directories. This section of road from present-day Little Common roundabout to the crossroad with Turkey Road and Whydown Road is now known as Peartree Lane. Kiln Bank Cottage still stands at the corner of Ocklynge Close and Peartree Lane. The crossroad between Peartree Lane, Turkey Road and Whydown Road in some early street directories is called \"Four Turnings\". The outline of the road can be seen on an Ordnance Survey map 1795 to 1825."
			}, {
				"name": "Paddock Close",
				"date": "1970",
				"desc": "A paddock is an enclosure beside a racetrack where horses are saddled and walked around before a race. (Goodwood Close and Plumpton Close, both Sussex villages with racecourses, are nearby). (Adopted by Borough of Bexhill 27th September 1971)."
			}, {
				"name": "Paddock Way",
				"date": "2022",
				"desc": "A paddock is an enclosure adjoining track where cars are gathered and displayed before a race. (Becketts Close, Brooklands Road, Cascades Way, Clervaux Close, Druids Close, Gracelands Drive, Luffield Drive and Woodcote Way are nearby)."
			}, {
				"name": "Pages Avenue",
				"date": "road ~1841; name 1923",
				"desc": "Built on land forming part of the former Pages Estate. Although the avenue was formally laid out in 1923 the first houses were not built until about 1934. The outline of the avenue and lane can be seen on an Ordnance Survey map 1795 to 1825. (Adopted by Borough of Bexhill 30th January 1939)."
			}, {
				"name": "Pages Gap",
				"date": "road 1923; name 1959",
				"desc": "Built on land forming part of the former Pages Estate. Although the gap was formally laid out in 1923 it wasn't tarmacked until 1959. A new trackway was commissioned by Stars Organisation for Spastics (located at Colwall Court) and built by the Royal Engineers 36 Field Squadron, opened July 1964."
			}, {
				"name": "Pages Lane",
				"date": "road ~1841; name 1934",
				"desc": "Built on land forming part of the former Pages Estate. Although the avenue was formally laid out in 1923 the first houses were not built until about 1934. A level crossing over the railway line, linking Pages Lane to Cooden Drive and Pages Avenue, was closed in 1933 having not been used for several years. (Adopted by Borough of Bexhill, 1st part 29th March 1944 and last part 31st January 1966)."
			}, {
				"name": "Pages Parade East",
				"date": "early 1950s",
				"desc": "Built on land forming part of the former Pages Estate. Used for accommodating beach huts."
			}, {
				"name": "Pages Parade West",
				"date": "early 1950s",
				"desc": "Built on land forming part of the former Pages Estate. Used for accommodating beach huts."
			}, {
				"name": "Pankhurst Close",
				"date": "1972",
				"desc": "Pankhurst Mill was one of the names on a list of Sidley windmills published in a Sussex magazine in the 1930s which were later used to name various roads. These are the nearby Blackmill Close, Mount Idol View and Putlands Crescent. (Date of adoption by Borough of Bexhill or later East Sussex County Council not known)."
			}, {
				"name": "Pankhurst Rise",
				"date": "1952",
				"desc": "Pankhurst Mill was one of the names on a list of Sidley windmills published in a Sussex magazine in the 1930s which were later used to name various roads. (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1956)."
			}, {
				"name": "Parade Extension",
				"date": "c1896",
				"desc": "Recorded on an 1896 map as part of the present-day West Parade."
			}, {
				"name": "Paradise Walk",
				"date": "2009",
				"desc": "In the grounds of the former Nazareth House which included a chapel consecrated at the Feast of the Immaculate Conception. Opened in 1894, this was a home for the elderly, the poor and orphaned girls run by the Sisters of Nazareth. This walk name is a descriptive one reflecting maybe the Garden of Eden and its associations with the Sisters' faith. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Park Avenue",
				"date": "road 1896; name 1906",
				"desc": "Leading to Egerton Park from the seafront. This avenue has been referred to as Pier Road (1905). (Adopted by Borough of Bexhill 31st July 1902)."
			}, {
				"status": "bygone",
				"name": "Park Crescent",
				"date": "c1890 to 1899",
				"desc": "Originally known as Park Crescent then Marine Crescent and now known as West Parade, it is that part of the road from the Marina roundabout along the seafront to Park Road. However, the name has been seen on a 1917 map."
			}, {
				"name": "Park Lane",
				"date": "1950",
				"desc": "Built on land forming part of the Woodsgate Park Estate. The lane is close to the previously named St Stephen's Road or Church Road. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Park Road",
				"date": "1897",
				"desc": "Road adjacent to the eastern edge of Egerton Park. (Adopted by Borough of Bexhill 17th September 1900). (Road passage to east of Park Road linking Egerton Road and Wickham Avenue, serving Cornwall Road and Park Road residences, adopted by Borough of Bexhill 26th March 1906)."
			}, {
				"name": "Parkhurst Mews",
				"date": "1887",
				"desc": "The origin of the name remains unknown. Parkhurst is the name of a park and prison on the Isle of Wight."
			}, {
				"name": "Parkhurst Road",
				"date": "1887",
				"desc": "The origin of the name remains unknown. Parkhurst is the name of a park and prison on the Isle of Wight. (Adopted by Borough of Bexhill, 1st part 1st June 1894 and last part 21st November 1898). (Road passage west of Devonshire Road linking Parkhurst Road and Western Road, serving Devonshire Road, Parkhurst Road and Western Road properties, adopted by Borough of Bexhill 29th January 1912)."
			}, {
				"name": "Paton Road",
				"date": "1956",
				"desc": "Alderman John Alexander Paton was Bexhill Borough Mayor, 1909 to 1911. He also received the Freedom of the Borough in 1920. (Cuthbert Close is nearby). (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1966)."
			}, {
				"name": "Peartree Lane",
				"date": "road ~1841; name 1925",
				"desc": "Built on land near to the present-day Wealden Way which formed part of Pear Tree Farm. High Peartree Wood can be found south of High Woods. The lane between the present-day Little Common roundabout and the crossroad with Turkey Road and Whydown Road was previously called Over Kiln Bank or Kiln Bank. The lane is sometimes divided into High Peartree and Lower Peartree Lanes. The outline of the lane can be seen on an Ordnance Survey map 1795 to 1825. (Adopted at an unknown date as a publicly maintainable highway under the 1835 Highways Act)."
			}, {
				"name": "Pebsham Drive",
				"date": "1934",
				"desc": "The former manor of Pebsham was on the eastern side of Bexhill. One of the first known tenants is John, son of John de Peplesham, in 1254. Pebsham Wood is to the north of the drive and Pebsham Farm and Pebsham Farm Cottages are also nearby. (Adopted by Borough of Bexhill 16th August 1971)."
			}, {
				"name": "Pebsham Lane",
				"date": "1930",
				"desc": "The former manor of Pebsham was on the eastern side of Bexhill. One of the first known tenants is John, son of John de Peplesham, in 1254. Although a long section of this lane from Wrestwood Road around the north side of Pebsham is tarmacked, the lane then divides into two rough tracks across Pebsham fields before joining Freshfields, a tarmacked road to the north and south of the Hastings Household Waste site. (Adopted by Borough of Bexhill, 1st part 3rd February 1964, 2nd part 7th November 1966 and 3rd part 16th August 1971. An unidentified cul-de-sac off this lane was adopted 30th April 1973)."
			}, {
				"name": "Pembury Grove",
				"date": "1937",
				"desc": "Large village in Kent, just to the north-east of Tunbridge Wells. (Adopted by Borough of Bexhill 28th June 1937)."
			}, {
				"name": "Penhurst Drive",
				"date": "1967",
				"desc": "Village in East Sussex, 3 miles west of Battle. (Adopted by Borough of Bexhill 29th April 1968)."
			}, {
				"name": "Penland Road",
				"date": "1909",
				"desc": "Built on land close to Penland Wood which in 1307 was recorded as Pendland. Originally Penland Wood covered a much larger area than it does today. An 1910 map records Penland Road in two distinct parts, the present-day section from De La Warr Road to Hastings Road but also another section at the end of Ashdown Road from about the corner of Galley Hill View behind St Richard's RC College to the railway underpass. (Adopted by Borough of Bexhill 20th December 1909)."
			}, {
				"name": "Penny Lane",
				"date": "after 1974 but before 1998",
				"desc": "The origin of the name remains uncertain. Maybe refers to the song released by the English rock band The Beatles in 1967. The song's title itself derives from the name of a street near John Lennon's childhood home during his first five years in Liverpool. James Penny was an 18th century slave trader in Liverpool. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"status": "bygone",
				"name": "Picknill Green Lane",
				"date": "before 1841 to 1896",
				"desc": "Old parish lane now known as Coneyburrow Lane. The outline of the lane can be seen on an Ordnance Survey map 1795 to 1825. Picknill Green is the area at the junction of Sandhurst Lane and Coneyburrow Lane through which the Picknill Green Stream flows. The name may be derived from Pica's glind which would possibly be an enclosure belonging to Pica."
			}, {
				"status": "bygone",
				"name": "Pier View or Road East or Road West",
				"date": "1906 to c1950",
				"desc": "Approach road to a proposed pier which was never built. The road was later known as Pier Road East in the 1930s and is now known as Channel View East."
			}, {
				"name": "Piltdown Close",
				"date": "1972",
				"desc": "Village in East Sussex, 3 miles west of Uckfield. It has been suggested that this road name may have been chosen because there had once been an abattoir in this area and no doubt old animal bones would have been unearthed during the construction of the road. This may have brought to mind the Piltdown Man hoax when bone fragments were presented as the fossilised remains of a previously unknown early human. These bones were said to have been collected in 1912 from a gravel pit at Piltdown, East Sussex; the hoax was exposed in 1953. (Date of adoption by Borough of Bexhill or later East Sussex County Council not known)."
			}, {
				"name": "Pinewoods",
				"date": "1962",
				"desc": "Pines are trees belonging to the genus Pinus. There are over 100 species of these evergreen, coniferous and resinous trees. A few fir trees can still be seen in this area. (The Grove is nearby). (Adopted by Borough of Bexhill 8th November 1965)."
			}, {
				"name": "Pipers Close",
				"date": "after 1974 but before 1995",
				"desc": "Development on the site of a former house called Pipers which was built about 1964 but then demolished at an unknown date after 1974. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Plemont Gardens",
				"date": "1908",
				"desc": "Plemont Cottage was built on Broadoak Lane in about 1907. Plemont Gardens was laid out as a road adjacent to the cottage and probably through its grounds in 1908 although no properties were built on the road until about 1911. It is not known when Plemont Cottage was demolished. (Adopted by Borough of Bexhill 24th November 1930)."
			}, {
				"name": "Pleyden Rise",
				"date": "1972",
				"desc": "The origin of the name remains uncertain. Maybe an alternative spelling of Playden, a suburb of Rye, East Sussex. The other three roads on this estate, Ticehurst Avenue and Close and Wartling Drive have East Sussex place names connections. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Plumpton Close",
				"date": "1972",
				"desc": "Village in East Sussex, with racecourse, 5 miles north-west of Lewes. (Goodwood Close and Paddock Close are nearby). (Date of adoption by Borough of Bexhill or later East Sussex County Council not known)."
			}, {
				"name": "Polegrove",
				"date": "before 1881",
				"desc": "The name may be derived from a 14th century word poughgroue which means a goblin wood. An Ordnance Survey map of 1881 shows the “Pole Grove (liable to floods)”. The 12 acres recreation ground was opened in 1923."
			}, {
				"name": "Poplar Close",
				"date": "2004",
				"desc": "Poplars are deciduous flowering plants belonging to the genus Populus. There are about 30 species and the English names applied to different species include aspen and cottonwood as well as poplar. (Alder Gardens, Elm Close, Hazel Grove, Hornbeam Avenue are nearby). (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Popps Lane",
				"date": "road 1925; name 1927",
				"desc": "Built of land forming part of the former Popps Farm also known as Lower Birchington Farm. This road was previously known as Crescent Drive from 1925 to 1926. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Portfield Close",
				"date": "after 1974 but before 1996",
				"desc": "Portfield is a suburb of Chichester, West Sussex. There may also be a link to the main offices of the builders or developers of this road then being located in Chichester. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Potman's Lane",
				"date": "road ~1841; name 1899",
				"desc": "Potman is a family surname recorded in 1460 as Potmansland relating to Potman's Farm. There is still a Potman's Place on this lane. The outline of the lane can be seen on an Ordnance Survey map 1795 to 1825. (Probably taken over as a Public Highway by the Local Board of Battle in 1884)."
			}, {
				"name": "Preston Hall Close",
				"date": "2021",
				"desc": "Built on what was once Preston Farm - Preston Hall, Lodge and Cottage are to be found nearby. Preston House in 1380 is recorded as Prestesdene meaning a priest's valley. In early street directories the area around Preston Hall, Lodge and Cottage is often simply called Preston."
			}, {
				"name": "Preston Road",
				"date": "1899",
				"desc": "Preston Farm is to the north of this road (also Preston Hall, Lodge and Cottage are to be found on Watermill Lane). Preston House in 1380 is recorded as Prestesdene meaning a priest's valley. In early street directories the area around Preston Hall, Lodge and Cottage is often simply called Preston. This road probably includes part of a road previously known as Ingram Road. (Adopted by Borough of Bexhill 29th March 1950)."
			}, {
				"name": "Primrose Hill",
				"date": "1975",
				"desc": "The origin of the name remains uncertain. R A Larkin and Bros Ltd were major developers and house builders in Bexhill between 1924 to 1988. They developed this road together with Roselands and Summer Hill Road. Maybe the road is named after the hill on the northern side of Regent's Park, London. Alternatively, it is the name of four districts or villages in England including one close to Ormskirk, Lancashire, which has a golf course. That golf course is about 5 miles south-east of the Royal Birkdale golf course, the inspiration for the Larkins choosing the name Birkdale for the road leading from Collington Avenue towards Little Common. Finally, primroses are herbaceous perennial garden and wild plants belonging to the genus Primula. (Roselands and Summer Hill Road are nearby). (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Principal Close",
				"date": "road 1972; name c1995",
				"desc": "Descriptive name for part of the main road within this estate. Previously part of Ticehurst Avenue. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Promenade",
				"date": "1984",
				"desc": "Pedestrian access ways, seawalls and splash decks built for coastal protection. Originally planned to be built in 5 sections from Cooden Beach to West Parade, but sections 1-2 were dropped - allegedly to avoid intrusion into the then mayor's private garden."
			}, {
				"name": "Prowting Mead",
				"date": "after 1974 but before 1995",
				"desc": "Prowting (Homes) took over R A Larkin and Bros Ltd's business in 1988; they later developed this estate. Mead is another word for a meadow and probably reflects that this area is former farming land. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Putlands Crescent",
				"date": "1952",
				"desc": "William Putland was a miller who died in 1781 and his windmill was close to this area. Putlands Mill was one of the names on a list of Sidley windmills published in a Sussex magazine in the 1930s which were later used to name various roads. These are the nearby Blackmill Close, Mount Idol View and Pankhurst Close and Rise. (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1956)."
			}, {
				"name": "Quebec Close",
				"date": "1964",
				"desc": "In 1910 a house called West Down was built near here. A new owner renamed it Quebec House in the early 1950s but it became vacant in the early 1960s and was then demolished. The close was built in the grounds of this former house. (Adopted by Borough of Bexhill 14th December 1970)."
			}, {
				"name": "Rafati Way",
				"date": "c2004",
				"desc": "The builder and developer of this development was Mr Rafati in partnership with Mr Benge. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Ravens Close",
				"date": "1960",
				"desc": "Ravens are large all-black birds belonging to the genus Corvus. (Adopted by Borough of Bexhill 28th March 1962)."
			}, {
				"name": "Ravenside Retail and Leisure Park",
				"date": "1989",
				"desc": "Site of the former Hastings Gasworks. The site was developed by the Land Securities Group and the name of the Park was probably taken from Ravenseft Properties which became a wholly owned subsidiary of the Land Securities Group in 1955. Ravenseft Properties had previously been known as the Ravensfield Investment Trust."
			}, {
				"name": "Rectory Way",
				"date": "1972",
				"desc": "Adjacent to St Peter's Church rectory. (Church Vale Road, Lychgates Close and St Peter's Crescent is nearby). (Date of adoption by Borough of Bexhill or later East Sussex County Council not known)."
			}, {
				"status": "bygone",
				"name": "Redgrove",
				"date": "1969 to 1970",
				"desc": "Redgrove Wood lies nearby to the north-east. This road is now known as Carfax Close."
			}, {
				"name": "Redgrove Close",
				"date": "2020",
				"desc": "Redgrove Wood lies nearby to the south."
			}, {
				"status": "bygone",
				"name": "Reginald Place",
				"date": "road 1892; name 1899 to 1910",
				"desc": "The section of road from the present-day Sackville Road railway arch to about Reginald Road. This road was originally known as Sackville Road North before becoming Reginald Place which itself was incorporated into the present-day Terminus Road in 1910."
			}, {
				"name": "Reginald Road",
				"date": "1887",
				"desc": "Reginald Windsor Sackville (1817 to 1896) was the 7th Earl De La Warr. (Windsor Road is nearby). (Adopted by Borough of Bexhill, 1st part 17th September 1900 and last part 20th December 1909). (Foot passage to west of Windsor Road and south of Victoria Road linking Victoria Road to Terminus Road, serving Windsor Road and Reginald Road residences and foot passage to west of Windsor Road and north of Victoria Road linking Victoria Road to the present-day Phoenix Works off Windsor Road, serving Windsor Road and Reginald Road residences, both passages adopted by Borough of Bexhill 20th December 1909)."
			}, {
				"name": "Renown Close",
				"date": "2001",
				"desc": "Site of the former depot of Renown Coaches from 1981 to 1999. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Reynolds Drive",
				"date": "c2000",
				"desc": "Sir Joshua Reynolds (1723 to 1792) was an English painter specialising in portraits. (Constable Way, Gainsborough Road and Turner Close are nearby). (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Richmond Avenue",
				"date": "1908",
				"desc": "The origin of the name remains uncertain. Either in King Edward II's reign (1284 to 1327), the Earl of Richmond who was then lord of the manor of Bexhill, was granted a charter for a weekly market in Bexhill on Mondays, and a fair on four days a year. Or Charles Gordon-Lennox (1870 to 1935) 8th Duke of Richmond married Hilda Madeline Brassey in 1893; Hilda was the cousin of Muriel Brassey who married Viscount Cantelupe, later the 8th Earl De La Warr. On an Ordnance Survey map 1909, Richmond Avenue is shown crossing over Cooden Drive and along the present-day Westcourt Drive to the cattle arch under the railway line. Beyond the railway was a footpath which led to Braggs Lane. (Adopted by Borough of Bexhill, 1st part 27th May 1935 and last part 24th May 1937)."
			}, {
				"name": "Richmond Close",
				"date": "1938",
				"desc": "The origin of the name remains uncertain. Either in King Edward II's reign (1284 to 1327), the Earl of Richmond who was then lord of the manor of Bexhill, was granted a charter for a weekly market in Bexhill on Mondays, and a fair on four days a year. Or Charles Gordon-Lennox (1870 to 1935) 8th Duke of Richmond married Hilda Madeline Brassey in 1893; Hilda was the cousin of Muriel Brassey who married Viscount Cantelupe, later the 8th Earl De La Warr. (Adopted by Borough of Bexhill 28th March 1938)."
			}, {
				"name": "Richmond Grove",
				"date": "1908",
				"desc": "The origin of the name remains uncertain. Either in King Edward II's reign (1284 to 1327), the Earl of Richmond who was then lord of the manor of Bexhill, was granted a charter for a weekly market in Bexhill on Mondays, and a fair on four days a year. Or Charles Gordon-Lennox (1870 to 1935) 8th Duke of Richmond married Hilda Madeline Brassey in 1893; Hilda was the cousin of Muriel Brassey who married Viscount Cantelupe, later the 8th Earl De La Warr. This grove does not appear in local street directories until the early 1920s when, presumably, housing started to be built here. (Adopted by Borough of Bexhill 26th July 1926)."
			}, {
				"name": "Richmond Road",
				"date": "1903",
				"desc": "The origin of the name remains uncertain. Either in King Edward II's reign (1284 to 1327), the Earl of Richmond who was then lord of the manor of Bexhill, was granted a charter for a weekly market in Bexhill on Mondays, and a fair on four days a year. Or Charles Gordon-Lennox (1870 to 1935) 8th Duke of Richmond married Hilda Madeline Brassey in 1893; Hilda was the cousin of Muriel Brassey who married Viscount Cantelupe, later the 8th Earl De La Warr. (Adopted by Borough of Bexhill, 1st part 26th April 1926 and last part 27th September 1971. Also adopted at an unknown date as a publicly maintainable highway under the 1835 Highways Act)."
			}, {
				"name": "Riders Bolt",
				"date": "1964",
				"desc": "The origin of the name remains uncertain but maybe it is the rural pursuits of horse riding and working horses as land in this area was previously meadows and orchards belonging to Hurchington Farm. The use of the word bolt remains a mystery. (Bale Close and Fowlers Close are nearby). (Adopted by Borough of Bexhill 21st September 1970)."
			}, {
				"name": "Ridgewood Gardens",
				"date": "1974",
				"desc": "Village in East Sussex, 1 mile south of Uckfield. (Date of adoption by Borough of Bexhill or later East Sussex County Council not known)."
			}, {
				"name": "Ringwood Road",
				"date": "1916",
				"desc": "Ring Wood, which is east of Buckholt Farm, is about 1½ miles north of this road. (Adopted by Borough of Bexhill 2nd January 1957)."
			}, {
				"name": "Robin Hill",
				"date": "1996",
				"desc": "Robins are small perching birds belonging to the genus Erithacus. Their red or orange breast feathers are a characteristic feature. This collection of houses is built on a raised area of land. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Roedean Close",
				"date": "1964",
				"desc": "After the independent girls' school in Roedean village on the outskirts of Brighton. (Adopted by Borough of Bexhill 8th November 1965)."
			}, {
				"name": "Rookhurst Road",
				"date": "1950",
				"desc": "Rooks are large birds belonging to the genus Corvus. Their nests in a rookery in the upper branches of trees are a well-recognised sight in woods. A rookhurst is a wood frequented by rooks. Maps of the late 1800s show a small wood in this area. (Adopted by Borough of Bexhill 30th September 1963)."
			}, {
				"name": "Roselands",
				"date": "1975",
				"desc": "The origin of the name remains uncertain. R A Larkin and Bros Ltd were major developers and house builders in Bexhill between 1924 to 1988. They developed this road together with Primrose Hill and Summer Hill Road. Maybe the road is named after a district of Eastbourne, north of the town centre, called Roselands. Alternatively, it is the name of a town 16 km south-west of Sydney, Australia; Summer Hill is also near Sydney and Larkins often named their roads after favourite holiday destinations. Finally, roses are woody perennials of the genus Rosa, there are over 100 species. (Primrose Hill and Summer Hill Road are nearby). (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Rotherfield Avenue",
				"date": "1903",
				"desc": "Village in East Sussex, 3 miles east of Crowborough. There is a stone plaque in a wall near the top of road which reads Rotherfield Avenue 1899 TS. It is uncertain what TS stands for, maybe Sackville as this development is in the former grounds of the Manor House. It is thought the plaque was placed in the wall during the early 1990s. (Adopted by Borough of Bexhill 16th March 1914). (Foot passage between Upper Sea Road and Rotherfield Avenue adopted by Borough of Bexhill 24th March 1954)."
			}, {
				"name": "Roundacres Way",
				"date": "1968",
				"desc": "After the small woodland called Roundacre Wood adjacent to Worsham Lane. (Adopted by Borough of Bexhill 21st September 1970)."
			}, {
				"name": "Rowan Gardens",
				"date": "1958",
				"desc": "Rowans or mountain-ashes are shrubs or small trees of the genus Sorbus. (Cherry Tree, Laburnum and Maytree Gardens are nearby). (Adopted by Borough of Bexhill 21st December 1964)."
			}, {
				"name": "Royal Sovereign",
				"date": "1971",
				"desc": "The Royal Sovereign Lighthouse stands in the English Channel nearly seven miles off Bexhill. It marks the Royal Sovereign shoal, replacing a lightvessel that had been established in 1875. The Battle of Beachy Head was a naval engagement fought on 10th July 1690 during the Nine Years War. The battle fought in the English Channel off Eastbourne was one of the greatest French naval victories over their English and French adversaries. In this battle the main Allied fleet was under the command of Admiral Torrington whose flag ship was the Royal Sovereign. The name is still linked not only to the lighthouse but also to a public house in Sea Road and a café on West Parade though not yet to any roads or streets."
			}, {
				"name": "Royston Gardens",
				"date": "1958",
				"desc": "The origin of the name remains unknown. There are three villages called Royston around the United Kingdom but none are in south-east England. (Adopted by Borough of Bexhill 28th September 1960)."
			}, {
				"status": "bygone",
				"name": "Russells Lane",
				"date": "c1850 to c1880",
				"desc": "The road between Buckhurst Place and the crossroads with King Offa Way was originally known as Russells Lane. It was later recorded as Station Roads {1} and {2} and then Lower Station Road before becoming part of present-day London Road. The Russell family were long-established farmers around Bexhill by the 19th century."
			}, {
				"name": "Sackville Mews",
				"date": "1970",
				"desc": "Herbrand de Sauqueville was a follower of William the Conqueror who came to Sussex in 1068. The Sackville family have been Lords of the Manor of Bexhill since 1570 when it was granted to Thomas Sackville by Queen Elizabeth I."
			}, {
				"name": "Sackville Road",
				"date": "1888",
				"desc": "Herbrand de Sauqueville was a follower of William the Conqueror who came to Sussex in 1068. The Sackville family have been Lords of the Manor of Bexhill since 1570 when it was granted to Thomas Sackville by Queen Elizabeth I. When the railway came to Bexhill in 1846 it had been necessary to establish cattle arches at Cooden Beach, Westcourt Drive, Sackville Road and Glyne Gap, to enable farmers north of the railway line to move their stock to summer grazing on the low-lying marshland to the south of the railway. Because of the increasing volume and size of road traffic the Sackville Road arch was demolished in 1892 and replaced by a cast-iron bridge; this was replaced by the current bridge in 1978. (Adopted by Borough of Bexhill, 1st part 21st November 1898 and last part 17th September 1900). (Foot passage to east of Cornwall Road leading from Egerton Road towards Wickham Avenue (but not a thoroughfare), serving Cornwall Road and Sackville Road residences, adopted by Borough of Bexhill 24th May 1937)."
			}, {
				"status": "bygone",
				"name": "Sackville Road North",
				"date": "1892 to 1898",
				"desc": "The section of road from the present-day Sackville Road railway arch to about Reginald Road. This road then became known as Reginald Place in 1899 which itself was then incorporated into the present-day Terminus Road in 1915."
			}, {
				"name": "Salisbury Road",
				"date": "1887",
				"desc": "Lord Salisbury (1830 to 1903), Conservative Prime Minister on three occasions between 1885 and 1902. (Adopted by Borough of Bexhill 17th September 1900)."
			}, {
				"name": "Saltdean Close",
				"date": "1972",
				"desc": "Small town in East Sussex, 5 miles east of Brighton. (Date of adoption by Borough of Bexhill or later East Sussex County Council not known)."
			}, {
				"name": "Saltdean Way",
				"date": "1968",
				"desc": "Small town in East Sussex, 5 miles east of Brighton. (Adopted by Borough of Bexhill 26th April 1971)."
			}, {
				"name": "Salvington Crescent",
				"date": "c1975",
				"desc": "A neighbourhood of Worthing, West Sussex. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Sandhurst Lane",
				"date": "~1841",
				"desc": "Old parish lane named after a village in Kent, 6 miles south-west of Tenterden. The outline of the lane can be seen on an Ordnance Survey map 1795 to 1825. (Taken over as a Public Highway by the Local Board of Bexhill in 1884)."
			}, {
				"status": "bygone",
				"name": "Sandhurst Road",
				"date": "1902 to 1930",
				"desc": "Section of the present-day London Road from Sedgewick Road to the junction with Holliers Hill."
			}, {
				"status": "bygone",
				"name": "Sandmere Lane",
				"date": "road before 1841; name 1922 to c1932",
				"desc": "In 1763 a piece of woodland called Sandmares or St Mary's Wood was purchased from Robert Sampson. The outline of the lane, which runs through this wood, can be seen on an Ordnance Survey map 1795 to 1825. Street directories consistently spelt the name as Sandmere. Now known as St Marys Lane. (Taken over as a Public Highway by the Local Board of Bexhill in 1884)."
			}, {
				"name": "Sandown Way",
				"date": "1969",
				"desc": "Near here was the independent boys' school called Sandown School which moved to Hastings Road in 1911 and closed in the late 1950s. The school was originally opened by Misses Neale and Cheffins in 1905 in Dorset Road. (Adopted by Borough of Bexhill 21st September 1970)."
			}, {
				"name": "Saxby Road",
				"date": "1968",
				"desc": "The origin of the name remains uncertain. It is considered to be named after a member of a local Saxby family although which one and why remains unknown. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Saxon Mews",
				"date": "c2008",
				"desc": "Saxons are members of a Germanic people who conquered Britain in the 5th and 6th centuries. At present no past links to horses or livery stables in this area have been identified. Originally a mews was a street or yard of stables often converted into dwelling-houses or garages. The name is often used now for a small modern development of houses either as a terrace or around a court-yard. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Saxon Rise",
				"date": "1972",
				"desc": "Saxons are members of a Germanic people who conquered Britain in the 5th and 6th centuries. At present no past links to horses or livery stables in this area have been identified. Built along a gentle slope up from Links Drive. (Adopted by Borough of Bexhill 30th April 1973)."
			}, {
				"name": "Scholars Walk",
				"date": "2006",
				"desc": "Adjoining Boys and Girls Grammar Schools were opened on this Turkey Road site in 1927. They amalgamated in 1970 to create Bexhill Grammar School which then became the Sixth Form College. Bexhill College moved to its new site on Penland Road in September 2004 and the old buildings on Turkey Road were then closed and later demolished. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "School Place",
				"date": "c1977",
				"desc": "Road leads to Pebsham County Primary School, Glyne Gap School and Early Years Nursery. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"status": "bygone",
				"name": "Sea Lane",
				"date": "before 1841 to c1882",
				"desc": "Lane from Bexhill Old Town down to the sea. The outline of the lane can be seen on an Ordnance Survey map 1795 to 1825. This lane became known as Sea Road from about 1882."
			}, {
				"name": "Sea Road",
				"date": "road ~1841; name 1899",
				"desc": "The present-day road from Station Road to De La Warr Parade. Some street directories call this section of road Lower Sea Road from about 1899 until about 1917 although that name is rarely seen on maps. The railway bridge on Sea Road was widened in 1905 to allow the passage of the tramway service. (Taken over as a Public Highway by the Local Board of Bexhill in 1884. Part adopted at an unknown date as a publicly maintainable highway under the 1835 Highways Act)."
			}, {
				"status": "bygone",
				"name": "Sea Road {1}",
				"date": "road before 1841; name c1882 to 1898",
				"desc": "Previously known as Sea Lane, this road ran from Bexhill Old Town down to the sea. On legal documents until the late 1880s this road was referred to as St Peter's Road. Sea Road {1} was divided into present day Sea Road and Upper Sea Road in about 1899."
			}, {
				"status": "bygone",
				"name": "Sea Road {Cooden}",
				"date": "before 1841 to 1929",
				"desc": "Original name for the road from Little Common roundabout down to the sea at Cooden Beach. Now known as Cooden Sea Road."
			}, {
				"name": "Seabourne Road",
				"date": "1934",
				"desc": "Bourne is a southern English variation of the word burn which can mean a small brook or stream. A stream flows behind Pebsham Community Centre then past Mistley Close before eventually joining the Combe Haven. The name probably refers to this stream or bourne flowing towards the sea. (Adopted by Borough of Bexhill, 1st part 27th September 1965, 2nd part 7th November 1966 and 3rd part 28th April 1969)."
			}, {
				"name": "Second Avenue",
				"date": "1940",
				"desc": "Ordinal number. (First and Third Avenues are nearby). (Adopted by Borough of Bexhill, 1st part 25th June 1958 and 2nd part 25th October 1961)."
			}, {
				"name": "Sedgewick Road",
				"date": "1899",
				"desc": "The origin of the name remains unknown. Early street directories and maps spelt this name as Sedgwick but by the early 1940s it had consistently changed to Sedgewick. (Adopted by Borough of Bexhill 27th April 1955)."
			}, {
				"name": "Sewell Avenue",
				"date": "1926",
				"desc": "Councillor Richard Cecil Sewell was Bexhill Borough Mayor, 1924 to 1925. He received the Freedom of the Borough in 1952. (Bending Crescent is nearby). (Adopted by Borough of Bexhill 22nd July 1935)."
			}, {
				"name": "Sheila Child Close",
				"date": "2004",
				"desc": "Sheila Child, who died in 2003, worked for many years improving the standards of social housing within Bexhill. Nearby Mephams Terrace was a development around the same time and these houses are built on the site of a large building which had been for many years a furniture repository for Thomas Mepham and Sons Ltd. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Shepherds Close",
				"date": "1955",
				"desc": "Before development, this area of farmland between Little Common Road and Cooden Sea Road was known as Shepherd's Field. (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1956)."
			}, {
				"name": "Shipley Lane",
				"date": "1968",
				"desc": "Village in West Sussex, 6 miles north-east of Storrington. (Date of adoption by Borough of Bexhill or later East Sussex County Council not known)."
			}, {
				"name": "Short Lane",
				"date": "~1841",
				"desc": "Short and narrow section of a now traffic-free lane from the west front of St Peter's Church down the slope to Chantry Lane. On many maps this section is considered part of Church Street. The outline of the lane can be seen on an Ordnance Survey map 1795 to 1825."
			}, {
				"status": "bygone",
				"name": "Shortwood Lane",
				"date": "before 1841 to c1930",
				"desc": "Shortwood is recorded as a residence on this lane in the 1841 census and the outline of the lane can be seen on an Ordnance Survey map 1795 to 1825. Now known as Freezeland Lane."
			}, {
				"name": "Sidley Green",
				"date": "~1841",
				"desc": "The present-day road across the remains of the Green at Sidley. Originally called Sidelegh(e) meaning at the wide clearing, Sidley was a former hamlet on the high road inland from the ancient port of Bulverhythe towards Ninfield and beyond. The hamlet was in existence by the 15th century as a forge is recorded there and the name recorded as Sidlye Greene. The name has since been used for the whole village not just the centre of the village. The outline of the present-day road can be seen on an Ordnance Survey map 1795 to 1825. (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1956)."
			}, {
				"status": "bygone",
				"name": "Sidley Road",
				"date": "road before 1841; name 1871 to 1898",
				"desc": "The former name of the section of road from the top of Holliers Hill to Sidley Green; now part of Ninfield Road."
			}, {
				"name": "Sidley Street",
				"date": "1899",
				"desc": "Sidley was a former hamlet on the high road inland from the ancient port of Bulverhythe towards Ninfield and beyond. The hamlet was in existence by the 15th century as a forge is recorded there and the name recorded as Sidlye Greene. The name has since been used for the whole village not just the centre of the village. (Adopted by Borough of Bexhill 23rd December 1907). (Foot passage between North Road and Sidley Street adopted by Borough of Bexhill 30th January 1939)."
			}, {
				"name": "Silva Close",
				"date": "after 1974 but before 1995",
				"desc": "During the late 1940s and early 1950s a Miss Silva lived at a house called The Ridge and a Mrs Silva, unknown relationship, lived next door at Glengorse; both these houses were located on Pebsham Lane between Bishops Walk and Pebsham Drive. These two residents are thought to be the inspiration for the name of this nearby road. The reason for choosing their surname is uncertain but they may have owned the land upon which this development took place. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Singleton Walk",
				"date": "c2010",
				"desc": "Small village in West Sussex, 7 miles north of Chichester. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Sluice Road",
				"date": "~1841",
				"desc": "Also known as Sluice Lane, it runs from the railway level crossing at the end of Herbrand Walk, past the Star Inn and across the marshes to the A259 roundabout at Pevensey. A new sluice outfall was completed in the middle of the 15th century where Norman's Bay is now located. The area around Norman's Bay was previously called Pevensey Sluice. The outline of the lane can be seen on an Ordnance Survey map 1795 to 1825. (Taken over as a Public Highway, from future Borough boundary near Rockhouse Bank to the railway level crossing at the end of Herbrand Walk, by the Local Board of Bexhill in 1884)."
			}, {
				"name": "Snowdrop Way",
				"date": "2020",
				"desc": "Snowdrop is the common name of a species of flowering plants belonging to the Amaryllidaceae family. (Bluebell Close, Buttercup Close, Clover Way, Daisy Way, Daffodil Way, Foxglove Avenue, Tulip Way and Orchid Way are nearby)."
			}, {
				"name": "South Cliff",
				"date": "1924",
				"desc": "The coastal cliffs and rock formations between the present-day Richmond Road and Veness Gap were previously known as West Cliff(s) but are now generally referred to as South Cliff. (Adopted by Borough of Bexhill, 1st part 27th May 1935 and last part 15th August 1966)."
			}, {
				"name": "South Cliff Avenue",
				"date": "1924",
				"desc": "The coastal cliffs and rock formations between the present-day Richmond Road and Veness Gap were previously known as West Cliff(s) but are now generally referred to as South Cliff. (Adopted by Borough of Bexhill 30th January 1939)."
			}, {
				"status": "bygone",
				"name": "South Cliff Drive",
				"date": "1927 to 1939",
				"desc": "This drive ran from Cooden Drive down to Winceby House School for girls which opened in 1927. Later, to prevent traffic congestion, a separate drive connected the school to the present-day South Cliff. Part of this second drive is now incorporated into Winceby Close."
			}, {
				"name": "Southcourt Avenue",
				"date": "1924",
				"desc": "The origin of the name remains uncertain. The road was developed at a similar time to Westcourt Drive and maybe the two names are linked. However it is unclear what or where these two roads may be “south” and “west” of. The answer would be Collington Wood if the drive was called “Eastcourt Drive”. (Adopted by Borough of Bexhill 30th January 1939)."
			}, {
				"name": "Southlands Avenue",
				"date": "1933",
				"desc": "Descriptive name for land south of the main Ninfield Road. (Adopted by Borough of Bexhill 31st January 1966)."
			}, {
				"name": "Southlands Road",
				"date": "1929",
				"desc": "Descriptive name for land south of the main Ninfield Road. (Adopted by Borough of Bexhill 29th July 1953)."
			}, {
				"status": "bygone",
				"name": "Spa Road",
				"date": "1901 to c1929",
				"desc": "Previous name for section of road which ran south from the junction of the present-day St Georges Road, London Road and Woodsgate Park. Now part of the present-day London Road. There was a chalybeate, ie containing iron compounds, spring here at that time and the water was considered to have healthy properties."
			}, {
				"name": "Spindlewood Drive",
				"date": "after 1974 but before 1995",
				"desc": "Spindles or spindle trees comprise over 150 species of deciduous and evergreen shrubs and trees. They belong to the genus Euonymus. (Aspen Way and Mulberry Close are nearby). (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Spring Close",
				"date": "2021",
				"desc": "There is a spring near here which feeds into the Combe Haven. The same waterway was once used to power a local watermill."
			}, {
				"name": "Spring Lane",
				"date": "after 1974 but before 1995",
				"desc": "Probably alludes to a water spring which arises in the nearby woodland and feeds into the Picknill Green Stream. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Springfield Road",
				"date": "~1881",
				"desc": "There was a chalybeate, ie containing iron compounds, spring at the corner of the present-day London Road, Woodsgate Park and St Georges Road. (Adopted by Borough of Bexhill, 1st part 23rd December 1907 and last part 28th April 1954)."
			}, {
				"name": "Squirrel Close",
				"date": "after 1974 but before 1983",
				"desc": "Squirrels are small rodents belonging to the family Sciuridae. In the United Kingdom they are tree squirrels predominately the grey squirrel rather than the native red squirrel. (Badgers Mount, Deerswood Lane and Foxhill are nearby). (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "St Andrew's Road",
				"date": "1903",
				"desc": "Patron saint of Scotland. (St Davids Avenue, St Georges Road and St Patricks Crescent are nearby). (Adopted by Borough of Bexhill 22nd July 1935)."
			}, {
				"name": "St Annes Close",
				"date": "1962",
				"desc": "Probably a biblical reference as this close is off St Peters Crescent. St Anne was the mother of the Virgin Mary. (St Peters Crescent is nearby). (Adopted by Borough of Bexhill 23rd December 1963)."
			}, {
				"name": "St Augustines Close",
				"date": "1957",
				"desc": "Leads to St Augustine's Church, off Cooden Drive. Although the church was consecrated in 1934, the first four bungalows in the close were not built until 1957. Augustine of Canterbury, after whom the church is dedicated, was a Benedictine monk who became the first Archbishop of Canterbury in AD 597. He is remembered as the founder of the English Church. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "St Davids Avenue",
				"date": "1890",
				"desc": "Patron saint of Wales. (St Andrews Road, St Georges Road and St Patricks Close are nearby). (Adopted by Borough of Bexhill 29th November 1937)."
			}, {
				"name": "St Francis Chase",
				"date": "after 1974 but before 1995",
				"desc": "Deutches Paedagogium was an independent school for German boys founded in 1910 by Mrs Du Mont who lived at Manor House, Bexhill Old Town. It closed at the outbreak of World War 1 and then reopened in 1920 as Garth Place, an independent school boys aged 7 to 14 years. This school closed in 1938 but eventually from about 1946 housed St Francis independent school for girls aged 4 to 18 years, plus a few boys of junior school age, before it too closed in about 1972. The gate house can still be seen adjacent to West Down Road. (Garth Close is nearby). (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "St George's Road",
				"date": "1893",
				"desc": "Patron saint of England. On a 1909 map St Georges Road extends along the present-day Woodsgate Park as well as its present-day route. (St Andrews Road, Davids Avenue and St Patricks Crescent are nearby). (Adopted by Borough of Bexhill 22nd July 1935)."
			}, {
				"name": "St James Avenue",
				"date": "1930",
				"desc": "The origin of the name remains uncertain. St James is one of Christ's twelve apostles. St James Road and St Johns Road were both developed at the same time. St John is another apostle but it is uncertain why these two saints, from the twelve, should have been chosen. (Adopted by Borough of Bexhill, 1st part 24th May 1937 and last part 15th August 1966)."
			}, {
				"name": "St James Close",
				"date": "1964",
				"desc": "The origin of the name remains uncertain. St James is one of Christ's twelve apostles. St James Road and St Johns Road were both developed at the same time. St John is another apostle but it is uncertain why these two saints, from the twelve, should have been chosen. (Adopted by Borough of Bexhill 10th August 1964)."
			}, {
				"name": "St James Crescent",
				"date": "1937",
				"desc": "The origin of the name remains uncertain. St James is one of Christ's twelve apostles. St James Road and St Johns Road were both developed at the same time. St John is another apostle but it is uncertain why these two saints, from the twelve, should have been chosen. From about 1940 to at least 1974 the street directories divided this crescent into an Inner Circle and an Outer Circle. Both Inner Circle and Outer Circle were listed separately in the directories. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "St James Road",
				"date": "1873",
				"desc": "The origin of the name remains uncertain. St James is one of Christ's twelve apostles. St James Road and St Johns Road were both developed at the same time. St John is another apostle but it is uncertain why these two saints, from the twelve, should have been chosen. An recent error on the road sign misspelt this road as St Jame's Road, the apostrophe had to be painted out. (Adopted by Borough of Bexhill, 1st part 12th January 1885 and last part 24th May 1937)."
			}, {
				"name": "St John's Road",
				"date": "1873",
				"desc": "The origin of the name remains uncertain. St John is one of Christ's twelve apostles. St Johns Road and St James Road were both developed at the same time. St James is another apostle but it is uncertain why these two saints, from the twelve, should have been chosen. (Adopted by Borough of Bexhill 12th January 1885)."
			}, {
				"name": "St Lawrence Road",
				"date": "1950",
				"desc": "During World War Two Canadian troops from Le Regiment De La Chaudiere from the St Lawrence River area were stationed in Bexhill. (Calgary Road, Canada Way and Edmonton Road are nearby). (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1956)."
			}, {
				"name": "St Margarets Crescent",
				"date": "1937",
				"desc": "The origin of the name is unknown. Maybe this is a reference to St Margaret of Antioch. There are also two villages in England called St Margarets, but neither are in south-east England. (Probably adopted, as part of Whydown Road, sometime after 1937 as a publicly maintainable highway under the 1835 Highways Act)."
			}, {
				"name": "St Marks Close",
				"date": "1972",
				"desc": "St Mark's Church, Little Common, is nearby. (Date of adoption by Borough of Bexhill and later by East Sussex County Council not known)."
			}, {
				"name": "St Mary's Lane",
				"date": "road ~1841; name c1933",
				"desc": "Previously known as Sandmere Lane. (Taken over as a Public Highway by the Local Board of Bexhill in 1884)."
			}, {
				"name": "St Patrick's Crescent",
				"date": "road 1932; name 1935",
				"desc": "Patron saint of Ireland. This crescent was previously known as Crowmere Crescent. (St Andrews Road, St Davids Avenue and St Georges Road are nearby). (Adopted by Borough of Bexhill 24th September 1934)."
			}, {
				"status": "bygone",
				"name": "St Patricks Road",
				"date": "1902 to 1917",
				"desc": "Part of the original Woodsgate Park Estate. Street directories only describe this road as building land. Location uncertain as it is simply described as left of St Georges Road, which at that time included the present-day Woodsgate Park, so was probably in the area of the present-day Beatrice Walk."
			}, {
				"name": "St Peter's Crescent",
				"date": "1956",
				"desc": "St Peter's Church, Bexhill Old Town, is nearby. (Lychgates Close, Rectory Way and Church Vale Road are nearby). (Adopted by Borough of Bexhill, 1st part 1st March 1961 and last part 21st December 1964)."
			}, {
				"name": "St Peters Road",
				"date": "before 1880",
				"desc": "This name, instead of Sea Road, is often found on legal documents until the late 1880s."
			}, {
				"status": "bygone",
				"name": "St Stephens Road",
				"date": "1903 to 1917",
				"desc": "Although called Church Road on some maps, this road was part of the Woodsgate Park Estate near St Stephen's Church close to the present-day Park Lane."
			}, {
				"name": "St. Leonards Road",
				"date": "1887",
				"desc": "St Leonards-on-Sea is part of the western side of Hastings, East Sussex, 4 miles east of Bexhill. (Adopted by Borough of Bexhill 16th December 1895)."
			}, {
				"name": "Stable Mews",
				"date": "2021",
				"desc": "Formerly horse riding stables."
			}, {
				"name": "Station Road",
				"date": "road c1850; name 1910",
				"desc": "The present-day road runs from Sea Road to Buckhurst Place by the side of the railway station and line. It was previously known as Station Road then Upper Station Road. The section by the old railway goods yard, which is the present-day Sainsbury's car park, was called Depot Road until the late 1920s. (Adopted at an unknown date as a publicly maintainable highway under the 1835 Highways Act)."
			}, {
				"status": "bygone",
				"name": "Station Road North",
				"date": "1889 to 1898",
				"desc": "The present-day London Road from King Offa's crossroads towards Sidley was originally called Station Road North. Later this road was renamed North Street before finally becoming part of a much longer present-day London Road. (Please see also Alexandra Road, North Street, Sandhurst Road and Spa Road)."
			}, {
				"name": "Station Road {1}",
				"date": "road c1850; name 1888",
				"desc": "The first Station Road, when the railway station was on the north side of the tracks close to the present-day Sainsbury's car park, ran from Sea Road along the present-day Station Road, through Buckhurst Place and along the present-day London Road to the King Offa Way crossroads. It incorporated the existing Russells Lane. In about 1888 Station Road {1} was then split into Station Road {2} and Upper Station Road."
			}, {
				"status": "bygone",
				"name": "Station Road {2}",
				"date": "road c1850; name 1889 to 1898",
				"desc": "From 1889, Station Road was the part of present-day London Road from Buckhurst Place to where King Offa Way crossroads is now. Later this road was called Lower Station Road before becoming part of London Road."
			}, {
				"status": "bygone",
				"name": "Station Square",
				"date": "1887 to 1910",
				"desc": "This square was originally known as Station Yard and then Station Square from about 1887. Interestingly the new railway station on the south side of the tracks which opened into this square was not completed until 1891, four years after this name was adopted. The square changed to Devonshire Place in 1910 but is now known as Devonshire Square."
			}, {
				"name": "Stevens Close",
				"date": "c2000",
				"desc": "Councillor Allan Sidney John Stevens was Bexhill Borough Mayor (1964 to 1965) and Town Mayor of Bexhill (1984 to 1985). (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Stirling Mews",
				"date": "2005",
				"desc": "Perhaps a link to Bexhill being the birthplace of motor racing the road was named after the Formula One driver, Sir Stirling Moss. Stirling is also the name of a city in central Scotland."
			}, {
				"name": "Stowe Drive",
				"date": "2022",
				"desc": "Stowe Corner is turn fifteen at Silverstone racing circuit, Northamptonshire. It takes its name from from a nearby landmark: Stowe School, which lies just south of the circuit."
			}, {
				"name": "Suffolk Road",
				"date": "1899",
				"desc": "English county in East Anglia. (Norfolk Close, and previously Norfolk Road, is nearby). (Adopted by Borough of Bexhill 23rd December 1907)."
			}, {
				"name": "Summer Hill Road",
				"date": "1975",
				"desc": "The origin of the name remains uncertain. R A Larkin and Bros Ltd were major developers and house builders in Bexhill between 1924 to 1988. They developed this road together with Primrose Hill and Roselands. Maybe the road is named after Summer Hill, a small area of East Sussex between Hailsham and Polegate adjacent to the Cuckoo Trail. Alternatively, it is the name of a suburb, 8 km west of Sydney, Australia; Roselands is also near Sydney and Larkins often named their roads after favourite holiday destinations. (Primrose Hill and Roselands are nearby). (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Sunningdale Close",
				"date": "after 1974 but before 1995",
				"desc": "Village in Berkshire with famous golf club. This close is built near the former Bexhill Golf Club Course on Galley Hill and adjacent land north of the railway line. (Gleneagles Close and The Links are nearby). (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Sussex Close",
				"date": "1968",
				"desc": "County in south-east England. (Adopted by Borough of Bexhill 30th April 1973)."
			}, {
				"name": "Sutherland Avenue",
				"date": "1901",
				"desc": "The origin of the name remains uncertain. Maybe there is an unidentified link to the Dukes of Sutherland in Scotland, remembering Hamilton Terrace, also with possible Scottish links, was developed at the same time. The present-day footbridge at Collington Station was built in 1920 to replace the level crossing. A remnant of Sutherland Avenue leading from Cooden Drive to the railway station can still be seen. (Adopted by Borough of Bexhill from Collington Avenue to railway 30th November 1925. Also part adopted at an unknown date as a publicly maintainable highway under the 1835 Highways Act)."
			}, {
				"name": "Sutherland Close",
				"date": "1962",
				"desc": "The origin of the name remains uncertain. Maybe there is an unidentified link to the Dukes of Sutherland in Scotland. (Adopted by Borough of Bexhill 3rd January 1962)."
			}, {
				"name": "Sutton Place",
				"date": "1969",
				"desc": "Sutton is a borough in south London. All the names of the apartment blocks in this development (Ashtead Towers, Cobham Towers, Epsom Court, Ewell Court, Merton Court, Oxshott Court, Tilford Court and Wallington Towers) are locations in either south London or north Surrey. The name of this site's developer is not known but maybe they had connections with London. (Date of adoption by Borough of Bexhill and later East Sussex County Council not known)."
			}, {
				"name": "Sycamore Close",
				"date": "1972",
				"desc": "Sycamore trees belong to the genus Acer. They have a number of common names including fake plane-trees, mock-plane and Scottish or Celtic maple. (Chestnut Walk, Oakleigh Road and Willow Drive are nearby). (Date of adoption by Borough of Bexhill and later East Sussex County Council not known)."
			}, {
				"name": "Sycamore Walk",
				"date": "c2010",
				"desc": "Sycamore trees belong to the genus Acer. They have a number of common names including fake plane-trees, mock-plane and Scottish or Celtic maple. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Tamarisk Gardens",
				"date": "2007",
				"desc": "Tamarisks or salt cedars are evergreen or deciduous shrubs and trees belonging to the genus Tamarix. They are suited to the south English seashores. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Tanglewood Coppice",
				"date": "c2000",
				"desc": "A house called Tanglewood was built near here in about 1915 and remains to this day. This development was built within the grounds of the house. A coppice is a dense thicket of trees and bushes. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Tangmere Close",
				"date": "1968",
				"desc": "Village in West Sussex, 3 miles north-east of Chichester. (Adopted by Borough of Bexhill 20th December 1971)."
			}, {
				"name": "Terminus Avenue",
				"date": "1911",
				"desc": "Adjacent to Bexhill West Station, the terminus of the railway branch line from Crowhurst to Bexhill, opened in 1902, and closed in 1964. (Adopted by Borough of Bexhill 30th November 1925)."
			}, {
				"name": "Terminus Road",
				"date": "road 1892; name 1903",
				"desc": "Adjacent to Bexhill West Station, the terminus of the railway branch line from Crowhurst to Bexhill, opened in 1902, and closed in 1964. Previously known as Sackville Road North and then Reginald Place. (Adopted at an unknown date as a publicly maintainable highway under the 1835 Highways Act)."
			}, {
				"name": "Thakeham Close",
				"date": "c1975",
				"desc": "Village in West Sussex, 2 miles north-east of Storrington. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "The Barnhams",
				"date": "1964",
				"desc": "Alternative name for Barnhorn. The field on which the estate was built is called the Barnhams on a tithe map / schedule of 1839 / 1843. (Adopted by Borough of Bexhill 10th August 1970)."
			}, {
				"name": "The Briary",
				"date": "after 1974 but before 1986",
				"desc": "Descriptive name for a place full of briars, prickly shrubs or wild rosebushes. This development is built on woodland surrounding a large property and grounds called Wrest Wood, the former home of the British diplomat, Sir Edward Malet (1837 to 1908). St Mary's School and College is now on the Wrest Wood site. (The Glades and Wychurst Gardens are nearby). (Adopted by East Sussex County Council, 1st March 1986)."
			}, {
				"name": "The Broadwalk",
				"date": "1930",
				"desc": "Descriptive name for this wide street with a pleasant view of countryside at its end. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "The Byeway",
				"date": "1930",
				"desc": "Byeway means a secluded or private sideroad. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"status": "bygone",
				"name": "The Common",
				"date": "1891 to 1917",
				"desc": "The present-day Little Common roundabout (A259) was previously a grassy village green. Early street directories list the properties as being around The Common."
			}, {
				"name": "The Covert",
				"date": "after 1987 but before 1993",
				"desc": "Covert means hidden or secret and this street could be considered to be hidden away. This land was once the location of Caledonia School for Girls (1913-1937), which became Portsdown Lodge School (1937-1964). (Adopted by East Sussex County Council, 1st April 1993)."
			}, {
				"name": "The Down",
				"date": "before 1841",
				"desc": "In early records, houses and buildings along both Down Road and West Down Road were simply recorded as being on \"The Down\"."
			}, {
				"name": "The Fairway",
				"date": "1962",
				"desc": "In golf the fairway is the smooth turf between the tee and the green, distinguished from the uncut rough grass. This road is situated near the Highwoods golf course. (Adopted by Borough of Bexhill 15th March 1965)."
			}, {
				"name": "The Finches",
				"date": "(after 1974 but before 1995",
				"desc": "Finches are perching birds of the family Fringillidae and are predominately seed-eating song birds. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "The Glades",
				"date": "1967",
				"desc": "Glades can mean an open space in a wood. This development is built on woodland surrounding a large property and grounds called Wrest Wood, the former home of the British diplomat, Sir Edward Malet (1837 to 1908). St Mary's School and College is now on the Wrest Wood site. (The Briary and Wychurst Gardens are nearby). (Adopted by Borough of Bexhill 8th November 1971)."
			}, {
				"name": "The Gorses",
				"date": "1933",
				"desc": "Gorse belongs to the genus Ulex and comprises around 20 species of thorny evergreen shrubs. (Adopted by Borough of Bexhill 4th November 1968)."
			}, {
				"name": "The Gorseway",
				"date": "1929",
				"desc": "Gorse belongs to the genus Ulex and comprises around 20 species of thorny evergreen shrubs. (Adopted by Borough of Bexhill, 1st part 29th March 1961 and 2nd part 16th August 1965)."
			}, {
				"name": "The Grove",
				"date": "1959",
				"desc": "Grove can mean a small wood and the Pinewoods is nearby. (Adopted by Borough of Bexhill 24th October 1962)."
			}, {
				"name": "The Highlands",
				"date": "1925",
				"desc": "The Highlands is an area of high ground bordered by Turkey Road, Ninfield Road and Bexhill Cemetery. (Adopted by Borough of Bexhill 30th March 1960)."
			}, {
				"status": "bygone",
				"name": "The Honies",
				"date": "before 1886 to 1898",
				"desc": "Prince Albert of Saxe-Coburg and Gotha (1819 to 1861) was, as The Prince Consort, the husband of Queen Victoria. The original Albert Road and Victoria Road ran parallel to each other off Springfield Road and Alexandra Road (now part of London Road) on the former Honies estate. From 1899 this Albert Road has been known as Havelock Road. Curiously it appears that between about 1887 and 1898 there were two roads called Albert Road at the same time in Bexhill."
			}, {
				"name": "The Mead",
				"date": "1962",
				"desc": "Mead means a meadow and probably reflects that this area is former farming land. (Adopted by Borough of Bexhill 5th July 1965)."
			}, {
				"name": "The Mews",
				"date": "2009",
				"desc": "Originally a mews was a street or yard of stables often converted into dwelling-houses or garages. The name is often used now for a small modern development of houses either as a terrace or around a court-yard. At present no past links to horses or livery stables in this part of the former Nazareth House site have been identified. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"status": "bygone",
				"name": "The Newlands",
				"date": "1905 to 1929",
				"desc": "Described in the street directories as between the Down Hill and Gunters Lane. The road had become part of Gunters Lane by 1930."
			}, {
				"name": "The Ridings",
				"date": "1970",
				"desc": "Ridings means a track through woodland suitable for horse-riding; Clinchgreen Wood is nearby. (Adopted by Borough of Bexhill 30th April 1973)."
			}, {
				"name": "The Shrublands",
				"date": "1968",
				"desc": "Descriptive name for an area of vegetation characterised by shrubs, grasses and herbs. Maybe this was a good description of the area before it was developed. (Adopted by Borough of Bexhill 26th April 1971)."
			}, {
				"name": "The Sidings",
				"date": "2014",
				"desc": "This development has been built on the site of a former oil storage depot and railway sidings. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "The Spinney",
				"date": "1968",
				"desc": "There was previously a spinney, which is a small wood or thicket, near here. (Date of adoption by Borough of Bexhill or later East Sussex County Council not known)."
			}, {
				"name": "The Twitten",
				"date": "road ~1841; name 1935",
				"desc": "Twitten is a Sussex dialect word for a narrow path between two walls or hedges. The outline of this narrow road near Little Common roundabout can be seen on an Ordnance Survey map of 1795 to 1825. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Third Avenue",
				"date": "1950",
				"desc": "Ordinal number. (First and Second Avenues are nearby). (Adopted by Borough of Bexhill, 1st part 26th June 1957 and last part 20th January 1958)."
			}, {
				"name": "Thornbank Crescent",
				"date": "1970",
				"desc": "Near here the former independent school called Thornbank School for Girls was opened by the Misses Bidwell and Mills in about 1911 before closing in the early 1940s. The school had originally started as the Thornbank School for Young Ladies in Buckhurst Road in about 1902. (Adopted by Borough of Bexhill 18th September 1972)."
			}, {
				"name": "Thorne Close",
				"date": "2018",
				"desc": "Thorne Farm, which belonged to Thomas de Thorne in 1296, is further along Ninfield Road towards Ninfield."
			}, {
				"name": "Thorne Crescent",
				"date": "1935",
				"desc": "Thorne Farm, which belonged to Thomas de Thorne in 1296, is further along Ninfield Road towards Ninfield. (Date of adoption by Borough of Bexhill or later East Sussex County Council not known)."
			}, {
				"name": "Ticehurst Avenue",
				"date": "1972",
				"desc": "Village in East Sussex, 10 miles south-east of Tunbridge Wells. The final part of this road has been called Principal Close from about 1995. (No information is available as to whether this road is adopted or not)."
			}, {
				"name": "Ticehurst Close",
				"date": "after 1974 but before 1995",
				"desc": "Village in East Sussex, 10 miles south-east of Tunbridge Wells. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Tilgate Drive",
				"date": "c1975",
				"desc": "A neighbourhood within the town of Crawley, West Sussex. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Tiverton Drive",
				"date": "1974",
				"desc": "The origin of the remains unknown. There are towns in Devon and Cheshire called Tiverton but with no known links to Bexhill. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Top Cross Road",
				"date": "1956",
				"desc": "Descriptive name for the road which runs between Buckholt Avenue and Filsham Drive across the top of the eastern side of Pebsham housing estate. (Date of adoption by Borough of Bexhill or later East Sussex County Council not known)."
			}, {
				"name": "Town Hall Square",
				"date": "~1881",
				"desc": "Unofficial, but often used, name for Buckhurst Place."
			}, {
				"name": "Trinity Trees",
				"date": "c1995",
				"desc": "A small development of three bungalows surrounded by trees. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Tulip Way",
				"date": "2022",
				"desc": "Tulip is the common name of a species of flowering plants belonging to the Liliaceae family. (Bluebell Close, Buttercup Close, Clover Way, Daisy Way, Daffodil Way, Foxglove Avenue, Snowdrop Way and Orchid Way are nearby)."
			}, {
				"name": "Turkey Road",
				"date": "road ~1841; name 1913",
				"desc": "Turkey Wood was originally part of High Woods between Peartree Lane and St Marys Lane to the north of this road. Named after the Turkey Oak trees that lined the road. Travelling West, beyond the brickworks, the road is still lined with Turkey Oaks. Turkey Oaks are recognisable from their knarled branches and twisted trunks, and generally much smaller than the magnificent English Oak. Most of the wood has now been lost to the clay pits of the brickworks. There is still a Turkey Farm to the north-east of Bexhill Cemetery. The outline of the road can be seen on an Ordnance Survey map 1795 to 1825 and, in early street directories, was included as part of Gunters Lane. (Taken over as a Public Highway by the Local Board of Bexhill in 1884. Also adopted at an unknown date as a publicly maintainable highway under the 1835 Highways Act)."
			}, {
				"name": "Turner Close",
				"date": "after 1974 but before 1995",
				"desc": "J M W Turner (1775 to 1851) was an English Romantic landscape painter, water-colourist and printmaker. (Constable Way, Gainsborough Road and Reynolds Drive are nearby). (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Tyndale Avenue",
				"date": "after 1974 but before 1996",
				"desc": "William Tyndale (c1494 to 1536) was the first to translate considerable parts of the Bible into English. The land here was previously owned by The British and Foreign Bible Society. (Coverdale Avenue is nearby). (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Uplands Close",
				"date": "1954",
				"desc": "Uplands mean upper or high land and this close is on part of the higher ground of Glenleigh Park. (There is an interconnecting footpath with Homelands Close). (Adopted by Borough of Bexhill 24th May 1957)."
			}, {
				"status": "bygone",
				"name": "Upper Dorset Road",
				"date": "1897 to 1906",
				"desc": "This road ran from the present-day De La Warr Road to Hastings Road. (Please see Dorset Roads {1}, {2} and {3})."
			}, {
				"name": "Upper Sea Road",
				"date": "road ~1841; name 1899",
				"desc": "In about 1899 the original Sea Road was divided into two parts; Sea Road and Upper Sea Road. Upper Sea Road runs from the present-day Station Road to High Street in Bexhill Old Town. This section of road has been referred to as Sea Hill in the past. (Please see Sea Road and Lower Sea Road). (Taken over as a Public Highway by the Local Board of Bexhill in 1884. Part adopted at an unknown date as a publicly maintainable highway under the 1835 Highways Act). (Foot passage between Upper Sea Road and Rotherfield Avenue adopted by Borough of Bexhill 24th March 1954)."
			}, {
				"status": "bygone",
				"name": "Upper Station Road",
				"date": "road c1850; name 1889 to 1910",
				"desc": "Previously known as Station Road {1} this road from Sea Road to Buckhurst Place then became Upper Station Road. It is now known as Station Road {3}. (Please see also Lower Station Road and Station Roads {1} {2} {3})."
			}, {
				"name": "Veness Gap",
				"date": "early 1800s",
				"desc": "A gap in the cliff that gives access to the beach. Once part of the Pages Farm estate, which stood a quarter of a mile inland near what is now Pages Lane. Before the railway was built in 1847, three lime kilns and a cottage were at this location, the lime burner was called Veness."
			}, {
				"name": "Venture Close",
				"date": "c1975",
				"desc": "Road developed by Venture Estates Ltd. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Victoria Road",
				"date": "road 1887; name 1893",
				"desc": "Victoria Hall was opened in 1887 on this road, which was then called Windsor Terrace, during Queen Victoria's golden jubilee. The name was transferred in 1893 from the road which is now known as Cambridge Road. (Adopted by Borough of Bexhill, 1st part 21st November 1898 and last part 17th September 1900)."
			}, {
				"status": "bygone",
				"name": "Victoria Road {1}",
				"date": "before 1886 to 1898",
				"desc": "Named after Victoria (1819 to 1901) who was Queen of Great Britain and Ireland (1837 to 1901). The original Albert Road and Victoria Road ran parallel to each other off Springfield Road and Alexandra Road (now part of London Road) on the former Honies Estate. From 1899 this Victoria Road has been known as Cambridge Road. Curiously it appears that between about 1894 and 1898 there were two roads called Victoria Road at the same time in Bexhill. The Record Reign Cottages commemorating Queen Victoria's Diamond Jubilee in 1897 can still be seen in the present-day Cambridge Road."
			}, {
				"name": "Village Close",
				"date": "c1994",
				"desc": "To be found near the centre of Little Common village. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Village Mews",
				"date": "1986",
				"desc": "To be found near the centre of Little Common village. Originally a mews was a street or yard of stables often converted into dwelling-houses or garages. The name is often used now for a small modern development of houses either as a terrace or around a court-yard. There was formerly a forge and smithy in this area hence its previous association with horses. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Wainwright Road",
				"date": "after 1974 but before 1998",
				"desc": "H S Wainwright (1864 to 1925) was Chief Mechanical Engineer of the South Eastern and Chatham Railway from 1899 to 1913. This road is close to the former Bexhill West railway station and is on the site of the former railway goods yard. (No information is available as to whether this road is adopted or not)."
			}, {
				"name": "Wakehams Close",
				"date": "c2003",
				"desc": "Wakehams Farmhouse still stands at the top of Holliers Hill near the junction with London Road. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Walton Park",
				"date": "1933",
				"desc": "R A Larkin and Bros Ltd were major developers and house builders in Bexhill between 1924 to 1988. Before moving to Bexhill, Reg Larkin worked in Warrington, a town between Liverpool and Manchester. Here he also met his future wife who lived in the Stockton Heath district of Warrington. Walton is a parish on the south-west edge of Warrington and next to Stockton Heath. Walton Hall and gardens is now a Grade II listed country house built between 1836 to 1838 for the brewer, Sir Gilbert Greenall. It is likely that Reg Larkin named this development after his earlier links with Warrington. (Adopted by Borough of Bexhill 22nd July 1935)."
			}, {
				"name": "Wannock Close",
				"date": "1975",
				"desc": "Village in East Sussex, 1 mile south of Polegate. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Ward Way",
				"date": "1954",
				"desc": "Norman Ward was company secretary to R A Larkin and Bros Ltd who were major developers and house builders in Bexhill between 1924 to 1988. There is an apocryphal story that Mr Ward once asked for a salary rise which Reg Larkin refused but instead offered to name one of the streets he was developing after Mr Ward. (Adopted by Borough of Bexhill 26th March 1958)."
			}, {
				"name": "Warnham Gardens",
				"date": "1968",
				"desc": "Village in West Sussex, 2 miles north-west of Horsham. (Date of adoption by Borough of Bexhill or later East Sussex County Council not known)."
			}, {
				"name": "Wartling Drive",
				"date": "1972",
				"desc": "Village in East Sussex, 5 miles west of Bexhill. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Warwick Road",
				"date": "1911",
				"desc": "The origin of the name remains unknown. Although this is the name of a county-town in the West Midlands as well as a long-established earldom, no identifiable association with Bexhill has yet been established. (Adopted by Borough of Bexhill 30th November 1925)."
			}, {
				"name": "Watergate",
				"date": "1969",
				"desc": "There was a former watermill near here which, before the use of electricity, would need a gate to control the water flow which provided the power to the mill. The Borough of Bexhill adopted Watergate Close on 1st February 1970 although this name does not appear in local street directories or on recent maps; it is unclear if it was intended to call the present-day Watergate by this other name. Also the Borough of Bexhill adopted Watergate (footpath) on 16th August 1971 but it is also unclear whether this represents the present-day road. (Watermill Close and Lane are nearby). (Probably adopted by Borough of Bexhill on either 1st February 1970 or 16th August 1971)."
			}, {
				"name": "Watermill Close",
				"date": "1950",
				"desc": "There used to be a watermill near here. (Watergate and Watermill Lane are nearby). (Constructed or taken over by Borough of Bexhill under special provisions, ie Council Housing Estates, by at least 1956)."
			}, {
				"name": "Watermill Lane",
				"date": "~1841",
				"desc": "Lane leads from Sidley to Henley Down over Watermill Stream bridge where there was a mill. (Watergate and Watermill Lane are nearby). The outline of the lane can be seen on an Ordnance Survey map of 1795 to 1825. In early street directories the area along Watermill Lane around Preston Hall, Lodge and Cottage is often simply called Preston. (Adopted at an unknown date as a publicly maintainable highway under the 1835 Highways Act)."
			}, {
				"name": "Wealden Way",
				"date": "1935",
				"desc": "The Weald is an area of south-east England, including Bexhill, between the North and South Downs. The name in Old English means “woodland”. (Adopted by Borough of Bexhill 23rd December 1963)."
			}, {
				"name": "Well Wish Drive",
				"date": "2017",
				"desc": "Possibly a reference to the Well and Pumping Station that used to be adjacent to Wrestwood Road, the drain of which still passes next do this road."
			}, {
				"name": "Wellesley Close",
				"date": "after 1974 but before 1995",
				"desc": "Major-General Sir Arthur Wellesley, later the Duke of Wellington, commanded a Brigade at Hastings in 1806 and may well have visited the King's German Legion in Bexhill during that time. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Wentworth Close",
				"date": "after 1974 but before 1995",
				"desc": "Wentworth is a championship golf course in Virginia Water, Surrey. Also around Bexhill may be found the names of other famous golf courses; (Royal) Birkdale, Gleneagles Close and Sunningdale Close. There is also a Links Drive. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "West Cliff Drive",
				"date": "before 1906",
				"desc": "Recorded on a 1906 map as part of the present-day West Parade."
			}, {
				"name": "West Down Road",
				"date": "~1841",
				"desc": "Old parish road on the west side of Bexhill Down. The outline of the road can be seen on an Ordnance Survey map 1795 to 1825. (Taken over as a Public Highway by the Local Board of Bexhill in 1884)."
			}, {
				"name": "West Parade",
				"date": "road 1886; name 1904",
				"desc": "On the western side of Bexhill's seafront. The part between Park Road and the Marina roundabout was originally known as Park Crescent then as Marine Crescent until about 1923. Early maps also record the whole length of the present-day West Parade as Lower Marine Parade (1893), Parade Extension (1896) and West Cliff Drive (1906). The part from Park Road to Richmond Road was usually called West Parade from about 1904. (Adopted at an unknown date as a publicly maintainable highway under the 1835 Highways Act). ([1] Road passage south of Egerton Road linking Brockley Road and Park Avenue, serving Egerton Road and West Parade residences, adopted by Borough of Bexhill 24th November 1930. [2] Road passage south of Egerton Road and east of Park Road linking Park Road and Egerton Road, serving Egerton Road and West Parade residences and [3] Road passage south of Egerton Road and west of Park Road linking Park Road and Egerton Road, serving Egerton Road and West Parade residences, both adopted by Borough of Bexhill 22nd July 1935)."
			}, {
				"status": "bygone",
				"name": "West Station Approach",
				"date": "c1940 to after 1974",
				"desc": "Bexhill West Station, as the terminus for the railway branch line from Crowhurst to Bexhill, opened in 1902 and closed in 1964. This approach road off Terminus Road served the station as well as several local businesses and was still being recorded in local street directories at least 10 years after the station closed."
			}, {
				"name": "Westaway Drive",
				"date": "1934",
				"desc": "Jethro Arscott (1873 to 1946) was a well-known local baker who owned land off Holmesdale Road. There he built a house (Westgarth) and the access road, Westaway Drive, was named after his mother's maiden name. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Westcourt Drive",
				"date": "road 1908; name 1925",
				"desc": "The origin of the name remains uncertain. The road was developed at a similar time to Southcourt Avenue and maybe the two names are linked. However it is unclear what or where these two roads may be “south” and “west” of. The answer would be Collington Wood if the drive was called “Eastcourt Drive”. Originally Richmond Avenue ran from the cattle arch under the railway line, across Cooden Drive and then as far as its junction with Richmond Road. The section of present-day Westcourt Drive from the cattle arch to Collington Avenue was only a footpath until the early 1920s. Then during redevelopment the existing single-track cattle arch was enlarged to allow vehicles to pass under the line. This arch, as well as ones at Cooden Beach, Sackville Road and Glyne Gap, had been established to enable farmers north of the railway line to move their stock to summer grazing on the low-lying marshland to the south of the railway. (Adopted by Borough of Bexhill 30th June 1969)."
			}, {
				"name": "Western Mews",
				"date": "1886",
				"desc": "A small residential cul-de-sac on the north-east side of Western Road. (This road had not been adopted by East Sussex County Council by December 2020)"
			}, {
				"name": "Western Road",
				"date": "1886",
				"desc": "Leads in a westerly direction away from Devonshire Square, the “centre” of town. From 1887 to 1896 the road is described as running from Devonshire Road to Sackville Road but in 1897 and 1898 the road reaches as far as the northern entrance to Egerton Park. (Adopted by Borough of Bexhill 1st June 1894). (Road passage west of Devonshire Road linking Parkhurst Road and Western Road, serving Devonshire Road, Parkhurst Road and Western Road properties, adopted by Borough of Bexhill 29th January 1912)."
			}, {
				"name": "Westham Close",
				"date": "1968",
				"desc": "Village in East Sussex, 5 miles north-east of Eastbourne. (Adopted by Borough of Bexhill 3rd February 1969)."
			}, {
				"name": "Westville Road",
				"date": "1913",
				"desc": "Probably the name refers to a group of houses to the west of the town centre. It draws similarities to the French words ouest for west and ville for town. (Adopted by Borough of Bexhill 27th May 1935)."
			}, {
				"status": "bygone",
				"name": "Whillier Street",
				"date": "1897 to 1898",
				"desc": "The original name of Edinburgh Road. Ralph Whillier, carpenter, is recorded as living at 4, Edinburgh Road in 1899 but not any earlier."
			}, {
				"name": "White Hill Avenue",
				"date": "1930",
				"desc": "The origin of the name White Hill is uncertain but one suggestion is that the salt recovered from the inflow of tidal salt water over Pevensey Levels would be carried inland on carts and some of the salt could have spilt onto the ground as the carts travelled over this rising land towards the Old Town. (Adopted by Borough of Bexhill 1st May 1967)."
			}, {
				"name": "White Hill Drive",
				"date": "1928",
				"desc": "The origin of the name White Hill is uncertain but one suggestion is that the salt recovered from the inflow of tidal salt water over Pevensey Levels would be carried inland on carts and some of the salt could have spilt onto the ground as the carts travelled over this rising land towards the Old Town. (Adopted by Borough of Bexhill 28th June 1961)."
			}, {
				"name": "Whitehill",
				"date": "before 1841",
				"desc": "An area of east Bexhill along the present-day Little Common Road between Bexhill Down to near The Denbigh public house and restaurant. This area also includes the former Hurchington estate which now forms part of the Broadoak estate. White Hill Field is recorded on a tithe map c1843. Early street directories make a distinction between Whitehill and Whitehill Lane but without clearly stating the differences in location. The origin of the name White Hill is uncertain but one suggestion is that the salt recovered from the inflow of tidal salt water over Pevensey Levels would be carried inland on carts and some of the salt could have spilt onto the ground as the carts travelled over this rising land towards the Old Town."
			}, {
				"status": "bygone",
				"name": "Whitehill Lane",
				"date": "before 1841 to 1926",
				"desc": "Early street directories make a distinction between Whitehill and Whitehill Lane but without clearly stating the differences in location. The lane is an old parish lane of which part is now called Ellerslie Lane. The outline of the lane can be seen on an Ordnance Survey map 1795 to 1825."
			}, {
				"name": "Whitehouse Avenue",
				"date": "1935",
				"desc": "Built on land forming part of the former Whitehouse Farm which was originally called Nepps after its 16th century owner. The white farmhouse (built 1556) can still be seen in Pembury Grove opposite the junction with Whitehouse Avenue. (Adopted by Borough of Bexhill 22nd July 1935)."
			}, {
				"name": "Whydown Road",
				"date": "~1841",
				"desc": "The road that leads through Whydown on the north-western side of Bexhill, close to the former manor of Gotham. The name may be derived from swinhamme meaning a pig enclosure. The outline of the road can be seen on an Ordnance Survey map 1795 to 1825. In some early street directories this road was called Hooe Road until about 1917 whereas in other street directories this road has always been called Whydown Road. (Adopted at an unknown date as a publicly maintainable highway under the 1835 Highways Act)."
			}, {
				"name": "Wickham Avenue",
				"date": "1897",
				"desc": "John Webb (1840 to 1922) was a surveyor and builder from Brockley, a district of south London located in the Borough of Lewisham. Mr Webb was responsible for developing much of the land south of the railway between Sea Road and the Polegrove. Wickham Road has been, and remains, a major route through Brockley in south London. The Wickham Arms in Brockley is considered to be one of the oldest public houses in south-east London. In 1897 the section of this avenue from present-day Park Road to Sackville Road was considered an extension of Western Road. (Adopted by Borough of Bexhill, 1st part 1st November 1898, 2nd part 17th September 1900, 3rd part 26th September 1904 and last part 24th July 1922)."
			}, {
				"name": "Wilkins Way",
				"date": "1988",
				"desc": "This development is named after its builder; no other details are known. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Willingdon Avenue",
				"date": "1937",
				"desc": "Mr Freeman Freeman-Thomas (1866 to 1941) was Member of Parliament for Hastings, which at that time included Bexhill, from 1900 to 1906. He was later created 1st Marquess of Willingdon. Formerly a separate village in East Sussex, Willingdon is now part of Eastbourne. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Willow Drive",
				"date": "1937",
				"desc": "Willows are deciduous trees and shrubs belonging to the genus Salix. There are about 400 species usually found growing in moist soils. There is a stream running past the end of this drive. (Chestnut Walk, Oakleigh Road and Sycamore Close are nearby). (Adopted by Borough of Bexhill, 1st part 16th August 1965 and last part 29th April 1968)."
			}, {
				"name": "Wilton Road",
				"date": "1886",
				"desc": "The origin of the name remains unknown. There are six villages in the United Kingdom called Wilton but none in south-east England. A link to Wilton House near Salisbury, Wiltshire, and the ancestral home of the Earls of Pembroke has also not been identified. (Adopted by Borough of Bexhill 1st June 1894)."
			}, {
				"name": "Winceby Close",
				"date": "c1995",
				"desc": "Near here the former independent school called Winceby House School was opened for girls in 1927. The school had moved during the 1920s to Bexhill from Cambridgeshire. In 1966 the school buildings became an Inner London Education Authority home for disadvantaged boys finally closing in the 1980s. From 1927 the former South Cliff Drive ran from Cooden Drive down to Winceby House School. Later, to prevent traffic congestion, a separate drive connected the school to the present-day South Cliff. Part of this second drive is now incorporated into Winceby Close. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Windmill Drive",
				"date": "1958",
				"desc": "Road along a former old track leading from Sidley to the Down or Hoad's Mill on Gunters Lane. (Adopted by Borough of Bexhill, 1st part 29th October 1958 and last part 15th March 1965)."
			}, {
				"status": "bygone",
				"name": "Windsor Crescent",
				"date": "before 1886 to 1887",
				"desc": "Previous name for the section of road which ran from the former Castle Hotel, now The Town House, on the corner of present-day Buckhurst Place and London Road, up Windsor Road and then along the present-day Victoria Road towards London Road. In 1887 it was renamed Windsor Terrace."
			}, {
				"name": "Windsor Road",
				"date": "~1886",
				"desc": "Reginald Windsor Sackville (1817 to 1896) was the 7th Earl De La Warr. (Reginald Road is nearby). (Adopted by Borough of Bexhill, 1st part 1st June 1894, 2nd part 21st November 1898 and last part 17th September 1900). ([1] Foot passage to west of London Road and south of Victoria Road running from Victoria Road towards Buckhurst Place (but not a thoroughfare), serving Windsor Road and London Road residences. [2] Foot passage to west of Windsor Road and south of Victoria Road linking Victoria Road to Terminus Road, serving Windsor Road and Reginald Road residences. [3] Foot passage to west of Windsor Road and north of Victoria Road linking Victoria Road to the present-day Phoenix Works off Windsor Road, serving Windsor Road and Reginald Road residences, all three passages adopted by Borough of Bexhill 20th December 1909)."
			}, {
				"status": "bygone",
				"name": "Windsor Terrace",
				"date": "1887 to 1898",
				"desc": "Previously called Windsor Crescent."
			}, {
				"name": "Wineham Way",
				"date": "1974",
				"desc": "Village in West Sussex, 3 miles north-west of Hurstpierpoint. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Winston Drive",
				"date": "1956",
				"desc": "Sir Winston Churchill (1874 to 1965) British politician and statesman, he was twice British Prime Minister. (Alexander Drive and Eden Drive are nearby). (Adopted by Borough of Bexhill 27th June 1962)."
			}, {
				"name": "Withyham Road",
				"date": "1924",
				"desc": "Village in East Sussex, 10 miles south-west of Tunbridge Wells. Buckhurst Park, the ancestral home of the Sackville family since the 16th century, is situated near Withyham. This road is now continuous with Hawkhurst Way which was developed in 1961. (Adopted by Borough of Bexhill 4th November 1968)."
			}, {
				"name": "Woodcote Way",
				"date": "2021",
				"desc": "Woodcote Corner is turn eight at Silverstone racing circuit, Northamptonshire. It takes its name from Woodcote Park, an RAC-owned club in Surrey. (Becketts Close, Brooklands Road, Cascades Way, Clervaux Close, Druids Close, Gracelands Drive, Luffield Drive and Paddock Way are nearby)."
			}, {
				"name": "Woodland Rise",
				"date": "1968",
				"desc": "Descriptive name for this road which is built on a slope near Penland Wood. (Adopted by Borough of Bexhill 2nd November 1970)."
			}, {
				"name": "Woodlands",
				"date": "2006",
				"desc": "Descriptive name for land covered with wood; this road is located near the bottom of High Woods. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Woodsgate Avenue",
				"date": "road 1901; name c1935",
				"desc": "The estate first appears in local street directories in 1894 when Woodsgate House and Park were completed. Thereafter there is a confusing list of road names in the street directories and on maps as the estate is developed on both sides of the Bexhill to Crowhurst railway branch line which opened in 1902. Often there were a number of years between a road being laid out and named and properties being built on that road. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"status": "bygone",
				"name": "Woodsgate Avenue East",
				"date": "c1908 to c1934",
				"desc": "This avenue was generally to the east of the present-day London Road and probably includes most of the present-day Woodsgate Avenue."
			}, {
				"status": "bygone",
				"name": "Woodsgate Avenue Road",
				"date": "1901 to c1910",
				"desc": "This avenue ran parallel of the present-day Woodsgate Park. The road joined Gunters Lane approximately along the present-day entrance to Charters Ancaster School."
			}, {
				"status": "bygone",
				"name": "Woodsgate Avenue West",
				"date": "c1908 to c1934",
				"desc": "This avenue was generally to the west of the present-day London Road and ran parallel and to the north of the present-day Woodsgate Park. The road joined Gunters Lane approximately along the present-day entrance to Charters Ancaster School."
			}, {
				"name": "Woodsgate Park",
				"date": "1894",
				"desc": "The estate first appears in local street directories in 1894 when Woodsgate House and Park were completed. Thereafter there is a confusing list of road names in the street directories and on maps as the estate is developed on both sides of the Bexhill to Crowhurst railway branch line which opened in 1902. Often there were a number of years between a road being laid out and named and properties being built on that road. The following list of “Woodsgate” roads may need to be revised as further information is collected. On a 1909 map Woodsgate Park was considered an extension of St Georges Road. (Adopted by Borough of Bexhill, ie road over railway bridge, 28th April 1954 and rest of road 26th February 1958)."
			}, {
				"status": "bygone",
				"name": "Woodsgate Park Road",
				"date": "1901 to c1910",
				"desc": "This avenue ran parallel of the present-day Woodsgate Park. The road joined Gunters Lane approximately along the present-day entrance to Charters Ancaster School."
			}, {
				"name": "Woodsgate Place",
				"date": "before 1778",
				"desc": "Lane leading up to what was once Woodsgate Farm."
			}, {
				"name": "Woodstock Road",
				"date": "after 1974 but before 1995",
				"desc": "Probably the name refers to a group of houses close to woods. The word is derived from Old English meaning a settlement in woodland; Kite's Nest Wood and Wet Wood are nearby. (Adopted by East Sussex County Council on an unknown date)."
			}, {
				"name": "Woodville Road",
				"date": "1898",
				"desc": "The origin of the name remains uncertain. Possibly the name refers to the wooded areas within the nearby Egerton Park being close to a development of houses; the French word ville meaning a town. (Adopted by Borough of Bexhill 16th March 1914)."
			}, {
				"name": "Worsham Drive",
				"date": "before 1841",
				"desc": "Leading to Upper and Little Worsham Farms as well as Worsham Cottages. The name may be derived from a person called Wyrtel. The outline of the drive can be seen on an Ordnance Survey map 1795 to 1825. It now forms part of Worsham Lane. Street directories only list properties as belonging to \"Worsham\" rather than the drive or lane."
			}, {
				"name": "Worsham Lane",
				"date": "road ~1841; name c1930s",
				"desc": "Previously known as Worsham Drive. Leading to Upper and Little Worsham Farms as well as Worsham Cottages. The name may be derived from a person called Wyrtel. The outline of the drive can be seen on an Ordnance Survey map 1795-1825. Street directories only list properties as belonging to “Worsham” so the date of the change of name from drive to lane remains unclear but was before at least 1937. (This road had not been adopted by East Sussex County Council by January 2014)."
			}, {
				"name": "Wrestwood Close",
				"date": "1937",
				"desc": "Named after the former Wrest Wood which itself was previously called Rist Wood. In 1327 a Robert de Reste had a home nearby. More recently the British diplomat Sir Edward Malet (1837 to 1908) owned the house and gardens called Wrest Wood; the site is now St Mary's School and College. (Adopted by Borough of Bexhill 27th September 1961)."
			}, {
				"name": "Wrestwood Parade",
				"date": "2024",
				"desc": "Named after the former Wrest Wood which itself was previously called Rist Wood. In 1327 a Robert de Reste had a home nearby."
			}, {
				"name": "Wrestwood Road",
				"date": "road ~1841; name 1919",
				"desc": "Named after the former Wrest Wood which itself was previously called Rist Wood. In 1327 a Robert de Reste had a home nearby. More recently the British diplomat Sir Edward Malet (1837 to 1908) owned the house and gardens called Wrest Wood; the site is now St Mary's School and College. Originally described as the road from the junction with Chantry Avenue to the junction with Hastings Road, the present-day road runs from the junction with Ninfield Road to Hastings Road. The section between Ninfield Road and Chantry Avenue was previously known as Biggs Hill and then Haddocks Hill. (Adopted at an unknown date as a publicly maintainable highway under the 1835 Highways Act)."
			}, {
				"name": "Wychurst Gardens",
				"date": "1939",
				"desc": "Wych means a tree with pliant branches such as the rowan. The word is also linked to wych-alder or witch-hazel as well as wych-elm. This development is built on woodland surrounding a large property and grounds called Wrest Wood, the former home of the British diplomat, Sir Edward Malet (1837 to 1908). St Mary's School and College is now on the Wrest Wood site. (The Briary and The Glades are nearby). (Adopted by Borough of Bexhill, 1st part 27th March 1957, 2nd part 1st January 1958 and last part 27th September 1971)."
			}, {
				"name": "York Road",
				"date": "1937",
				"desc": "Prince Albert, Duke of York and later King George VI (1895 to 1952), was the second son of King George V. (Gloucester Avenue and Kent Close are nearby). (This road had not been adopted by East Sussex County Council by January 2014)."
			}
		],
		"streetWip": [{
				"name": "Millers Corner",
				"date": "2022"
			}, {
				"name": "Whitefield Way",
				"date": "2021"
			}, {
				"name": "Pelton Close",
				"date": "2019"
			}, {
				"name": "Clarence Gardens",
				"date": "2014"
			}, {
				"name": "Bramlea Close",
				"date": "2006"
			}, {
				"name": "Lucy Way",
				"date": "2003"
			}, {
				"name": "Glenburn Close",
				"date": "2000"
			}, {
				"name": "Redwell Avenue",
				"date": "1998",
				"adopted": "unknown"
			}, {
				"name": "Kingscott Close",
				"date": "1996"
			}, {
				"name": "Chelgates",
				"date": "1991"
			}, {
				"name": "Chalden Place",
				"date": "1972",
				"adopted": "1967-02-15"
			}, {
				"name": "Millham Close",
				"date": "1967",
				"adopted": "1971-12-20"
			}, {
				"name": "Gordon Place",
				"date": "1961",
				"adopted": "1961-03-01"
			}, {
				"name": "Dalehurst Road",
				"date": "1937",
				"adopted": "1953-02-25"
			}, {
				"name": "Bidwell Avenue",
				"date": "1936",
				"adopted": "1937-06-28;1958-03-26"
			}, {
				"name": "Glenthorn Road",
				"date": "1935"
			}, {
				"name": "Silvester Road",
				"date": "1911",
				"adopted": "1929-12-23"
			}, {
				"name": "Bancroft Road",
				"date": "1901",
				"adopted": "1958-04-30"
			}, {
				"name": "Maberley Road",
				"date": "1899",
				"adopted": "1955-04-27"
			}
		]
	}
}
